{
  "recipes": [
    {
      "id": "d45901ddf",
      "name": "Arroz a la parmesana",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-a-la-parmesana/",
      "ingredients": [
        "250 g arroz",
        "100 g tacos jamón",
        "150 g queso parmesano",
        "1 cebolla",
        "1 ajo",
        "550 ml. caldo carne",
        "Sal y pimienta",
        "1 cucharada de aceite",
        "1 cucharada de mantequilla",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero picamos la cebolla y la sofreímos en una sartén grande con el aceite i la mantequilla . Antes de que empiece a ponerse dorara le añadimos los tacos de jamón y seguidamente añadimos el ajo muy picado. Y sal pimentamos.",
        "A continuación agregamos el arroz. Le damos unas vueltas y después de 2 minutos vamos añadiendo poco a poco los 850 ml. de caldo. Para que arroz absorba poco a poco i nos de la textura del rissotto.",
        "Cuando el arroz este casi listo i tenga la textura deseada añadimos la mitad del queso parmesano y removemos bien y lo dejamos cocer a fuego lento 2 minutos hasta que veamos que el arroz ha absorbido casi todo el caldo. Mientras se hace el arroz, encendemos el grill.",
        "Cuando veamos el arroz casi al punto, lo espolvoreamos con lo que nos queda del queso y lo ponemos a gratinar, hasta que se dore un poco."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d45901ddf-m.webp",
      "nutrition": null
    },
    {
      "id": "d458vgm26",
      "name": "Arroz con fideos",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-fideos/",
      "ingredients": [
        "4 vasos de arroz",
        "8 cucharadas fideos",
        "2 cucharadas aceitem",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero lavamos bien el arroz. Aparte calentamos el aceite en una sartén y freí­mos los fideos hasta que estén dorados. Sacamos del aceite.",
        "Ponemos 8 vasos de agua a hervir. Mientras, freí­mos el arroz en el mismo aceite de los fideos, removiendo continuamente para evitar que se pegue.",
        "Cuando el agua ya hierva la echamos en la sartén y sazonamos ligeramente. Dejamos hervir y añadimos los fideos, sin dejar de mover. Cuando veamos que se empieza a absorber el agua bajamos el fuego al máximo, unos 30 minutos."
      ],
      "duration": "45 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458vgm26-m.webp",
      "nutrition": null
    },
    {
      "id": "d458u7ktv",
      "name": "Arroz salvaje con pasas y piñones",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-salvaje-con-pasas-y-pinones/",
      "ingredients": [
        "300g de arroz salvaje",
        "100 g piñones",
        "150 g pasas",
        "1 vaso brandy",
        "1 cucharada de salsa de soja",
        "1/2 taza aceite",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Ponemos a hervir en una cazuela el doble de agua que de arroz. Mientras, en el vaso de brandy ponemos en remojo las pasas.",
        "Una vez hierva añadimos el arroz con fuego fuerte hasta que vuelva a hervir de nuevo. Luego bajamos a fuego suave hasta que el agua se evapore. Si el arroz no quedase blando, podemos añadir más agua. Colamos el arroz, lo lavamos con agua frí­a y lo secamos con ayuda de un trapo de cocina.",
        "A continuación, en una sartén grande, rehogamos con un chorrito de aceite el arroz, junto con los piñones y las pasas maceradas de brandy. Removemos bien y al final añadimos un chorrito de salsa de soja para que tome color.",
        "Servimos enseguida."
      ],
      "duration": "55 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458u7ktv-m.webp",
      "nutrition": null
    },
    {
      "id": "d458u0abu",
      "name": "Bolas de arroz onigiri",
      "url": "http://www.recetasdiarias.com/recetas/arroz/bolas-de-arroz-onigiri/",
      "ingredients": [
        "300 g arroz",
        "450 ml de agua",
        "75 g salmón ahumado picado",
        "4 hojas de nori",
        "2 cucharadas salsa de soja",
        "2 cucharadas semillas sésamo negro",
        "2 cucharadas jengibre encurtido picado",
        "2 cebolletas picadas",
        "Aceite",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero lavamos bien el arroz. Ponemos 450 ml de agua a hervir en una cazuela. Cuando hierva agregamos el arroz y lo cocinamos a fuego fuerte los 5 primeros minutos. Luego bajamos el fuego al mí­nimo, tapamos la cazuela y cocemos durante 15 minutos.",
        "Pasado este tiempo retiramos el arroz del fuego y lo dejamos reposar tapado durante 20 minutos.",
        "Aparte, en una sartén pequeña con un poco de aceite, freí­mos las semillas de sésamo hasta que empiecen a chasquear y reservamos. En un bol mezclamos bien el salmón, la cebolleta y el jengibre.",
        "A continuación nos humedecemos las manos y vamos haciendo bolas de arroz, introduciendo en el centro 2 cucharaditas del revuelto de salmón. Luego le volvemos a dar la forma de bola al arroz y aderezamos con unas semillas de sésamo negro.",
        "Repetimos la operación hasta terminar el arroz, y por último las medio envolvemos con las hojas de nori. Servimos templadas o frí­as."
      ],
      "duration": "55 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458u0abu-m.webp",
      "nutrition": null
    },
    {
      "id": "d4590c17t",
      "name": "Arroz a la cubana",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-a-la-cubana/",
      "ingredients": [
        "400 g de arroz",
        "4 huevos",
        "4 plátanos",
        "1 bote de tomate frito",
        "4 hojas de perejil (decorar)  Aceite de oliva",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "En una cacerola ponemos 1200 ml de agua, una pizca de sal, una cucharada de mantequilla y un chorrito de aceite",
        "Cuando rompa a hervir añadimos el arroz y lo dejamos 10 minutos, el tiempo de cocción dependerá del tipo de arroz, removiendo de vez en cuando para que no se apelotone.",
        "Una vez hecho el arroz, que no debe quedar duro pero tampoco hecho una pasta, lo colamos y enjuagamos ligeramente y  enfriamos con agua fría y dejamos escurrir.",
        "Pelamos los plátanos y los cortamos al gusto, ya sea en rodajas o a lo largo.",
        "En otra sartén, con poco de aceite de oliva a fuego medio freimos el plátano. Retiramos y colocamos en papel absorbente.",
        "Ahora prepararemos el huevo frito en una sartén antiadherente con un dedo de aceite.",
        "Cuando echa humo cascamos el huevo. Con la espumadera echamos aceite por encima.",
        "Cuando el huevo queda suelto y flotando en la sartén, sacamos con la espumadera, quedando a punto de servir.",
        "Debemos salar los huevos después de sacarlos del aceite.",
        "Calentamos el arroz ligeramente en el microondas.",
        "Servimos el arroz, añadimos la salsa de tomate frita y los plátanos."
      ],
      "duration": "25 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d4590c17t-m.webp",
      "nutrition": null
    },
    {
      "id": "1a0gsog3b",
      "name": "Arroz con champiñones",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-champinones/",
      "ingredients": [
        "300 g arroz",
        "200 g champiñones frescos",
        "700 ml caldo de verduras",
        "2 dientes ajo",
        "1 cebolla grande",
        "1 hoja de laurel",
        "1 ramita perejil",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero picamos la cebolla muy fina y la echamos junto a la hoja de laurel en una olla o sartén con aceite caliente y que vaya dorándose, mientras cortamos a laminas los champiñones previamente pasados por agua.",
        "Picamos muy finos los dos ajos, lo echamos a la olla, dejamos cociendo unos 5 minutos y añadimos el arroz le damos unas vueltas y añadimos el caldo ya caliente.",
        "Dejar cociendo unos 15 o 20 minutos, que vaya absorbiendo el caldo hasta que quede cremoso, y decoramos con la ramita de perejil."
      ],
      "duration": "25 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/1a0gsog3b-m.webp",
      "nutrition": null
    },
    {
      "id": "d458vvv7d",
      "name": "Arroz con calamares al cava",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-calamares-al-cava/",
      "ingredients": [
        "350 g de arroz",
        "350 ml cava",
        "350 ml caldo carne",
        "1 cebolla picada",
        "75cl nata líquida",
        "100 g queso rallado",
        "1 cucharada de mantequilla",
        "Medio manojo de perejil picado",
        "12 rodajas de calamar fresco",
        "Aceite",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero, rehogamos la cebolla en una sartén con un chorrito de aceite y la cucharada de mantequilla. Pasado un minuto añadimos el arroz y sofreímos.",
        "Una vez sofrito agregamos el cava y dejamos hasta que se reduzca por completo a fuego medio.",
        "A continuación añadimos el caldo de carne ya caliente poco a poco y lo dejamos cocer entre 15-20 minutos. Rectificamos la sal y 2 minutos antes de que termine la cocción añadimos el queso rallado y la nata líquida, el medio manojo de perejil bien picado y removemos bien y listo.",
        "Finalmente salteamos las rodajas de calamar con un poco de aceite y sal.",
        "Emplatamos como vemos en la foto y servimos en enseguida, decoramos con una línea de reducción de vinagre de módena.",
        "Receta descubierta por C. Rueda."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458vvv7d-m.webp",
      "nutrition": null
    },
    {
      "id": "d45908tdj",
      "name": "Arroz a la griega",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-a-la-griega/",
      "ingredients": [
        "150 g arroz extra largo",
        "150 g arroz salvaje",
        "50 g puré de tomate",
        "1 cebolla",
        "1 pimiento verde",
        "600 cl caldo de verduras",
        "50 g aceitunas negras",
        "1 ajo muy picado",
        "1 ramita de tomillo y perejil.",
        "1 hoja de laurel",
        "Aceite",
        "1 cucharada de mantequilla",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero picamos finamente la cebolla y la ponemos en una cazuela junto con aceite y la mantequilla, y añadimos el laurel y tomillo, rehogamos un poco y añadimos el pimiento y el ajo, hasta que dore todo.",
        "Añadimos entonces el puré de tomate, mezclamos y echamos el arroz. Mojamos con el caldo hirviendo, volvemos a mezclar todo bien y dejamos cocer tapado entre 10 y 14 minutos aprox. Dentro del horno.",
        "Finalmente sacamos el arroz del horno, rectificamos de sal, mezclamos y añadimos las aceitunas negras picadas. Tapamos y dejamos reposar 2 minutos."
      ],
      "duration": "20 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d45908tdj-m.webp",
      "nutrition": null
    },
    {
      "id": "d458vpk8e",
      "name": "Arroz con almendras",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-almendras/",
      "ingredients": [
        "350 g arroz",
        "120 g almendras",
        "2 zanahorias",
        "1 cebolla",
        "1 cucharada de aceite oliva",
        "1 cucharada de mantequilla",
        "¼ de vaso de vino blanco",
        "Sal pimienta",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero freímos las almendras en un poco de aceite en una sartén, cuando se doren las retiramos de la sartén y en el mismo aceite le añadimos la mantequilla, y la cebolla y zanahoria bien picada, cuando empiece a estar doradito le añadimos el vino blanco y una vez reduzca le añadimos las almendras, removemos bien y salpimentamos.",
        "Luego añadimos el arroz lo rehogamos un poco y le añadimos el doble de agua que de arroz y dejamos que el arroz vaya absorbiendo el agua tiene que quedar un arroz seco, dejar que el arroz absorba bien el agua y rectificamos de sal.",
        "Truco",
        "Se le puede echar una pizca de cualquier especia aromática que nos gusta dará un buen resultado como con curry por ejemplo."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458vpk8e-m.webp",
      "nutrition": null
    },
    {
      "id": "d458u5hd3",
      "name": "Arroz salvaje con pulpo",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-salvaje-con-pulpo/",
      "ingredients": [
        "150 g arroz salvaje",
        "150 g arroz basmati",
        "250 g pulpo cocido",
        "½ vaso de vino blanco",
        "1 zanahoria",
        "1 calabacín",
        "1 cebolla",
        "1 cucharada concentrado tomate",
        "650ml de caldo pescado",
        "1 cucharada de mantequilla",
        "1 cucharada de pimentón dulce",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero picamos muy fina la cebolla y cortamos en daditos la zanahoria y el calabacín.",
        "En una sartén con un chorro de aceite y la cucharada de mantequilla, sofreímos la cebolla, la zanahoria y el calabacín hasta que quede todo bien doradito, entonces añadimos el vino y dejamos reducir un poco. Añadimos luego el concentrado de tomate y mezclamos unos minutos.",
        "Cuando todo esté ya bien mezclado, agregamos los trozos de pulpo y el arroz salvaje con un poco de sal, pimentón y un tercio de caldo de pescado y mantenemos 5 minutos más al fuego.",
        "Entonces añadimos el arroz basmati y el caldo restante, dejamos cocer entre 15-20 minutos, rectificamos de sal y plato listo."
      ],
      "duration": "35 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458u5hd3-m.webp",
      "nutrition": null
    },
    {
      "id": "d45906lng",
      "name": "Arroz a la marinera",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-a-la-marinera/",
      "ingredients": [
        "350 gramos de arroz",
        "200 gramos de calamares",
        "1 cebolla pequeña",
        "2 ajos y Perejil picado",
        "750 ml. de caldo de pescado",
        "Sal",
        "1 pimiento verde",
        "1/2 pimiento rojo",
        "1 vaso de vino blanco",
        "200 gramos de rape limpio",
        "100 gramos de guisantes cocidos",
        "1 pizca Azafrán",
        "Aceite",
        "12 almejas",
        "12 gambas peladas",
        "Pimienta",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero en una paella salteamos 1 minuto en un poco de aceite las gambas y las almejas, para que el aceite coja gusto, retiramos el marisco de la paella y en el mismo aceite incorporamos la cebolla, el pimiento verde y rojo.",
        "Salpimentamos y dejamos sofreír un poco, seguidamente añadiremos al sofrito los guisantes y la picada de ajo y perejil.",
        "Cuando todo este doradito, añadimos el vaso de vino blanco, dejamos reducir un poco e incorporamos el pescado previamente troceado, y dejamos que sofría un poco, entonces añadimos el arroz y el azafrán y rehogamos un poco el arroz, una vez rehogado añadimos el caldo de pescado (fumet) bien caliente.",
        "Cuando arranque a hervir y el arroz empiece a absorber el caldo añadimos el marisco que salteamos previamente y a esperar unos 10 minutos, rectificamos de sal y listo."
      ],
      "duration": "50 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d45906lng-m.webp",
      "nutrition": null
    },
    {
      "id": "d458u3g60",
      "name": "Arroz tres delicias",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-tres-delicias/",
      "ingredients": [
        "400 g arroz basmati",
        "3 huevos",
        "1 zanahoria",
        "250 g de jamón dulce en lonchas gruesas",
        "150 g de gambas peladas",
        "180 g de guisantes (1 lata)",
        "Aceite de oliva",
        "Pimienta negra molida",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero procedemos a hervir el arroz: Dos medidas de agua por cada medida de arroz, junto con un poco de sal, pimienta y un poco de aceite y lo dejamos a fuego lento. Una vez hecho lo escurrimos en agua frí­a y lo reservamos en un bol.",
        "Con los huevos hacemos en otra sartén una tortilla francesa y la dejamos enfriar un poco. Una vez templada la cortamos en cuadraditos.",
        "Cortamos la zanahoria y el jamón dulce en trocitos pequeños.",
        "En una sartén grande con un poco de aceite salteamos las gambas hasta que se doren un poco.",
        "Agregamos los guisantes, la zanahora y el jamón dulce a la sartén.",
        "Cocinamos por 2 minutos dando vueltas, hasta que estén dorados",
        "Agregamos el arroz y lo salteamos unos minutos dando vueltas.",
        "Opcionalmente puedes agregar una cucharada de salsa de soja."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458u3g60-m.webp",
      "nutrition": null
    },
    {
      "id": "1a0gsq3e9",
      "name": "Arroz a la milanesa",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-a-la-milanesa/",
      "ingredients": [
        "300 g de arroz",
        "1 tomate grande",
        "1 cebolla mediana",
        "1 pimiento rojo",
        "2 dientes de ajo",
        "50 g de jamón serrano a taquitos",
        "½ vaso de vino blanco",
        "50 g queso parmesano rallado",
        "Sal",
        "Aceite de oliva",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero picamos my fina la cebolla, el pimiento, el tomate previamente pelado y lo ponemos a sofreír con un poco de aceite y cuando empiece a coger color añadimos los ajos laminados y el jamón.",
        "Dejamos sofreír 2 minutos, añadimos la sal y el vino blanco y dejamos reducir vino.",
        "Echamos el arroz y lo removemos. Añadimos el caldo de verduras y dejamos cocer entre 8 y 10 minutos aproximadamente.",
        "Esparcimos el queso rallado sobre el arroz, removemos suavemente y volvemos a poner a cocer unos 3 minutos a fuego lento. Servir caliente."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/1a0gsq3e9-m.webp",
      "nutrition": null
    },
    {
      "id": "d458u1ce7",
      "name": "Arroz verde",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-verde/",
      "ingredients": [
        "300 g de arroz",
        "600ml de agua",
        "100 g de guisantes",
        "100 g de espárragos trigueros",
        "150 g gambas peladas",
        "2 ajos",
        "2 hojas de laurel",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Ponemos 300ml de agua al fuego, y cuando hierva, introducimos las gambas y las sacamos al momento. Les quitamos el agua sin tirarla, y las pelamos. También troceamos los espárragos.",
        "A continuación ponemos el arroz a cocer en el agua de las gambas, a fuego suave y agregamos el resto del agua 300ml. Agregamos 2 ajos, con piel y todo y aplastados y las 2 hojas de laurel.",
        "A media cocción, agregamos los guisantes y los espárragos.",
        "Cuando esté el arroz a punto de retirarse del fuego, añadimos las gambas y ponemos un poco de sal."
      ],
      "duration": "50 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458u1ce7-m.webp",
      "nutrition": null
    },
    {
      "id": "d458vug94",
      "name": "Arroz al horno",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-al-horno/",
      "ingredients": [
        "300 g de arroz bomba",
        "1 morcilla de arroz (de burgos a poder ser)",
        "100 g de chorizo",
        "½ k de costilla de cerdo",
        "100 g de garbanzos",
        "2 tomates",
        "3 ñoras o 1 cucharada de pimiento xoricero",
        "1 patata",
        "1 cabeza de ajos",
        "1 pizca de azafrán",
        "650 ml de caldo de carne",
        "Aceite de oliva",
        "Sal y pimienta",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Ponemos en remojo los garbanzos 24h. Luego escurrimos el agua vieja, ponemos nueva y cocemos los garbanzos unos 12 minutos.",
        "Poner las ñoras de agua, que queden cubiertas, 30 minutos en remojo.",
        "Por otro lado en una cazuela de barro, freímos las costillas de cerdo salpimentadas unos 10 minutos, sacamos las ñoras del remojo, extraemos las pepitas, que no las queremos, trituramos la ñora con un poco de agua de remojo y añadimos a la costilla que esta friendo, luego le añadimos el tomate bien pelado y picado y la patata pelada y troceada, a los dos minutos añadimos el arroz i el azafrán y rehogamos todo bien, luego añadimos los garbanzos ya cocidos y escurridos.",
        "A continuación colocamos la morcilla cortada en rodajas, los 100 g de chorizo troceado, y la cabeza de ajo, añadimos el caldo de carne y horneamos a 180° durante 15-20 minutos aproximadamente. Y arroz al horno listo."
      ],
      "duration": "45 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458vug94-m.webp",
      "nutrition": null
    },
    {
      "id": "1a0gsolf2",
      "name": "Arroz con butifarra blanca",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-butifarra-blanca/",
      "ingredients": [
        "350 g arroz",
        "1 butifarra blanca",
        "1 puerro",
        "1 zanahoria",
        "1/2 cebolla",
        "1 diente ajo",
        "750ml. de caldo de carne",
        "Azafrán",
        "Perejil",
        "Aceite",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero cortamos la cebolla y la zanahoria en cuadraditos pequeños y el puerro en aros finos. Seguidamente ponemos un chorro de aceite en la paella y añadimos los ingredientes anteriores para hacer el sofrito. Mientras, picamos el ajo y lo machacamos en un mortero con unas hebras de azafrán y unas hojitas de perejil.",
        "Cuando las verduras estén un poco blanditas añadimos el arroz junto con el contenido del mortero. Lo rehogamos todo bien y luego le añadimos el caldo. Rectificamos de sal, cortamos la butifarra blanca en rodajas no muy gruesas y las añadimos al arroz.",
        "Dejamos el arroz entre 15-20 minutos o hasta que se consuma el agua. Luego retiramos del fuego y dejamos reposar unos 4 minutos."
      ],
      "duration": "35 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/1a0gsolf2-m.webp",
      "nutrition": null
    },
    {
      "id": "d458vi6ch",
      "name": "Arroz con coco",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-coco/",
      "ingredients": [
        "400g. de arroz",
        "1l. de leche de coco",
        "2 tazas de agua",
        "100g. de azúcar",
        "1 cucharadita de sal",
        "1 rama de canela",
        "1 cucharadas clavos (especia)",
        "2 pedazos de jengibre",
        "100g. de pasas",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Echar 1 taza de agua en una ollita y añadirle el jengibre ya machacado, también le echamos los clavos y la canela y ponemos la ollita ha hervir unos 12 minutos desde que empieza ha hervir, luego lo colamos y dejamos que se enfríe, y entonces lo mezclamos con la leche de coco.",
        "Entonces en una olla más grande ponemos a hervir el arroz y la leche de coco aromatizada con una pizca de sal.",
        "Dejamos que cueza entre 10-15 minutos y cuando empiece a absorber bien y quede cremoso, le añadimos las pasas y el azúcar.",
        "Removemos bien a fuego lento uno 5 minutos mas, y listo, servir frio.",
        "Al emplatar espolvorear canela en polvo, i si se quiere tomar caliente hacemos el mismo procedimiento, pero le quitamos el azúcar y la canela y listo."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458vi6ch-m.webp",
      "nutrition": null
    },
    {
      "id": "1a0gsqkog",
      "name": "Arroz a la boloñesa",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-a-la-bolonesa/",
      "ingredients": [
        "250 g arroz",
        "500 g carne picada",
        "3 tomates",
        "1 zanaoria",
        "2 dientes ajo",
        "1 hoja laurel",
        "2 cucharadas queso parmesano rallado",
        "2 cucharadas mantequilla",
        "1 cebolleta",
        "Aceite",
        "1 vaso vino blanco",
        "Perejil",
        "Pimienta negra",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero de todo salpimentamos la carne. En una cazuela mediana, sofreímos en la mantequilla y en dos cucharadas de aceite, primero la cebolla i la zanahoria con la hoja de laurel que dore un poco, y entonces añadimos el ajo todo picado muy fino.",
        "Una vez preparado el sofrito, añadimos la carne picada y removemos al fuego hasta que la carne empiece a tomar color y entonces añadimos el vino blanco y dejamos reducir.",
        "Mientras, pelamos y picamos los tomates, y el perejil, y lo añadimos a la cazuela, dejándolo a fuego medio, sin dejar de remover. (consejo los tomates los podemos escaldar unos segundos y enfriar rápidamente en agua muy fría, para que la piel salga sola).",
        "Cuando la carne esté cocinada, echamos el arroz a la cazuela y lo mezclamos bien con la carne. Ponemos a calentar aparte agua (el doble de agua que de arroz). Cuando esté caliente lo echamos a la cazuela y dejamos que se cueza durante 20 minutos a fuego suave."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/1a0gsqkog-m.webp",
      "nutrition": null
    },
    {
      "id": "d45903aa0",
      "name": "Arroz a la naranja",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-a-la-naranja/",
      "ingredients": [
        "320 g de arroz",
        "3 naranjas",
        "2 diente de ajo",
        "1 cebolla grande",
        "Aceite de oliva",
        "1 cucharada de mantequilla",
        "50 g parmesano",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Calentamos 3 cucharadas de aceite y 1 de mantequilla, en una sartén mediana, añadimos la cebolla y cuando dore un poco añadimos el ajo bien picado, y sazonamos.",
        "Exprimimos las 3 naranjas y reservamos el zumo. Utilizamos media corteza de naranja para picarla muy finita.",
        "Luego añadimos el arroz, la corteza de naranja picada y rehogamos con la cebolla y el ajo.",
        "Agregamos agua al zumo de naranja hasta conseguir 640 ml, lo echamos a la sartén y mientras va cociendo a fuego lento, vamos moviendo para conseguir el efecto risotto y por último le añadimos el parmesano removemos bien, rectificamos de sal i listo."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d45903aa0-m.webp",
      "nutrition": null
    },
    {
      "id": "d458vo0vh",
      "name": "Arroz con bacalao",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-bacalao/",
      "ingredients": [
        "300 g arroz",
        "300 g bacalao desmigado y desalado",
        "700ml. de fumet de pescado",
        "2 cebollas",
        "1 tomate maduro",
        "1 pimiento verde",
        "2 ajo",
        "Pimentón dulce",
        "Una hebra azafrán",
        "Aceite",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero el día anterior dejamos el bacalao en agua i la vamos cambiando, para desalar.",
        "Picamos la cebolla muy fina i la echamos en una sartén con aceite caliente, luego cortamos el pimiento juliana y para dentro.",
        "El ajo lo cortamos a laminas y lo echamos cuando la cebolla i el pimiento este doraditos, sofreír 3 o 4 minutos más y añadimos el tomate previamente pelado y triturado y dejamos reducir unos minutos.",
        "Le añadimos el azafrán e incorporamos el bacalao, dejamos unos 5 minutos, añadimos el arroz y una pizca de pimentón, le damos unas vueltas, echamos el fumet de pascado, rectificamos de sal y dejamos que el arroz absorba el agua hasta que quede un arroz cremoso."
      ],
      "duration": "35 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458vo0vh-m.webp",
      "nutrition": null
    },
    {
      "id": "d458vsn11",
      "name": "Arroz al limón",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-al-limon/",
      "ingredients": [
        "350 g arroz largo",
        "2 limones",
        "2 cucharadas mantequilla",
        "Canela en rama",
        "1 pizca de comino",
        "1 cucharadita de mostaza negra",
        "1 pizca de jengibre rallado",
        "Perejil",
        "Aceite",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Calentamos una cucharada de aceite en una cazuela y salteamos el comino y la mostaza.",
        "Luego agregamos el arroz y lo removemos unos 3 minutos. Entonces añadimos el agua, el doble que de arroz, la canela, el jengibre y un poco de sal.",
        "A continuación tapamos la cazuela y lo dejamos cocinando a fuego lento entre 20 y 25 minutos, o hasta que veamos que el arroz ha absorbido todo el líquido.",
        "Seguidamente rociamos por encima con el jugo de medio limón y la mantequilla, dejándolo al fuego 2 minutos más tapando la cazuela."
      ],
      "duration": "35 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458vsn11-m.webp",
      "nutrition": null
    },
    {
      "id": "d458vr8p2",
      "name": "Arroz blanco con salmón",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-blanco-con-salmon/",
      "ingredients": [
        "400 g arroz largo",
        "100 g salmón ahumado",
        "1 bote de nata líquida",
        "1 cebolla",
        "1 pepino",
        "2 cucharadas perejil picado",
        "1 hebra azafrán",
        "Aceite oliva",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero hervimos el arroz en agua con sal y aceite entre 10 y 15 minutos. Escurrimos, enfriamos y reservamos para más tarde.",
        "En una sartén salteamos la cebolla bien picada hasta que dore un poco y añadimos el arroz, le damos un par de vueltas y añadimos el azafrán diluido en un chorrín de nata.",
        "Damos dos vueltas, le añadimos el pepino y el salmón previamente cortado y el resto de la nata. Dejamos que la salsa reduzca un poco y el arroz nos quede con una textura parecida al rissotto.",
        "Finalmente agregamos el perejil fresco picado, removemos con cuidado y servimos."
      ],
      "duration": "35 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458vr8p2-m.webp",
      "nutrition": null
    },
    {
      "id": "d458ub6ib",
      "name": "Arroz rojo",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-rojo/",
      "ingredients": [
        "400 g de arroz",
        "6 dientes de ajo",
        "4 ñoras secas",
        "1 patata",
        "1/2 k habichuelas cocidas",
        "Pimentón dulce",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "En una cazuela honda freí­mos los ajos partidos por la mitad hasta que estén bien doraditos.",
        "A continuación freí­mos las ñoras limpias de pipas y agregamos el pimentón, vigilando que no queme. Inmediatamente añadimos agua (unas 9 tazas) y la patata ya cortada, junto con un poco de sal.",
        "Luego echamos las habichuelas y cuando veamos que el caldo ha espesado reservamos una taza por si hay que añadí­rselo al arroz. Añadimos entonces el arroz y lo dejamos a fuego medio unos 20 minutos, hasta que lo veamos caldoso."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458ub6ib-m.webp",
      "nutrition": null
    },
    {
      "id": "1a0gsob8n",
      "name": "Arroz con chorizo",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-chorizo/",
      "ingredients": [
        "350 g de arroz",
        "200 g chorizo",
        "700ml de caldo de carne",
        "4 dientes de ajo",
        "1 cebollas grande",
        "2 tomates",
        "1 pimiento",
        "1 cucharada de pimenton picante",
        "Cilantro",
        "Perejil",
        "Pimienta",
        "Aceite",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero picamos finamente los dientes de ajo, el perejil y la cebolla. Troceamos los tomates y el pimiento y cortamos el chorizo en trozos pequeños.",
        "A continuación en una sartén grande sofreímos en un buen chorro de aceite los ingredientes anteriores durante unos minutos. Opcionalmente podemos agregar 1 grano de caiena picada para darle un toque más picante al plato. Cuando la cebolla coja color añadimos el arroz y el pimentón y sofreímos 2 minutos.",
        "Después añadimos a la sartén el caldo de carne, removemos, agregamos pimienta y cilantro y dejamos cocinar entre 15 o 20 minutos o hasta que el arroz haya absorbido el agua y rectificamos de sal.",
        "Receta revisada por C. Rueda."
      ],
      "duration": "35 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/1a0gsob8n-m.webp",
      "nutrition": null
    },
    {
      "id": "d458usrqq",
      "name": "Arroz frito con aguacate",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-frito-con-aguacate/",
      "ingredients": [
        "200 g de arroz",
        "1 aguacate",
        "1 tomate",
        "1 cebolleta",
        "1 dientes de ajo",
        "Hebras azafrán",
        "Aceite de oliva",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero pelamos y picamos en dados pequeños la cebolla y los dientes de ajo, y los ponemos en una cazuela mediana, con tres cucharadas de aceite, y lo sofreí­mos durante dos minutos.",
        "A continuación echamos el arroz y removemos un poco para que coja el sabor. En ese momento agregamos agua, dos tazas por cada taza de arroz, las hebras de azafrán y la sal. Dejamos hervir 20 minutos, hasta que el arroz haya absorbido el agua.",
        "Mientras, cortamos el aguacate y el tomate en dados. Una vez cocido el arroz lo sacamos de la cazuela y lo dejamos enfriar. Finalmente, lo servimos acompañado del aguacate y el tomate."
      ],
      "duration": "30 minutes ",
      "serves": "2",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458usrqq-m.webp",
      "nutrition": null
    },
    {
      "id": "d458uvqnl",
      "name": "Arroz dorado",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-dorado/",
      "ingredients": [
        "350 g arroz",
        "200 g jamón york",
        "200 g champiñon",
        "100 g queso rallado",
        "50 g mantequilla",
        "1 cebolla",
        "3/4 l caldo de carne",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero lavamos bien los champiñones y los cortamos en láminas. Pelamos y picamos la cebolla y el jamón. Ponemos a calentar el caldo en una olla aparte.",
        "Luego derretimos la mantequilla en una cazuela a fuego lento y rehogamos la cebolla hasta que quede transparente. Incorporamos entonces el arroz y rehogamos para que tome un poco de color.",
        "A continuación agregamos los champiñones y el jamón. Damos unas vueltas y añadimos el caldo ya caliente, el doble que de arroz. Salamos, tapamos y dejamos a fuego medio durante unos 20 minutos. Luego rectificamos de sal y retiramos del fuego.",
        "Dejamos reposar el arroz tapado unos 5 minutos, y servimos con el queso rallado aparte."
      ],
      "duration": "60 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458uvqnl-m.webp",
      "nutrition": null
    },
    {
      "id": "1a0gsgcjd",
      "name": "Arroz con verduras y gambas",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-verduras-y-gambas/",
      "ingredients": [
        "300g de arroz",
        "600ml de caldo de verduras",
        "1 cebolla",
        "1 zanahoria",
        "1 pimiento verde",
        "100g de habichuelas (judías verdes)",
        "100g de gambas peladas (frescas o congeladas)",
        "1 tomate fresco o 2 de lata",
        "Aceite de oliva",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Picamos muy fino la cebolla, el tomate, la zanahoria, el pimiento verde y las habichuelas y ponemos a rehogar en una paellera en la que previamente habremos puesto a calentar un chorrito de aceite de oliva.",
        "Dejamos hacer a fuego muy muy lento. Una vez que está hecho incorporamos el arroz y rehogamos durante unos minutos con calma y removiendo. Añadimos entonces las gambas y seguimos removiendo para que se impregnen bien del refrito.",
        "Acto seguido echamos el caldo, rectificamos de sal y ya no movemos más. Transcurridos unos 20 minutos (o el tiempo que tarde en absorber el caldo), apagamos el fuego, dejamos reposar y, ¡listo para comer!"
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/1a0gsgcjd-m.webp",
      "nutrition": null
    },
    {
      "id": "d458vetjs",
      "name": "Arroz con gambas",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-gambas/",
      "ingredients": [
        "300 g arroz",
        "300 g gambas",
        "20 mejillones",
        "1/2 vaso vino blanco",
        "1 cebolla",
        "4 tomates maduros",
        "1 puerro",
        "1 bote pequeño de salsa tomate",
        "Aceite",
        "Pimienta",
        "Laurel",
        "2 ajos",
        "Perejil",
        "1 litro de agua",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero hacemos un caldo con las pieles de las gambas, ponemos en una olla ha hervir el litro de agua, las cascaras de las gambas, los tomates maduros cortados a cuartos, los 20 mejillones que habremos limpiado previamente, el puerro cortado juliana y pasado por agua, la parte mas verde oscura también nos sirve para el caldo, sal pimienta y dejamos cocer 25 minutos, una vez pasado el tiempo colamos el caldo y lo reservamos, también guardamos la carne de los mejillones.",
        "Por otro lado picamos la cebolla muy fina y la echamos junto al laurel, en una sartén con aceite caliente, y que dore un poco unos 5 minutos.",
        "Mientras dora picamos el perejil y el ajo, y lo añadimos a la sartén junto a las gambas, salteamos un poco unos 4 minutos y añadimos el vino y dejamos que reduzca, una vez haya reducido añadimos la salsa de tomate sal pimentamos y dejamos sofreír 5 minutos, luego echamos el arroz lo dejamos un par de minutos removiendo, echamos el fumet de pescado que hemos preparado anteriormente, bien caliente y dejamos cocer unos 15-20 minutos y por último le añadimos la carne de los mejillones y listo."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458vetjs-m.webp",
      "nutrition": null
    },
    {
      "id": "d458uq5hl",
      "name": "Arroz integral al vino dulce",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-integral-al-vino-dulce/",
      "ingredients": [
        "350 g arroz integral",
        "850ml de caldo vegetal",
        "2 cebollas rojas",
        "1 calabací­n",
        "2 cucharada vino dulce",
        "Pimienta",
        "Aceite",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Cortamos la cebolla y el calabací­n en dados, salpimentamos y lo ponemos a freí­r en una sartén a fuego suave con un chorrito de aceite.",
        "Cuando veamos que la cebolla va tomando un color transparente añadimos el vino dulce y seguimos friendo hasta que adquiera un ligero color dorado.",
        "Seguidamente añadimos el arroz, rehogamos y le añadimos el caldo de verduras, dejamos cocer durante unos 15-20 minutos para que tome sabor y servimos caldoso.",
        "Receta enviada por C. Rueda."
      ],
      "duration": "35 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458uq5hl-m.webp",
      "nutrition": null
    },
    {
      "id": "d458t14pi",
      "name": "Risotto de espárragos trigueros",
      "url": "http://www.recetasdiarias.com/recetas/arroz/risotto-de-esparragos-trigueros/",
      "ingredients": [
        "400 gr. de arroz",
        "1 manojo de espárragos trigueros",
        "100 gr. de jamón en tacos",
        "1 cebolla",
        "4 nueces picadas",
        "50g de queso parmesano",
        "850ml de caldo de jamón",
        "Vino blanco",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "En primer lugar vamos a trocear los espárragos, los cuales pueden ser frescos o congelados, si es así les dejaremos descongelar primero. En una sartén que tenga bastante fondo o en una paellera calentamos tres cucharadas de aceite de oliva y sofreímos la cebolla bien picada, una vez dorada, agregamos los espárragos y sofreimos tres minutos. Una vez hecho esto, se añade el jamón cortado en tacos y las nueces troceadas. Lo revolvemos todo e inmediatamente incorporamos el arroz, un chorro de vino blanco y sal al gusto.",
        "En un fuego a parte habremos calentado el caldo de jamón (este se puede hacer perfectamente con agua y una pastilla de caldo de jamón, o se compra ya hecho en brick). Lo añadimos al arroz y sin dejar de remover lo llevamos al punto de ebullición, bajamos el fuego y cocemos hasta que el arroz este hecho unos 20 minutos en total (si vemos que durante la cocción el arroz se seca se puede añadir un poquito de agua).",
        "Una vez cocinados todos los ingredientes, apagamos el fuego y le añadimos queso parmesano rallado y revolvemos para que se funda y ya se puede servir."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458t14pi-m.webp",
      "nutrition": null
    },
    {
      "id": "d458ugm39",
      "name": "Arroz negro",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-negro/",
      "ingredients": [
        "300 g de arroz",
        "250 g de sepias en su tinta",
        "250 de calamares en su tinta",
        "1/2 l de vino blanco",
        "700ml de caldo de pescado",
        "Cebolla",
        "Ajo",
        "Laurel",
        "Perejil picado",
        "Pimienta",
        "Aceite",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Picamos el ajo y lo freí­mos a fuego lento junto con el laurel en un puchero con aceite de oliva. Una vez el ajo esté dorado, retiramos las hojas del laurel y las picamos.",
        "Añadimos las sepias y los calamares limpios y en trozos, sin olvidarse de la tinta de ambos. Al cabo de unos minutos, echamos las hojas de laurel trituradas y lo dejamos al fuego, sin tapar.",
        "Ponemos una paellera al fuego con aceite y echamos la cebolla previamente picada hasta que parezca transparente. Luego añadimos el arroz y removemos mientras se frí­e un poco.",
        "Vertimos el vino y dejamos que se vaya evaporando, añadiendo la mitad del caldo de pescado. Lo cocemos unos 10 minutos.",
        "Luego añadimos el resto del caldo, con las sepias y los calamares en su tinta, ya sofritos. Cocer 15 minutos más, hasta que el arroz este en su punto."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458ugm39-m.webp",
      "nutrition": null
    },
    {
      "id": "d458v1t13",
      "name": "Arroz de primavera",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-de-primavera/",
      "ingredients": [
        "300 g arroz",
        "200 g guisantes",
        "2 zanahorias",
        "1 pimiento rojo",
        "1 pimiento verde",
        "650ml de caldo de verduras",
        "1 cebolla",
        "1 diente ajo",
        "6 cucharada aceite",
        "Perejil",
        "Azafrán",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero pelamos la cebolla y la picamos muy fina. Pelamos las zanahorias, las lavamos y las cortamos en trozctos y los pimientos los cortamos juliana.",
        "Calentamos el aceite en una cazuela y sofreímos la cebolla hasta que quede transparente. Añadimos entonces las zanahorias, los pimientos, y los guisantes y sofreímos otros 5 minutos. En otra cazuela ponemos a calentar el caldo de verduras.",
        "Aparte, echamos en el mortero el ajo, 6 hebras de azafrán, el perejil y un poco de sal y machacamos. Cuando esté bien majado lo añadimos al sofrito y mezclamos con el resto de ingredientes.",
        "A continuación incorporamos el arroz, removemos y añadimos el caldo de verduras caliente. Cocemos a fuego fuerte durante 10 minutos y comprobamos el punto de sal.",
        "Bajamos el fuego y cocemos unos 8 minutos más. Tras este tiempo retiramos la cazuela del fuego y dejamos que el arroz repose entre 3 y 5 minutos.",
        "Servimos templadito especialmente en primavera."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458v1t13-m.webp",
      "nutrition": null
    },
    {
      "id": "1a0gsl5ba",
      "name": "Arroz integral con verduras",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-integral-con-verduras/",
      "ingredients": [
        "300 g de arroz integral",
        "1 litro de agua o caldo de verduras",
        "100 g de judí­as verdes",
        "2 zanahorias",
        "50 g de espinacas",
        "1 tomate",
        "2 dientes de ajo",
        "Aceite",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Picamos las judí­as, las zanahorias, el tomate y los ajos y lo rehogamos todo en una cazuela, con aceite. Añadimos el arroz y lo rehogamos para que quede suelto.",
        "Agregamos el caldo y la sal y lo dejamos cocer una hora, aproximadamente, ya que el arroz integral tarda algo más en cocerse.",
        "Mientras tanto, picamos las espinacas y las agregamos al arroz. Dejamos cocer cinco minutos, ponemos a punto de sal y servimos."
      ],
      "duration": "20 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/1a0gsl5ba-m.webp",
      "nutrition": null
    },
    {
      "id": "d458umg4h",
      "name": "Arroz integral con puerro",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-integral-con-puerro/",
      "ingredients": [
        "300 g arroz integral",
        "700ml de caldo de verduras",
        "1 y medio puerro grande",
        "1 pimiento verde",
        "1/2 pimiento rojo",
        "2 dientes ajo",
        "100 g champiñones",
        "Pimentón dulce",
        "Cúrcuma",
        "Aceite",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Lavamos y cortamos los puerros en rodajas, retirando los extremos (consejo: podemos guardar los extremos del puerro para cualquier caldo).",
        "Partimos el pimiento también en rodajitas junto a los champiñones bien lavados y los dientes de ajo.",
        "Ponemos una cazuela al fuego con un chorro de aceite. Una vez caliente, salteamos los puerros, el ajo, el pimiento y los champiñones durante unos 5 minutos, entonces añadimos el arroz previamente lavado. Removemos todo junto 2 minutos y agregamos una cucharadita de pimentón.",
        "A continuación añadimos el caldo. Condimentamos al gusto, salamos un poco y añadimos una cucharadita de cúrcuma para dar color.",
        "Luego tapamos la cazuela y dejamos cocer a fuego lento unos 15-20 minutos o hasta que el arroz haya absorbido casi todo el caldo y esté tierno. Apagamos el fuego, lo dejamos reposar unos minutos y servimos."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458umg4h-m.webp",
      "nutrition": null
    },
    {
      "id": "d458uugc7",
      "name": "Arroz egipcio",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-egipcio/",
      "ingredients": [
        "300g de arroz",
        "150g de lentejas cocidas",
        "650ml de caldo de verdura",
        "1 cebolla cortada juliana",
        "1 hoja de laurel",
        "1 diente ajo",
        "1 vaso de salsa tomate picante",
        "1 cucharada de curry de madras",
        "1 cucharadita pequeña de comino en polvo",
        "Azafrán tostado",
        "Aceite",
        "Pimienta",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero troceamos el ajo. Luego en una cazuela freí­mos con un chorrito de aceite la cebolla. Cuando esté dorada añadimos el ajo y lo rehogamos un poco. Incorporamos el azafrán y las lentejas y el arroz. Rehogamos de nuevo unos minutos. A continuación añadimos el caldo de verduras ya caliente.",
        "Cocemos 20 minutos o hasta que el arroz esté en su punto. Luego dejamos reposar un poco el arroz.",
        "Servimos con salsa de tomate picante."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458uugc7-m.webp",
      "nutrition": null
    },
    {
      "id": "d458v6ug9",
      "name": "Arroz con rape",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-rape/",
      "ingredients": [
        "300g de arroz",
        "200 g de calamares",
        "1 rape mediano limpio",
        "12 almejas",
        "12 gambas peladas",
        "100 g de guisantes cocidos",
        "1 cebolla pequeña",
        "1 pimiento verde",
        "2 dientes de ajo",
        "600ml de caldo de pescado",
        "1 vaso de vino blanco",
        "Perejil picado",
        "Pimienta blanca",
        "Aceite de oliva",
        "Sal",
        "Azafrán",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Lavamos y limpiamos el rape y los distintos tipos de mariscos. En una cazuela con un chorro de aceite, rehogamos la cebolla, el ajo y el pimiento picados muy finos. Cuando comiencen a dorarse añadimos el rape troceado.",
        "Dejamos que se sofrí­an un poquito. Agregamos el arroz y el vaso de vino blanco y lo rehogamos. Echamos el azafrán, el caldo de pescado bien caliente y los guisantes.",
        "Pasados 10 minutos de cocción, incorporamos las almejas y las gambas dejándolo cocer otros 10 minutos más o ponerla 10 minutos en el horno a 180°.",
        "El aspecto final es un arroz con rape bastante caldoso, casi como una sopa espesa de fondo.",
        "Revisión de la paella por el cocinero C. Rueda"
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458v6ug9-m.webp",
      "nutrition": null
    },
    {
      "id": "d458t5aij",
      "name": "Risotto de marisco con pesto",
      "url": "http://www.recetasdiarias.com/recetas/arroz/risotto-de-marisco-con-pesto/",
      "ingredients": [
        "500 g arroz carnaroli o arbóreo",
        "200 g  mejillones pelados",
        "200 g camarones",
        "2 cebollas picadas",
        "Caldo de verduras",
        "75 cc vino blanco",
        "Perejil picado",
        "50 g manteca",
        "Aceite de oliva",
        "1 diente de ajo picado",
        "2 cápsulas de azafrán Sal y Pimienta",
        "Para el pesto",
        "24 hojas de albahaca fresca",
        "3 diente de ajo",
        "Queso parmesano rallado",
        "1 cucharadita de nueces",
        "Sal  Pimienta",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Para el pesto",
        "Para el risotto de marisco",
        "Seguidamente en una cacerola con un poco de aceite de oliva, colocamos el diente de ajo y la cebolla, salpimentamos y rehogamos unos minutos, agregamos el arroz, mezclamos bien.",
        "Cocinamos por dos minutos, hasta que el grano se transparente, agregamos el vino, dejamos que evapore, luego vamos agregando el caldo bien caliente, las dos cápsulas de azafrán, añadimos los mejillones y los camarones, es importante revolver y agregar nueva cantidad de caldo a medida que el arroz lo va pidiendo, verificamos el punto del arroz, que más o menos suele ser entre 15 y 18 minutos.",
        "Finalmente una vez cocido colocamos la manteca bien fría cortada en trozos, el perejil picado, el pesto, revolvemos un poco, tapamos y dejamos descansar 2 minutos. Servimos el risotto."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458t5aij-m.webp",
      "nutrition": null
    },
    {
      "id": "d458vbvud",
      "name": "Arroz con mejillones",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-mejillones/",
      "ingredients": [
        "300 g arroz",
        "1 kg mejillones con cáscara",
        "650ml. de caldo de pescado",
        "1 cebolla",
        "1/2 vaso vino blanco",
        "2 dientes ajo",
        "2 cucharadas perejil",
        "Aceite",
        "Pimienta",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero ponemos una olla con agua y sal al fuego. Mientras, raspamos bien las conchas de los mejillones para quitar los restos de barbas y demás. Cuando el agua esté caliente, introducimos los mejillones para que se abran. Luego retiramos la olla del fuego y quitamos la concha a los mejillones, reservando unos cuantos para la presentación final.",
        "A continuación colamos el agua de la cocción y espolvoreamos el perejil. Luego, pelamos y picamos finamente la cebolla. La sofreímos en una sartén con cinco cucharadas de aceite, hasta que la cebolla quede dorada. Agregamos entonces el ajo picado muy fino y le damos unas vueltas, añadimos el arroz y el vino y cuando el vino haya reducido añadimos el caldo y dejamos cocer uno 15-20 minutos.",
        "Finalmente, cuando el arroz esté listo, agregamos los mejillones, revolvemos un minuto y servimos."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458vbvud-m.webp",
      "nutrition": null
    },
    {
      "id": "d458v51ft",
      "name": "Arroz con sepia",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-sepia/",
      "ingredients": [
        "350g arroz",
        "700ml. de caldo de pescado",
        "1 sepia grande",
        "150g de almeja",
        "1 cebolla grande",
        "1/2 pimiento rojo",
        "1 pimiento verde",
        "½ vaso de vino blanco",
        "1 vaso de tomate triturado",
        "1 cucharada de picada de ajo y perejil",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero pelamos y cortamos en cuadraditos la cebolla, el pimiento verde y el rojo. Luego lo sofreímos en una sartén grande en abundante aceite hasta que quede bien pochado. agregamos la cucharada de picada de ajo y perejil, removemos y le añadimos el vaso de tomate triturado.",
        "Mientras lavamos la sepia y la cortamos en trozos pequeños.",
        "Consejo: al limpiar la sepia podemos guardar la melsa y añadírsela al sofrito aportara mucho sabor.",
        "Añadimos entonces la sepia las almejas y sofreímos unos minutos más junto al vino. Luego agregamos el arroz y lo rehogamos durante 5 minutos, sin dejar de remover.",
        "A continuación echamos el caldo de pescado y rectificamos con una pizca de sal.",
        "Mantenemos el arroz a fuego fuerte 5 minutos y luego lo dejamos a fuego suave otros 15 minutos. Por último, dejamos reposar el arroz entre 5 y 10 minutos tapado con un paño de cocina.",
        "Receta real de cocinero, por Cristian Rueda."
      ],
      "duration": "35 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458v51ft-m.webp",
      "nutrition": null
    },
    {
      "id": "d458vddjb",
      "name": "Arroz con mango",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-mango/",
      "ingredients": [
        "150 g de arroz",
        "1/2 taza pulpa de mango",
        "1 mango trozeado",
        "300 ml de caldo de pollo",
        "2 cucharadas cilantro picado",
        "1 cucharada mantequilla",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "En una cazuela ponemos a derretir la mantequilla, en la que sofreí­mos el arroz durante un par de minutos. Añadimos el cilantro, la pulpa de mango, y un poco de sal. Removemos un minuto.",
        "A continuación incoporamos el caldo de pollo, tapamos la cazuela, ponemos a fuego fuerte y llevamos a ebullición. Una vez hierva bajamos el fuego a fuego lento y cocemos alrededor de 15 minutos.",
        "Cuando el arroz esté casi seco agregamos los trocitos de mango y los mezclamos con el arroz. Dejamos tapada la cazuela 5 minutos más y servimos caliente."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458vddjb-m.webp",
      "nutrition": null
    },
    {
      "id": "d458ue58p",
      "name": "Arroz pilaf",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-pilaf/",
      "ingredients": [
        "400 g de arroz",
        "850 ml de caldo (al gusto: pescado verduras pollo)",
        "50 g de mantequilla",
        "Sal",
        "Mantequilla (opcional)",
        "Hierbas aromáticas (opcional)",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero calentamos el caldo. Mientras hierve el caldo lavamos el arroz y lo escurrimos bien. En otra cacerola derretimos la mantequilla a fuego lento y añadimos el arroz, removiendo sin para durante 2 minutos.",
        "Agregamos entonces un poco de sal y el caldo hirviendo. Lo ponemos a fuego medio y lo hervimos 3 minutos. Entonces lo tapamos y bajamos el fuego, cociendo el arroz unos 20 minutos, hasta que veamos que haya absorbido todo el caldo.",
        "Por último, retiramos el fuego y lo dejamos reposar durante 15 minutos, tapado.",
        "Este tipo de arroz es ideal para cualquier tipo de guarnición, puedes darle un toque maravilloso aun plato de carne, cortando un dadito de mantequilla y salteando el arroz pilaf un par de minutos y agregando un toque de hierbas aromáticas al gusto.",
        "Receta mejorada por el cocinero C. Rueda."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458ue58p-m.webp",
      "nutrition": null
    },
    {
      "id": "d458t2l5t",
      "name": "Arroz frito al curry",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-frito-al-curry/",
      "ingredients": [
        "300g. de arroz",
        "1 cebolla pequeña",
        "¼ de col",
        "½ Calabacín",
        "100g Champiñones frescos",
        "1 Pimiento verde",
        "1 cucharadita de jengibre rallado",
        "Sal al gusto",
        "1 chorrito de salsa de soja",
        "2 cucharadas de aceite",
        "1/2-1 cucharadita de Nitu Didi POLVO FINO LONDRES CURRY",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Cocemos el arroz hasta que esté al punto, unos 15-20 minutos en abundante agua, con un poquito de sal y un chorrito de aceite.",
        "Picamos 1/4 taza de de cebolla, calabacín, col, pimiento verde y champiñones. Rallamos el jengibre",
        "Seguidamente calentar el aceite en un wok y saltear el jengibre, la cebolla, el calabacín, el pimiento la col y los champiñones hasta que se ablanden.",
        "Añadir el pimiento y saltear durante 30 segundos más.",
        "Sazone con sal y salsa de soja y añadir el curry de Nitu Didi en polvo. Mezclar bien.",
        "Por último añadir el arroz préviamente hervido y cocinar hasta que quede todo bien mezclado y el arroz esté caliente.",
        "&nbsp",
        "Truco: Puedes hacer el arroz frito con muchos ingredientes diferentes y cada vez que sabe diferente. Prueba de experimentar y añadir lo que tengas en la nevera.",
        "Receta cedida por Nitu Didi."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458t2l5t-m.webp",
      "nutrition": null
    },
    {
      "id": "d458t8qm3",
      "name": "Risotto Philadelphia",
      "url": "http://www.recetasdiarias.com/recetas/arroz/risotto-philadelphia/",
      "ingredients": [
        "8 ajetes",
        "40 g mantequilla",
        "360 g arroz",
        "750ml  caldo de pollo",
        "200 g Philadelphia",
        "80 g pimientos del piquillo",
        "100 g bacon",
        "Aceite de oliva",
        "Un chorrito de vino blanco",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Rehogamos los ajetes picados con mantequilla y aceite de oliva. Añadimos el arroz y removemos con energía.",
        "Echamos un chorrito de vino blanco y dejamos reducir a la mitad para después añadir el caldo de pollo bien caliente poco a poco.",
        "Cuando esté cocido el arroz, mezclamos con el queso philadelphia, y añadimos el bacon dorado y los pimientos del piquillo, todo muy picado.",
        "Removemos todo junto y servimos el risotto.",
        "Receta revisada por nuestro cocinero C. Rueda."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458t8qm3-m.webp",
      "nutrition": null
    },
    {
      "id": "d458t750k",
      "name": "Arroz con verduras",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-verduras/",
      "ingredients": [
        "300 gramos de arroz",
        "100 gramos de coliflor",
        "100 gramos de setas o champiñones",
        "100 de judias verdes",
        "100 de guisantes",
        "1 pimiento verde pequeño",
        "1 pimiento rojo pequeño",
        "1 cebolla mediana",
        "1 diente de ajo",
        "3 cucharadillas de pimenton",
        "1 tomate pequeño",
        "1 zanahoria",
        "1 litro de agua",
        "6 cucharadas de aceite de oliva",
        "Sal",
        "Una cazuela plana tipo paellera",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Receta y foto elaborada por mi tía Victoria durante los 3 conciertos de Prince en Rotterdam Julio 2011. Gracias tita!!!!!",
        " Gracias tita!!!!!."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458t750k-m.webp",
      "nutrition": null
    },
    {
      "id": "d458tan01",
      "name": "Arroz frito con espárragos",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-frito-con-esparragos/",
      "ingredients": [
        "160g de arroz blanco hervido",
        "1 manojo de espárragos verdes frescos",
        "Un chorro de salsa de soja ligera",
        "1 puerro",
        "150ml de nata para cocinar",
        "1/2 vaso de vino blanco",
        "3 cucharadas de aceite",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Lavamos y limpiamos bien los espárragos, ponemos a hervir el arroz y mientras vamos cortando los espárragos y el puerro en daditos.",
        "Cogemos una sartén antiadherente y ponemos 3 cucharadas de aceite, añadimos el puerro y los los espárragos, una pizca de sal y dejamos cocinar hasta que estén a medio hacer, doraditos.",
        "Añadimos el medio vaso de vino blanco, dejamos reducir. Añadimos la nata para cocinar, salpimentamos, dejamos reducir un poquito hasta que espese la salsa y añadimos el arroz cocido a la sartén y finalizamos con  un chorro generoso de soja ligera y mezclamos muy bien.",
        "Si quieres darle un sabor picante agrega la salsa con chile que más y guste.",
        "Receta cedida y redactada en base a los textos en inglés de Nitu Chugani y mejorada por el cocinero C. Rueda."
      ],
      "duration": "25 minutes ",
      "serves": "2",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458tan01-m.webp",
      "nutrition": null
    },
    {
      "id": "d458v8dfv",
      "name": "Arroz con queso",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-queso/",
      "ingredients": [
        "400g de arroz",
        "1 cebolla grande",
        "750ml de caldo de verdura",
        "8 cucharadas de queso manchego rallado",
        "1 bote de nata para cocinar",
        "200g carne picada",
        "1 cucharada de mantequilla",
        "Pimienta",
        "Sal",
        "Aceite de oliva",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "En una sartén con un poco de aceite de oliva y la mantequilla, bien caliente echamos la cebolla picada muy fina y a los dos minutos añadimos la carne picada, salpimentamos y dejamos freír unos 8-10 minutos. Agregamos el arroz en crudo y rehogamos un par de minutos.",
        "Seguidamente añadimos el caldo de verdura, dejamos cociendo unos 15-20 minutos. Debe quedar un arroz cremoso.",
        "Pasado este tiempo añadimos la nata, el queso y vemos que enseguida empieza a espesar, rectificamos de sal, dejamos en el fuego un par de minutos mientras removemos y listo para servir.",
        "Trucos y consejos para la receta por el cocinero C. Rueda."
      ],
      "duration": "60 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458v8dfv-m.webp",
      "nutrition": null
    },
    {
      "id": "d458tbmst",
      "name": "Caldereta de arroz con cordero",
      "url": "http://www.recetasdiarias.com/recetas/arroz/caldereta-de-arroz-con-cordero/",
      "ingredients": [
        "250 g de cordero asado con su salsa",
        "2 zanahorias",
        "1 cebolla grande",
        "1 vaso de vino tinto joven o crianza",
        "Tomillo",
        "300 g de arroz",
        "1 l de caldo de carne",
        "1 lata de guisantes",
        "1 lata de pimiento morrón",
        "Aceite de oliva virgen extra",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero, rallamos la zanahoria, troceamos la carne de cordero y en una cazuela mediana sofreí­mos en aceite, posteriormente añadimos el vino y reducimos.",
        "Seguidamente agregamos el jugo de asar la carne, el caldo de verduras y lo dejamos hasta que el cordero esté casi tierno.",
        "A continuación añadimos el arroz y el tomillo, rectificamos de sal y dejamos a fuego medio durante 18 minutos.",
        "Apartamos del fuego y probamos. Recuerda que debe quedar realmente caldoso y con el arroz al punto.",
        "Cinco minutos antes de acabar añadimos los guisantes y el pimiento morón.",
        "Puedes corregir a la caldereta con un poquito de caldo caliente de verduras si el arroz quedó algo seco y si te gusta la el picante prueba de sazonarla con algo de cayena o tabasco."
      ],
      "duration": "25 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458tbmst-m.webp",
      "nutrition": null
    },
    {
      "id": "d458va79s",
      "name": "Arroz con pasas",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-pasas/",
      "ingredients": [
        "300 g de arroz",
        "1 cebolla grande",
        "1 cucharada de mantequilla",
        "150 g de pasas",
        "50 g de piñones",
        "100g de bacon",
        "Aceite oliva  sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero hervimos el arroz en una olla con agua hirviendo, un chorrín de aceite y una pizca de sal, durante unos 12-14 minutos que no se pase, lo escurrimos y enfriamos.",
        "Por otro lado picamos la cebolla muy fina y la echamos a una sartén con un chorrín de aceite y la mantequilla, dejamos que vaya dorando, mientras cortamos el bacon a tiras pequeñas, cuando este doradita la cebolla echamos el bacon, los piñones, y las pasas i lo salteamos todo junto entre 5-8 minutos.",
        "Un consejo, usar tapadera para la sartén, por el bacon i piñones, una vez pasado el tiempo añadimos el arroz, salteamos y rectificamos de sal."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458va79s-m.webp",
      "nutrition": null
    },
    {
      "id": "d458sg8p3",
      "name": "Maki sushi de aguacate y surimi",
      "url": "http://www.recetasdiarias.com/recetas/arroz/maki-sushi-de-aguacate-y-surimi/",
      "ingredients": [
        "600g de arroz para sushi ya listo y a temperatura ambiente",
        "4-5 láminas de alga nori",
        "10-12 barritas de surimi (fresco o previamente descongelado)",
        "2 aguacates maduros pero firmes",
        "1 esterilla para sushi para enrollar",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Este es otro tipo muy común de hacer sushi.",
        "Normalmente caben aproximadamente 2,5 barritas de surimi por longitud de lámina de nori.",
        "Ponemos una lámina de alga con el lado brillante hacia abajo, sobre la esterilla.",
        "Dejando un margen de 1 cm de alga al principio de la lámina, repartimos unas cucharadas de arroz haciendo una línea a lo largo de toda la lámina.",
        "Hundimos encima del arroz el aguacate y el surimi, las cantidades del relleno van a nuestro gusto, simplemente que cuánto más relleno, mayor diámetro tendrá la pieza de sushi.",
        "Ayudándonos de la esterilla, hacemos un rollito empezando por el lado del arroz y acabando por el lado que sólo había alga.",
        "Debe quedar un rollito apretado, que no se salga nada.",
        "Ese margen de 1 cm que hemos dejado al principio nos ayudará a que el rollito quede sellado.",
        "Una vez tengamos el rollito hecho y prensado, lo cortamos con un buen cuchillo con la hoja mojada, sino el rollito se desmontará al cortarlo.",
        "Servimos a temperatura ambiente, y acompañados de salsa de soja.",
        "¡Ah, y atreveos con los palillos!",
        "Otro tipo de maki sushi diferente gracias a Gloria Vélez.",
        "いただきます – “ita daki mesh” – (buen provecho)"
      ],
      "duration": "15 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458sg8p3-m.webp",
      "nutrition": null
    },
    {
      "id": "d458saq2b",
      "name": "Paella de pollo y judías",
      "url": "http://www.recetasdiarias.com/recetas/arroz/paella-de-pollo-y-judias/",
      "ingredients": [
        "400 g de arroz",
        "2 pechugas de pollo",
        "900ml de caldo de pollo",
        "40 judías verdes",
        "1 cebolla",
        "1 pimiento rojo",
        "2 tomates maduros",
        "½ limón",
        "1 diente de ajo",
        "1 hebra de azafrán",
        "1 hoja de laurel",
        "Pimienta negra molida",
        "1 ramita de perejil",
        "1/2 ramita de romero",
        "1/2 ramita de tomillo",
        "Aceite de oliva",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero lavamos las judías y les retiramos los hilos exteriores y los rabillos. Las cortamos en 4 trozos. Reservamos en un plato.",
        "Picamos el pimiento. Reservamos. Picamos la cebolla. Reservamos.",
        "Rallamos un tomate y reservamos en un bol.",
        "Hacemos una picada con 1 diente de ajo y el perejil.",
        "Cortamos las pechugas de pollo en dados. Reservamos.",
        "En una paella de unos 28-30 cm, con un buen chorro de aceite, freímos el pollo.",
        "Retiramos el pollo y reservamos en un plato.",
        "A continuación en la misma sartén añadimos la cebolla bien picada, las judías cortadas, el pimiento picado, salpimentamos y añadimos la hoja de laurel.",
        "Agregamos una ramita de romero, una ramita de tomillo y dejamos sofreír 10-15 minutos hasta que todo esté bien pochado.",
        "Seguidamente añadimos la picada de ajo y perejil.",
        "Añadimos medio vaso de limón, el tomate rallado y por último una hebra de azafrán previamente tostada en el horno.",
        "Dejamos pochar todo 10 minutos a fuego lento.",
        "Añadimos entonces el pollo troceado y el arroz. Damos unas vueltas durante 2 de minutos y finalmente agregamos todo el caldo de pollo.",
        "Dejamos 20 minutos exactos en el fuego a nivel bajo-medio hasta que reduzca.",
        "Para finalizar, retiramos y dejamos reposar entre cinco y diez minutos con un trapo de cocina por encima de la paella."
      ],
      "duration": "90 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458saq2b-m.webp",
      "nutrition": null
    },
    {
      "id": "d458tk1kv",
      "name": "Wild Rice and Almond Salad",
      "url": "http://www.recetasdiarias.com/recetas/arroz/ensalada-de-arroz/",
      "ingredients": [
        "150g long grain rice",
        "150g wild rice",
        "750ml water",
        "200g slivered almonds",
        "1 stalk celery, diced",
        "1 can (approximately 150g) corn, drained",
        "Juice of 1 lemon",
        "2 tablespoons olive oil",
        "2 tablespoons chopped fresh parsley",
        "Salt, to taste",
        "Black pepper, to taste"
      ],
      "directions": [
        "Step 1: Combine the wild rice and water in a saucepan and bring to a boil. Reduce heat and simmer for 15-20 minutes.",
        "Step 2: Add the long grain rice to the saucepan and continue to simmer for another 15-20 minutes, or until both types of rice are cooked through and tender.",
        "Step 3: Drain the rice and rinse with cold water. Spread the rice on a baking sheet or large plate to cool completely. Once cooled, refrigerate for at least 1 hour.",
        "Step 4: While the rice is chilling, dice the celery and chop the parsley.",
        "Step 5: In a large bowl, combine the cooled rice, diced celery, slivered almonds, drained corn, and chopped parsley.",
        "Step 6: In a small bowl, whisk together the olive oil, lemon juice, salt, and pepper.",
        "Step 7: Pour the dressing over the rice mixture and toss gently to combine.",
        "Step 8: Serve immediately or chill for later."
      ],
      "duration": "70 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458tk1kv-m.webp",
      "nutrition": {
        "calories": "Approximately 300 per serving",
        "protein": "7g per serving",
        "carbs": "50g per serving",
        "fat": "12g per serving",
        "fiber": "5g per serving",
        "sugar": "2g per serving",
        "sodium": "50mg per serving"
      },
      "ai_enhanced": true,
      "image_prompt": "Professional food photography of Wild Rice and Almond Salad on a white plate with garnish, high-resolution, studio lighting, shallow depth of field, soft natural lighting, rich colors and textures",
      "image_filepath": "recipe_d458tk1kv/main_image",
      "video_script": {
        "title": "Recipe Tutorial: Wild Rice and Almond Salad",
        "description": "A tutorial for making Wild Rice and Almond Salad",
        "scenes": [
          {
            "scene_number": 1,
            "duration": 5,
            "image_prompt": "Professional food photography of Wild Rice and Almond Salad",
            "text": "Error generating full script",
            "voice_over": "This recipe tutorial will show you how to make this delicious dish.",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tk1kv-s.webp"
          }
        ],
        "error": "429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 21\n}\n]"
      },
      "preparation_time_minutes": 20,
      "cooking_time_minutes": 40,
      "total_time_minutes": 60,
      "difficulty_level": "Easy",
      "meal_type": [
        "Lunch",
        "Dinner",
        "Salad"
      ],
      "cuisine_type": "Spanish",
      "dietary_tags": [
        "Vegetarian",
        "Gluten-Free"
      ],
      "ingredient_tags": [
        "Rice",
        "Almonds",
        "Celery",
        "Corn",
        "Lemon",
        "Parsley"
      ],
      "occasion_tags": [
        "Everyday",
        "Potluck",
        "Picnic"
      ],
      "cooking_tips": [
        "For a richer flavor, toast the almonds before adding them to the salad.",
        "If you don't have fresh parsley, you can use dried parsley, but use about half the amount.",
        "Add other vegetables to the salad, such as diced bell peppers or chopped cucumbers."
      ],
      "image_url": "https://raw.githubusercontent.com/hicutequeen/recipe-images/main/images/rice/recipe_d458tk1kv/d458tk1kv_main_image.jpg"
    },
    {
      "id": "d458smksd",
      "name": "Salteado de arroz con gambas al ajillo",
      "url": "http://www.recetasdiarias.com/recetas/arroz/salteado-de-arroz-con-gambas-al-ajillo/",
      "ingredients": [
        "250g de arroz de grano largo",
        "200g de gambitas peladas pequeñas (deben estar ya descongeladas)",
        "300g de maíz dulce (ó una lata de las grandes)",
        "3-4 dientes de ajo al gusto",
        "Guindillas secas al gusto",
        "Aceite de oliva virgen extra",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Empezamos picando el ajo en trozos lo más pequeños posible.",
        "Ponemos el aceite de oliva virgen (dos o tres cucharadas generosas) a calentar en una sartén pequeña. Cuando esté caliente, echamos el ajo y lo dejamos dorar, cuidado no se queme, ¡que amarga!",
        "Entonces bajamos el fuego al mínimo y añadimos las gambitas, las dejamos hasta que pierdan la transparencia. A continuación agregamos las guindillas desmenuzándolas con los dedos. Damos unas vueltas para que las gambitas cojan el picante, y ya echamos también el maíz.",
        "Lo dejamos con el fuego al mínimo mientras se cuece el arroz.",
        "Seguimos cociendo el arroz en agua salada. Lo dejamos los 15-20 minutos y comprobamos la cocción.",
        "Cuando el arroz esté al punto, lo colamos y lo añadimos a la sartén con las gambitas y el maíz, subimos el fuego y le damos vueltas para q se empape bien con el picante.",
        "Servimos el salteado de arroz muy caliente. ¡Buen provecho!",
        "Siempre vuestra desde la cocina Gloria Vélez"
      ],
      "duration": "35 minutes ",
      "serves": 1,
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458smksd-m.webp",
      "nutrition": null
    },
    {
      "id": "1a0gsdna5",
      "name": "Spanish Rice with Cuttlefish and Prawns",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-sepia-y-gambas/",
      "ingredients": [
        "400 g Arborio rice",
        "8 large prawns",
        "1 cleaned cuttlefish, diced",
        "800 ml fish stock",
        "1 Italian green bell pepper, finely diced",
        "1/4 red bell pepper, finely diced",
        "1 onion, finely diced",
        "1 tomato, grated",
        "1 clove garlic, minced",
        "1 sprig parsley, chopped",
        "1 tablespoon toasted peeled hazelnuts, ground",
        "100 ml white wine",
        "Ground black pepper, to taste",
        "Olive oil",
        "Salt, to taste"
      ],
      "directions": [
        "Step 1: In a paella pan or large skillet, heat a generous drizzle of olive oil over medium-high heat.",
        "Step 2: Add the diced cuttlefish and sear on both sides until lightly browned. Remove from the pan and set aside.",
        "Step 3: Prick the heads of the prawns to release their juices. Add the prawns to the pan and sear on both sides until pink and opaque. Remove from the pan and set aside.",
        "Step 4: Add the diced onion and bell peppers to the pan. Season with salt and pepper. Reduce heat to low and cook, stirring occasionally, for 15 minutes, or until softened.",
        "Step 5: Add the minced garlic, chopped parsley, and ground hazelnuts to the pan. Stir and cook for 1 minute.",
        "Step 6: Pour in the white wine and let it reduce slightly.",
        "Step 7: Add the grated tomato, stir well, and cook for 2 minutes.",
        "Step 8: Return the cuttlefish to the pan and stir to combine.",
        "Step 9: Add the rice to the pan and stir to coat the grains with the oil and other ingredients. Toast the rice for 1 minute, stirring constantly.",
        "Step 10: Pour in the fish stock, stir gently, and bring to a boil. Reduce heat to medium-high and simmer for 5 minutes.",
        "Step 11: Arrange the seared prawns around the rice. Transfer the paella pan to a preheated oven at 180°C (350°F) and bake for 15 minutes, or until the rice is cooked through and the liquid has been absorbed."
      ],
      "duration": "60 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/1a0gsdna5-m.webp",
      "nutrition": {
        "calories": "500 per serving",
        "protein": "30 grams per serving",
        "carbs": "60 grams per serving",
        "fat": "15 grams per serving",
        "fiber": "5 grams per serving",
        "sugar": "5 grams per serving",
        "sodium": "600 mg per serving"
      },
      "ai_enhanced": true,
      "image_prompt": "Professional food photography of Spanish Rice with Cuttlefish and Prawns on a white plate with garnish, high-resolution, studio lighting, shallow depth of field, soft natural lighting, rich colors and textures",
      "image_filepath": "recipe_1a0gsdna5/main_image",
      "video_script": {
        "title": "Recipe Tutorial: Spanish Rice with Cuttlefish and Prawns",
        "description": "A tutorial for making Spanish Rice with Cuttlefish and Prawns",
        "scenes": [
          {
            "scene_number": 1,
            "duration": 5,
            "image_prompt": "Professional food photography of Spanish Rice with Cuttlefish and Prawns",
            "text": "Error generating full script",
            "voice_over": "This recipe tutorial will show you how to make this delicious dish.",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/1a0gsdna5-s.webp"
          }
        ],
        "error": "429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 18\n}\n]"
      },
      "preparation_time_minutes": 25,
      "cooking_time_minutes": 40,
      "total_time_minutes": 65,
      "difficulty_level": "Medium",
      "meal_type": [
        "Lunch",
        "Dinner"
      ],
      "cuisine_type": "Spanish",
      "dietary_tags": [],
      "ingredient_tags": [
        "Rice",
        "Seafood",
        "Cuttlefish",
        "Prawns",
        "Bell Peppers",
        "Onion",
        "Tomato",
        "Garlic",
        "Hazelnut"
      ],
      "occasion_tags": [
        "Everyday",
        "Special Occasion"
      ],
      "cooking_tips": [
        "Use good quality fish stock for the best flavor.",
        "Adjust the cooking time depending on the type of rice used.",
        "If you don't have a paella pan, you can use a large oven-safe skillet or baking dish."
      ],
      "image_url": "https://raw.githubusercontent.com/hicutequeen/recipe-images/main/images/rice/recipe_1a0gsdna5/1a0gsdna5_main_image.jpg"
    },
    {
      "id": "d458sl9n9",
      "name": "Creamy Asparagus Risotto",
      "url": "http://www.recetasdiarias.com/recetas/arroz/risotto-trigueros/",
      "ingredients": [
        "300g Arborio rice",
        "200g fresh asparagus, trimmed",
        "650ml vegetable broth",
        "30g butter",
        "1 medium onion, finely chopped",
        "1/4 cup dry white wine",
        "Salt, to taste",
        "Black pepper, to taste",
        "Grated Parmesan cheese, for garnish"
      ],
      "directions": [
        "Step 1: Warm the vegetable broth in a saucepan over medium heat. Keep warm."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458sl9n9-m.webp",
      "nutrition": {
        "calories": "350 per serving",
        "protein": "12 grams per serving",
        "carbs": "60 grams per serving",
        "fat": "10 grams per serving",
        "fiber": "5 grams per serving",
        "sugar": "2 grams per serving",
        "sodium": "400mg per serving"
      },
      "ai_enhanced": true,
      "image_prompt": "Professional food photography of Creamy Asparagus Risotto on a white plate with garnish, high-resolution, studio lighting, shallow depth of field, soft natural lighting, rich colors and textures",
      "image_filepath": "recipe_d458sl9n9/main_image",
      "video_script": {
        "title": "Creamy Asparagus Risotto",
        "description": "Learn to make a restaurant-quality Creamy Asparagus Risotto at home with this easy-to-follow recipe.",
        "scenes": [
          {
            "scene_number": 1,
            "duration": 5,
            "image_prompt": "Close-up shot of a creamy asparagus risotto, garnished with parmesan cheese and fresh asparagus tips. Steam gently rises from the dish. The risotto has a vibrant green color from the asparagus.",
            "text": "Creamy Asparagus Risotto",
            "voice_over": "Welcome! Today, we're making a delicious and creamy Asparagus Risotto. This dish is surprisingly simple to make and perfect for a weeknight dinner or a special occasion.",
            "scene_image_filename": "recipe_d458sl9n9/scene_1_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sl9n9-s.webp"
          },
          {
            "scene_number": 2,
            "duration": 5,
            "image_prompt": "Overhead shot of all ingredients neatly arranged on a wooden table: Arborio rice in a bowl, fresh asparagus, vegetable broth, butter, chopped onion, white wine, salt, pepper, and grated Parmesan cheese.",
            "text": "Ingredients",
            "voice_over": "Here's what you'll need: Arborio rice, fresh asparagus, vegetable broth, butter, onion, white wine, salt, pepper, and Parmesan cheese.",
            "scene_image_filename": "recipe_d458sl9n9/scene_2_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sl9n9-s.webp"
          },
          {
            "scene_number": 3,
            "duration": 5,
            "image_prompt": "Saucepan on the stove with vegetable broth simmering gently.",
            "text": "Warm the Broth",
            "voice_over": "First, warm 650ml of vegetable broth in a saucepan over medium heat. Keep it warm throughout the cooking process.",
            "scene_image_filename": "recipe_d458sl9n9/scene_3_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sl9n9-s.webp"
          },
          {
            "scene_number": 4,
            "duration": 6,
            "image_prompt": "A pan with melted butter and sautéed onions. The onions should be translucent and softened.",
            "text": "Sauté Onion",
            "voice_over": "In a large pan, melt 30g of butter over medium heat. Add one finely chopped onion and sauté for about 5 minutes until softened and translucent.",
            "scene_image_filename": "recipe_d458sl9n9/scene_4_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sl9n9-s.webp"
          },
          {
            "scene_number": 5,
            "duration": 5,
            "image_prompt": "Arborio rice being added to the pan with the sautéed onions. The rice is being stirred into the butter and onion mixture.",
            "text": "Toast the Rice",
            "voice_over": "Add 300g of Arborio rice to the pan and toast for 2-3 minutes, stirring constantly, until the edges of the rice become translucent.",
            "scene_image_filename": "recipe_d458sl9n9/scene_5_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sl9n9-s.webp"
          },
          {
            "scene_number": 6,
            "duration": 5,
            "image_prompt": "White wine being poured into the pan with the rice and onions. The mixture is bubbling slightly.",
            "text": "Deglaze with Wine",
            "voice_over": "Pour in 1/4 cup of dry white wine and let it evaporate completely, stirring continuously.",
            "scene_image_filename": "recipe_d458sl9n9/scene_6_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sl9n9-s.webp"
          },
          {
            "scene_number": 7,
            "duration": 7,
            "image_prompt": "Ladle of warm vegetable broth being added to the risotto. The rice is partially submerged in the liquid.",
            "text": "Add Broth Gradually",
            "voice_over": "Now, start adding the warm vegetable broth one ladle at a time.  Stir continuously and wait for each ladle to be absorbed before adding the next. This process takes about 20-25 minutes.",
            "scene_image_filename": "recipe_d458sl9n9/scene_7_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sl9n9-s.webp"
          },
          {
            "scene_number": 8,
            "duration": 6,
            "image_prompt": "Chopped asparagus tips being added to the risotto. The risotto is creamy and the asparagus is bright green.",
            "text": "Add Asparagus",
            "voice_over": "Add 200g of trimmed and chopped asparagus to the risotto during the last 5 minutes of cooking time.",
            "scene_image_filename": "recipe_d458sl9n9/scene_8_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sl9n9-s.webp"
          },
          {
            "scene_number": 9,
            "duration": 5,
            "image_prompt": "Close-up shot of the finished risotto being stirred. It has a creamy consistency and the asparagus is tender.",
            "text": "Stir and Season",
            "voice_over": "Once the rice is cooked al dente and the risotto is creamy, season with salt and pepper to taste.",
            "scene_image_filename": "recipe_d458sl9n9/scene_9_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sl9n9-s.webp"
          },
          {
            "scene_number": 10,
            "duration": 5,
            "image_prompt": "Finished risotto served in a shallow bowl, garnished with grated Parmesan cheese and a few fresh asparagus tips. A fork is placed next to the bowl.",
            "text": "Serve and Enjoy!",
            "voice_over": "Serve immediately, garnished with grated Parmesan cheese and a few fresh asparagus tips. Enjoy!",
            "scene_image_filename": "recipe_d458sl9n9/scene_10_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sl9n9-s.webp"
          },
          {
            "scene_number": 11,
            "duration": 4,
            "image_prompt": "Text overlay on the finished dish with nutritional information: Calories: 350, Protein: 12g, Carbs: 60g, Fat: 10g.",
            "text": "Nutrition Information",
            "voice_over": "Per serving, this risotto has approximately 350 calories, 12 grams of protein, 60 grams of carbs, and 10 grams of fat.",
            "scene_image_filename": "recipe_d458sl9n9/scene_11_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sl9n9-s.webp"
          }
        ]
      },
      "preparation_time_minutes": 15,
      "cooking_time_minutes": 25,
      "total_time_minutes": 40,
      "difficulty_level": "Medium",
      "meal_type": [
        "Lunch",
        "Dinner"
      ],
      "cuisine_type": "Italian",
      "dietary_tags": [
        "Vegetarian"
      ],
      "ingredient_tags": [
        "Asparagus",
        "Rice",
        "Onion",
        "Butter",
        "Parmesan"
      ],
      "occasion_tags": [
        "Everyday",
        "Romantic Dinner"
      ],
      "cooking_tips": [
        "Use warm broth to help the risotto cook evenly.",
        "Taste and adjust seasoning as needed.",
        "Don't rinse the rice before cooking, as the starch is essential for the creamy texture."
      ],
      "image_url": "https://raw.githubusercontent.com/hicutequeen/recipe-images/main/images/rice/recipe_d458sl9n9/d458sl9n9_main_image.jpg"
    },
    {
      "id": "d458ts0hk",
      "name": "Paella de pollo",
      "url": "http://www.recetasdiarias.com/recetas/arroz/paella-de-pollo/",
      "ingredients": [
        "400 g de arroz",
        "900ml de caldo de pollo",
        "½ pollo troceado",
        "1 cebolla",
        "4 alcachofas",
        "2 pimientos rojos medianos",
        "2 tomates maduros",
        "½ limón",
        "1 diente de ajo",
        "1 hebra de azafrán",
        "Pimienta molida",
        "Perejil",
        "Romero",
        "Tomillo",
        "Aceite",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero freímos el pollo en aceite en una paella, retiramos el pollo, a continuación añadimos la cebolla bien picada, las alcachofas cortadas a cuartos pequeños, el pimiento picado, salpimentamos, una ramita de romero, una ramita de tomillo y dejamos sofreir 10-15 minutos hasta que todo esté pochado.",
        "Seguidamente añadimos 1 diente de ajo bien picado y el perejil, añadimos medio vaso de limón, y el tomate rallado, por último una hebra de azafrán préviamente tostada en el horno. Dejamos sofreir todo 10 minutos a fuego lento.",
        "Añadimos el pollo troceado, el arroz, damos unas vueltas durante un par de minutos y finalmente agregamos el caldo de pollo.",
        "Dejamos 20 minutos en el fuego a nivel medio hasta que reduzca.",
        "Para finalizar, retiramos y dejamos reposar entre cinco y diez minutos.",
        "Nota: Si no estamos en temporada de alcachofa puedes sustituirlas por judías verdes como hemos hecho nosotros.",
        "Receta elaborada por Cristian R."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458ts0hk-m.webp",
      "nutrition": null
    },
    {
      "id": "d458tu4t2",
      "name": "Rice Fritters (Buñuelos de Arroz)",
      "url": "http://www.recetasdiarias.com/recetas/arroz/bunuelos-de-arroz/",
      "ingredients": [
        "250 g cooked rice",
        "50 g all-purpose flour",
        "1 large egg",
        "Milk (as needed, approximately 1/2 cup)",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground black pepper",
        "Salt to taste",
        "Vegetable oil for frying"
      ],
      "directions": [
        "Step 1: Cook the Rice: In a saucepan, bring 500ml of salted water to a boil. Add the rice, reduce heat to medium, and simmer for 20 minutes, or until tender. Drain the cooked rice and set aside to cool.",
        "Step 2: Make the Batter: In a mixing bowl, whisk the egg vigorously. Add the flour and gradually whisk in the milk until a thick batter forms.",
        "Step 3: Combine Ingredients: Gently fold the cooled rice into the batter. Season with salt, pepper, and nutmeg. Mix well.",
        "Step 4: Fry the Fritters: Heat a generous amount of vegetable oil in a large skillet over medium-high heat. Drop spoonfuls of the rice batter into the hot oil, forming small fritters. Fry for 2-3 minutes per side, or until golden brown and cooked through.",
        "Step 5: Serve: Remove the fritters from the skillet and place them on a plate lined with paper towels to absorb excess oil. Serve warm."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458tu4t2-m.webp",
      "nutrition": {
        "calories": "150 per serving (estimated)",
        "protein": "5g per serving (estimated)",
        "carbs": "25g per serving (estimated)",
        "fat": "5g per serving (estimated)",
        "fiber": "1g per serving (estimated)",
        "sugar": "2g per serving (estimated)",
        "sodium": "100mg per serving (estimated)"
      },
      "ai_enhanced": true,
      "image_prompt": "Professional food photography of Rice Fritters (Buñuelos de Arroz) on a white plate with garnish, high-resolution, studio lighting, shallow depth of field, soft natural lighting, rich colors and textures",
      "image_filepath": "recipe_d458tu4t2/main_image",
      "video_script": {
        "title": "Recipe Tutorial: Rice Fritters (Buñuelos de Arroz)",
        "description": "A tutorial for making Rice Fritters (Buñuelos de Arroz)",
        "scenes": [
          {
            "scene_number": 1,
            "duration": 5,
            "image_prompt": "Professional food photography of Rice Fritters (Buñuelos de Arroz)",
            "text": "Error generating full script",
            "voice_over": "This recipe tutorial will show you how to make this delicious dish.",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tu4t2-s.webp"
          }
        ],
        "error": "429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 22\n}\n]"
      },
      "preparation_time_minutes": 15,
      "cooking_time_minutes": 25,
      "total_time_minutes": 40,
      "difficulty_level": "Easy",
      "meal_type": [
        "Snack",
        "Appetizer"
      ],
      "cuisine_type": "Spanish",
      "dietary_tags": [],
      "ingredient_tags": [
        "Rice",
        "Eggs",
        "Flour"
      ],
      "occasion_tags": [
        "Everyday",
        "Party"
      ],
      "cooking_tips": [
        "For crispier fritters, ensure the oil is hot enough before frying.",
        "Adjust the amount of milk to achieve the desired batter consistency.",
        "Serve with a dipping sauce of your choice, such as aioli or a spicy salsa."
      ],
      "image_url": "https://raw.githubusercontent.com/hicutequeen/recipe-images/main/images/rice/recipe_d458tu4t2/d458tu4t2_main_image.jpg"
    },
    {
      "id": "d458td8e9",
      "name": "Risotto de salmón",
      "url": "http://www.recetasdiarias.com/recetas/arroz/risotto-de-salmon/",
      "ingredients": [
        "300g de arroz de grano redondo",
        "200g de salmón ahumado",
        "200ml de nata líquida para cocinar",
        "550ml de caldo de pescado",
        "1 nuez de mantequilla",
        "1 cebolla mediana",
        "Un buen chorro de vino para cocinar",
        "Pimienta",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Empezamos poniendo el caldo a calentar en un cazo, o en su defecto el agua para disolver las pastillas de caldo.",
        "Picamos la cebolla muy fina y ponemos la mantequilla a fuego bajo. Cuando esté fundida le añadimos la cebolla picada, una pizca de sal y dejamos que quede transparente.",
        "Echamos el arroz en la mantequilla con la cebolla y damos unas vueltas. Le tiramos el vino y que evapore.",
        "A partir de aquí vamos añadiendo cucharones de caldo, de uno en uno, y con cuidado de que no se pegue, dejamos que el arroz vaya absorbiendo el líquido y volvemos a echarle caldo.",
        "Mientras tanto picamos el salmón ahumado, y lo reservamos. Controlamos la cocción del arroz, pero tiene que seguir estando cremoso.",
        "Cuando esté ya casi hecho, añadimos el salmón y damos unas vueltas, finalmente la nata líquida, rectificamos de sal y pimienta y lo dejamos reposar 5 minutos tapado pero sin fuego.",
        "¡Y servimos!",
        "Un plato muy fácil para lo elegante que queda. ¡Buen provecho!",
        "Gloria Vélez"
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458td8e9-m.webp",
      "nutrition": null
    },
    {
      "id": "d458shggl",
      "name": "Maki sushi de plátano y surimi",
      "url": "http://www.recetasdiarias.com/recetas/arroz/maki-sushi-de-platano-y-surimi/",
      "ingredients": [
        "600g de arroz para sushi ya listo y a temperatura ambiente",
        "4-5 láminas de alga nori",
        "1-2 plátano no muy maduro",
        "Barritas de surimi (fresco o previamente descongelado)",
        "Esterilla para sushi para enrollar  Wasabi (opcional)",
        "Jengibre amargo (opcional)",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "No os pongo las cantidades de barritas de surimi, porque depende de las medidas de las láminas de alga nori pero normalmente caben aproximadamente 2,5 barritas de surimi por longitud de lámina de nori.",
        "Ponemos una lámina de alga con el lado brillante hacia abajo, sobre la esterilla.",
        "Dejando un margen de 1 cm de alga al principio de la lámina, repartimos unas cucharadas de arroz para sushi haciendo una línea a lo largo de toda la lámina.",
        "Hundimos encima del arroz el plátano / surimi.",
        "Ayudándonos de la esterilla, hacemos un rollito empezando por el lado del arroz y acabando por el lado que sólo había alga.",
        "Debe quedar un rollito apretado, que no se salga nada.",
        "Ese margen de 1 cm que hemos dejado al principio nos ayudará a que el rollito quede sellado.",
        "Una vez tengamos el maki sushi hecho y prensado, lo cortamos con un buen cuchillo con la hoja mojada, sino el rollito se desmontará al cortarlo.",
        "El grosor del rollito que lleve el plátano será más grande que el del que lleve las barritas de surimi.",
        "Servimos a temperatura ambiente, y acompañados de salsa de soja, wasabi o jengibre amargo.",
        "¡Ah, y atreveos con los palillos!",
        "Otro tipo de maki sushi diferente gracias a Gloria Vélez.",
        "いただきます – “ita daki mesh” – (buen provecho)"
      ],
      "duration": "10 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458shggl-m.webp",
      "nutrition": null
    },
    {
      "id": "1a0gsi54a",
      "name": "Baked Rice with Ribs and Blood Sausage",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-costillas-y-morcilla-al-horno/",
      "ingredients": [
        "4 pork ribs",
        "2 medium potatoes, peeled and chopped",
        "4 blood sausages per person (rice or onion or meat, as desired)",
        "1/2 cup tomato sauce",
        "2 tablespoons olive oil",
        "Salt, to taste",
        "1 teaspoon sweet paprika",
        "1/2 teaspoon saffron threads or food coloring",
        "4 cups rice",
        "8 cups water",
        "1 can (15 ounces) chickpeas, drained and rinsed (optional)"
      ],
      "directions": [
        "Step 1: Preheat oven to 350°F (180°C).",
        "Step 2: Lightly fry the ribs and blood sausage in a large skillet with olive oil until browned.",
        "Step 3: Remove the ribs and blood sausage from the skillet and set aside in a large oven-safe baking dish (preferably earthenware).",
        "Step 4: In the same skillet, fry the chopped potatoes with the tomato sauce until softened.",
        "Step 5: Add the water to the skillet, scraping up any browned bits from the bottom. Season with salt, paprika, and saffron or food coloring. Bring to a simmer.",
        "Step 6: Add the rice to the baking dish with the ribs and blood sausage. Pour the contents of the skillet over the rice. If using, distribute the chickpeas evenly over the rice.",
        "Step 7: Bake for 45 minutes, or until the rice is cooked through and the liquid is absorbed. Check after 20 minutes of simmering, and if the rice is too dry add more water.",
        "Step 8: Let rest for 10 minutes before serving."
      ],
      "duration": "45 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/1a0gsi54a-m.webp",
      "nutrition": {
        "calories": "600 per serving",
        "protein": "25 grams per serving",
        "carbs": "70 grams per serving",
        "fat": "20 grams per serving",
        "fiber": "10 grams per serving",
        "sugar": "5 grams per serving",
        "sodium": "600 mg per serving"
      },
      "ai_enhanced": true,
      "image_prompt": "Professional food photography of Baked Rice with Ribs and Blood Sausage on a white plate with garnish, high-resolution, studio lighting, shallow depth of field, soft natural lighting, rich colors and textures",
      "image_filepath": "recipe_1a0gsi54a/main_image",
      "video_script": {
        "title": "Recipe Tutorial: Baked Rice with Ribs and Blood Sausage",
        "description": "A tutorial for making Baked Rice with Ribs and Blood Sausage",
        "scenes": [
          {
            "scene_number": 1,
            "duration": 5,
            "image_prompt": "Professional food photography of Baked Rice with Ribs and Blood Sausage",
            "text": "Error generating full script",
            "voice_over": "This recipe tutorial will show you how to make this delicious dish.",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/1a0gsi54a-s.webp"
          }
        ],
        "error": "429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. [violations {\n}\n, links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, retry_delay {\n  seconds: 20\n}\n]"
      },
      "preparation_time_minutes": 20,
      "cooking_time_minutes": 45,
      "total_time_minutes": 65,
      "difficulty_level": "Medium",
      "meal_type": [
        "Lunch",
        "Dinner"
      ],
      "cuisine_type": "Spanish",
      "dietary_tags": [],
      "ingredient_tags": [
        "Pork",
        "Rice",
        "Potatoes",
        "Blood Sausage",
        "Tomato",
        "Chickpeas"
      ],
      "occasion_tags": [
        "Everyday",
        "Family Meal"
      ],
      "cooking_tips": [
        "For a different flavor profile, substitute the tomato sauce with sliced pear tomatoes and a whole head of garlic placed in the center of the dish before baking.",
        "The type of baking dish used (flat or deep) will affect the final texture of the rice. Flat dishes tend to produce drier rice, while deeper dishes result in a more moist or soupy consistency."
      ],
      "image_url": "https://raw.githubusercontent.com/hicutequeen/recipe-images/main/images/rice/recipe_1a0gsi54a/1a0gsi54a_main_image.jpg"
    },
    {
      "id": "d458snvfp",
      "name": "Risotto de jamón ibérico",
      "url": "http://www.recetasdiarias.com/recetas/arroz/risotto-de-jamon-iberico/",
      "ingredients": [
        "Para el aceite de jamón ibérico",
        "100 gr. de grasa de jamón ibérico",
        "5 cl. de agua",
        "1 cl. de aceite de oliva",
        "----------",
        "Para el consomé de jamón ibérico",
        "600 gr. de recortes de jamón ibérico",
        "2 litros de agua",
        "Para el risotto",
        "100 gr. de grasa de jamón",
        "Virutas de jamón",
        "400 gr. de arroz de grano redondo",
        "1 cebolla",
        "50 gr. de parmesano reggiano",
        "2 litros de caldo de jamón",
        "½ vaso de vino blanco",
        "2 cucharadas de mantequilla",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Preparación de aceite de jamón ibérico",
        "Preparación de consomé de jamón ibérico",
        "Preparación del risotto",
        "Sofreímos la cebolla, picada en daditos pequeños, junto con la mantequilla.",
        "Añadimos el arroz y el vino blanco. Dejamos que se evapore por completo.",
        "Y ahora viene el truco para lograr un buen risotto y es ir mojando con el consomé de jamón poco a poco y esperar hasta que se evapore, momento en el que se echa otro cucharón.",
        "Cubrimos el jamón con 1,2 litros de agua y poner a cocer a fuego lento desgrasando y retirando la espuma continuamente durante exactamente 15 minutos.",
        "Colamos procurando no enturbiar el caldo y desgrasamos nuevamente.",
        "Guardamos en la nevera.",
        "Ponemos todos los ingredientes a cocer a fuego lento hasta que se consuma el agua y la grasa sólida se haya transformado en chicharrrón.",
        "Colamos y guardamos el aceite obtenido.",
        "Preparación del risotto::; Sofreímos la cebolla, picada en daditos pequeños, junto con la mantequilla.:; Añadimos el arroz y el vino blanco. Dejamos que se evapore por completo.:; Y ahora viene el truco para lograr un buen risotto y es ir mojando con el consomé de jamón poco a poco y esperar hasta que se evapore, momento en el que se echa otro cucharón.",
        "Realizamos este proceso durante 15 minutos y cuando el arroz tenga un aspecto aterciopelado y cremoso, con los granos “al dente”, retirar del fuego y ligar finalmente el arroz con la grasa de jamón y el parmesano rallado.",
        "Servimos el risotto ibérico acompañado de algunas virutas de jamón. Riquísimo!",
        "Esta receta la hemos aprendido el gran maestro Ferran Adrià en Cocina con firma."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458snvfp-m.webp",
      "nutrition": null
    },
    {
      "id": "d458sdea8",
      "name": "Exotic Rice with Dried Fruits and Curry",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-exotico-con-frutos-secos-y-curry/",
      "ingredients": [
        "300g long grain rice (basmati or jasmine)",
        "200g mixed dried fruits with apricots and raisins",
        "600ml chicken broth",
        "3-4 cloves garlic, unpeeled",
        "1/2 medium onion, finely chopped",
        "2-3 tablespoons extra virgin olive oil",
        "1 tablespoon curry powder",
        "Salt to taste"
      ],
      "directions": [
        "Step 1: Heat the olive oil in a large pan over medium heat. Add the chopped onion and cook until golden brown.",
        "Step 2: Add the unpeeled garlic cloves and cook for a few minutes until fragrant.",
        "Step 3: Remove the garlic from the pan. Add the mixed dried fruits and curry powder to the pan. Stir well.",
        "Step 4: Add the rice to the pan and stir to coat with the oil and spices.",
        "Step 5: Pour in the chicken broth and bring to a boil. Reduce heat to low, cover, and simmer for about 20 minutes, or until the rice is cooked through and the liquid is absorbed.",
        "Step 6: Taste and adjust seasoning with more curry powder or salt if needed.",
        "Step 7: Serve hot."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458sdea8-m.webp",
      "nutrition": {
        "calories": "400-450 per serving",
        "protein": "10-12 grams per serving",
        "carbs": "70-80 grams per serving",
        "fat": "10-15 grams per serving",
        "fiber": "5-7 grams per serving",
        "sugar": "15-20 grams per serving",
        "sodium": "200-300mg per serving"
      },
      "ai_enhanced": true,
      "image_prompt": "Professional food photography of Exotic Rice with Dried Fruits and Curry on a white plate with garnish, high-resolution, studio lighting, shallow depth of field, soft natural lighting, rich colors and textures",
      "image_filepath": "recipe_d458sdea8/main_image",
      "video_script": {
        "title": "Exotic Rice with Dried Fruits and Curry",
        "description": "Learn to make this flavorful and aromatic rice dish with dried fruits and curry. Perfect for a weeknight meal or a special occasion.",
        "scenes": [
          {
            "scene_number": 1,
            "duration": 5,
            "image_prompt": "Close-up shot of a beautifully plated serving of exotic rice with dried fruits and curry, garnished with fresh herbs. Steam is gently rising from the dish.",
            "text": "Exotic Rice with Dried Fruits & Curry",
            "voice_over": "Welcome! Today, we're making a fragrant and flavorful rice dish with dried fruits and curry. It's easy to make and perfect for any occasion.",
            "scene_image_filename": "recipe_d458sdea8/scene_1_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sdea8-s.webp"
          },
          {
            "scene_number": 2,
            "duration": 5,
            "image_prompt": "Overhead shot of all ingredients neatly arranged on a wooden table: long grain rice, mixed dried fruits, chicken broth, garlic cloves, onion, olive oil, curry powder, and salt.",
            "text": "Ingredients",
            "voice_over": "Here's what you'll need: long grain rice, mixed dried fruits with apricots and raisins, chicken broth, garlic, onion, olive oil, curry powder, and salt.",
            "scene_image_filename": "recipe_d458sdea8/scene_2_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sdea8-s.webp"
          },
          {
            "scene_number": 3,
            "duration": 5,
            "image_prompt": "Close-up of a pan with olive oil heating up on a stovetop. Chopped onion is added to the pan.",
            "text": "Sauté Onion",
            "voice_over": "Heat olive oil in a large pan over medium heat. Add the chopped onion and cook until golden brown, about 5-7 minutes.",
            "scene_image_filename": "recipe_d458sdea8/scene_3_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sdea8-s.webp"
          },
          {
            "scene_number": 4,
            "duration": 5,
            "image_prompt": "Garlic cloves added to the pan with the sautéed onions. Close-up shot.",
            "text": "Add Garlic",
            "voice_over": "Add the unpeeled garlic cloves and cook for another 2-3 minutes until fragrant.",
            "scene_image_filename": "recipe_d458sdea8/scene_4_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sdea8-s.webp"
          },
          {
            "scene_number": 5,
            "duration": 5,
            "image_prompt": "Dried fruits and curry powder are added to the pan with the onions and garlic. The mixture is stirred well.",
            "text": "Spice & Fruit Infusion",
            "voice_over": "Remove the garlic. Add the dried fruits and curry powder. Stir well to combine.",
            "scene_image_filename": "recipe_d458sdea8/scene_5_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sdea8-s.webp"
          },
          {
            "scene_number": 6,
            "duration": 5,
            "image_prompt": "Rice is added to the pan and stirred to coat with the oil and spices. Close-up shot.",
            "text": "Rice Time",
            "voice_over": "Add the rice to the pan and stir to coat it with the flavorful oil and spices.",
            "scene_image_filename": "recipe_d458sdea8/scene_6_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sdea8-s.webp"
          },
          {
            "scene_number": 7,
            "duration": 5,
            "image_prompt": "Chicken broth being poured into the pan with the rice, spices, and dried fruits.",
            "text": "Broth & Simmer",
            "voice_over": "Pour in the chicken broth and bring to a boil. Then, reduce the heat to low, cover, and simmer for about 20 minutes, or until the rice is cooked through and the liquid is absorbed.",
            "scene_image_filename": "recipe_d458sdea8/scene_7_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sdea8-s.webp"
          },
          {
            "scene_number": 8,
            "duration": 5,
            "image_prompt": "A spoon is used to taste the rice. Close-up.",
            "text": "Seasoning Check",
            "voice_over": "Once cooked, taste the rice and adjust the seasoning with more curry powder or salt if needed.",
            "scene_image_filename": "recipe_d458sdea8/scene_8_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sdea8-s.webp"
          },
          {
            "scene_number": 9,
            "duration": 5,
            "image_prompt": "The finished dish of exotic rice with dried fruits and curry is plated in a serving bowl, garnished with fresh herbs, and ready to be served.",
            "text": "Serve & Enjoy",
            "voice_over": "Serve the rice hot and enjoy!  This dish pairs wonderfully with grilled chicken or fish.",
            "scene_image_filename": "recipe_d458sdea8/scene_9_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sdea8-s.webp"
          },
          {
            "scene_number": 10,
            "duration": 5,
            "image_prompt": "Two plates, one with the rice and grilled chicken, and another with rice and a salad.  Close-up.",
            "text": "Serving Suggestions",
            "voice_over": "Consider serving it with grilled chicken or a fresh salad for a complete meal.",
            "scene_image_filename": "recipe_d458sdea8/scene_10_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458sdea8-s.webp"
          }
        ]
      },
      "preparation_time_minutes": 15,
      "cooking_time_minutes": 25,
      "total_time_minutes": 40,
      "difficulty_level": "Easy",
      "meal_type": [
        "Lunch",
        "Dinner"
      ],
      "cuisine_type": "Spanish/Indian Fusion",
      "dietary_tags": [],
      "ingredient_tags": [
        "Rice",
        "Dried Fruits",
        "Curry",
        "Chicken Broth",
        "Garlic",
        "Onion"
      ],
      "occasion_tags": [
        "Everyday",
        "Potluck"
      ],
      "cooking_tips": [
        "For a richer flavor, toast the rice in the oil for a minute before adding the broth.",
        "If you prefer a milder curry flavor, start with 1/2 tablespoon of curry powder and add more to taste.",
        "You can substitute vegetable broth for chicken broth for a vegetarian option."
      ],
      "image_url": "https://raw.githubusercontent.com/hicutequeen/recipe-images/main/images/rice/recipe_d458sdea8/d458sdea8_main_image.jpg"
    },
    {
      "id": "d458tn5fu",
      "name": "Risotto veneciano",
      "url": "http://www.recetasdiarias.com/recetas/arroz/risotto-veneciano/",
      "ingredients": [
        "150 g de gambas limpias",
        "Con las cabezas y las cáscaras reservadas",
        "2 dientes de ajo partidos por la mitad",
        "1 limón en rodajas  150 g de mejillones limpios y sin las bardas",
        "150 g de almejas limpias",
        "500 ml de caldo de pescado",
        "120 g de mantequilla",
        "1 cucharada de aceite de oliva",
        "1 cebolla picada",
        "2 cucharadas de perejil picado",
        "300 g de arroz arborio",
        "125 ml de vino blanco seco",
        "150 g de calamar limpio en anillas o trocitos",
        "4 cucharadas de vino de marsala",
        "Sal y pimienta",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Envuelva las cabezas y cáscaras de las gambas en una estopilla y macháquelas en el mortero. Échelas en una cazuela, con su líquido en una cazuela con el ajo, el limón, los mejillones y las almejas. Vierta medio litro de agua, tápelo y llévelo a ebullición a fuego vivo.",
        "Cuézalo agitando la cazuela, 5 minutos, hasta que los moluscos se abran. Déjelos enfriar y deseche las valvas. Cuele el caldo a través de un colador forrado con muselina y añada el caldo de pescado. Hiérvalo y déjelo cocer a fuego lento.",
        "En una cazuela, derrita la mantequilla con el aceite. Rehogue la cebolla con la mitad del perejil a fuego medio, removiendo hasta que esté tierna. Baje el fuego, eche el arroz, removiendo hasta que esté transparente",
        "Vierta el vino y cuézalo, removiendo 1 minuto, hasta que se reduzca. Vierta el caldo, cucharón a cucharón, removiendo tras cada incorporación hasta que el arroz se lo embeba y esté cocida.",
        "En una cazuela, funda 50 g de mantequilla y sofría el calamar, removiendo, 3 minutos. Eche las gambas y siga sufriendo durante 2 o 3 minutos. Vierta el marsala, llévelo a ebullición y cuézalo hasta que se evapore.",
        "Agregue el marisco al arroz junto con el resto de la mantequilla y del perejil, salpimiéntelo y sírvalo enseguida."
      ],
      "duration": "35 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458tn5fu-m.webp",
      "nutrition": null
    },
    {
      "id": "d458tidcd",
      "name": "Lentil and Rice Salad",
      "url": "http://www.recetasdiarias.com/recetas/arroz/ensalada-de-lentejas-y-arroz/",
      "ingredients": [
        "1 cup long grain rice",
        "1/2 cup cooked lentils",
        "1/2 cup diced pancetta (about 150g)",
        "1 medium onion, finely chopped",
        "1 bay leaf",
        "2 tablespoons olive oil",
        "Salt, to taste",
        "Black pepper, freshly ground, to taste"
      ],
      "directions": [
        "Step 1: Cook the rice: In a medium pot, combine the rice, 2 3/4 cups of water, 1 tablespoon of olive oil, and a pinch of salt. Bring to a boil, then reduce heat to low, cover, and simmer for 15-20 minutes, or until the rice is cooked through and the water is absorbed.",
        "Step 2: Rinse and cool the rice: Once the rice is cooked, drain any excess water and rinse the rice under cold water to stop the cooking process. Set aside to cool.",
        "Step 3: Prepare the lentils: Rinse the cooked lentils under cold water and set aside.",
        "Step 4: Sauté the pancetta and onion: In a large skillet, heat the remaining olive oil over medium heat. Add the chopped onion and bay leaf, season with salt and pepper, and cook until softened, about 5 minutes.",
        "Step 5: Add the pancetta: Add the diced pancetta to the skillet and cook until golden brown and crispy, about 5-7 minutes.",
        "Step 6: Combine the ingredients: Add the cooled rice and lentils to the skillet with the pancetta and onion. Sauté for 2-3 minutes, stirring to combine and heat through. Season with salt and pepper to taste.",
        "Step 7: Serve: Remove the bay leaf. Serve the lentil and rice salad immediately."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458tidcd-m.webp",
      "nutrition": {
        "calories": "350 per serving",
        "protein": "15 grams per serving",
        "carbs": "50 grams per serving",
        "fat": "12 grams per serving",
        "fiber": "5 grams per serving",
        "sugar": "2 grams per serving",
        "sodium": "300 mg per serving"
      },
      "ai_enhanced": true,
      "image_prompt": "Professional food photography of Lentil and Rice Salad on a white plate with garnish, high-resolution, studio lighting, shallow depth of field, soft natural lighting, rich colors and textures",
      "image_filepath": "recipe_d458tidcd/main_image",
      "video_script": {
        "title": "Lentil and Rice Salad: A Hearty and Flavorful Meal",
        "description": "Learn how to make a delicious and easy lentil and rice salad with crispy pancetta and aromatic onions. This recipe is perfect for a quick weeknight dinner or a light lunch.",
        "scenes": [
          {
            "scene_number": 1,
            "duration": 5,
            "image_prompt": "Close-up shot of a finished lentil and rice salad, garnished with fresh parsley. The salad is in a rustic wooden bowl, with a fork placed beside it. The background is slightly blurred, creating a warm and inviting atmosphere.",
            "text": "Lentil & Rice Salad",
            "voice_over": "Welcome! Today, we're making a hearty and flavorful Lentil and Rice Salad. It's easy to make and packed with protein and fiber.",
            "scene_image_filename": "recipe_d458tidcd/scene_1_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tidcd-s.webp"
          },
          {
            "scene_number": 2,
            "duration": 5,
            "image_prompt": "Overhead shot of the ingredients arranged on a wooden table. Group related ingredients: rice in a bowl, lentils in a separate bowl, pancetta slices neatly stacked, chopped onion in a small bowl, bay leaf next to the onion, and olive oil in a small glass bottle. Salt and pepper grinders are placed nearby.",
            "text": "Ingredients",
            "voice_over": "Here's what you'll need: one cup of long grain rice, half a cup of cooked lentils, half a cup of diced pancetta, one medium onion finely chopped, a bay leaf, two tablespoons of olive oil, salt, and pepper.",
            "scene_image_filename": "recipe_d458tidcd/scene_2_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tidcd-s.webp"
          },
          {
            "scene_number": 3,
            "duration": 5,
            "image_prompt": "Medium pot with rice and water coming to a boil on a stovetop. Steam is rising from the pot.",
            "text": "Cook the Rice",
            "voice_over": "First, combine the rice with 2 3/4 cups of water, one tablespoon of olive oil, and a pinch of salt in a medium pot. Bring to a boil, then lower the heat, cover, and simmer for 15-20 minutes until cooked.",
            "scene_image_filename": "recipe_d458tidcd/scene_3_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tidcd-s.webp"
          },
          {
            "scene_number": 4,
            "duration": 4,
            "image_prompt": "Colander with freshly cooked rice being rinsed under cold running water.",
            "text": "Rinse & Cool",
            "voice_over": "Once cooked, drain any excess water and rinse the rice under cold water. Set it aside to cool.",
            "scene_image_filename": "recipe_d458tidcd/scene_4_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tidcd-s.webp"
          },
          {
            "scene_number": 5,
            "duration": 5,
            "image_prompt": "Large skillet with chopped onions and bay leaf sautéing in olive oil. The onions are translucent and slightly browned.",
            "text": "Sauté Onion",
            "voice_over": "In a skillet, heat the remaining olive oil. Add the chopped onion and bay leaf. Season with salt and pepper, and cook until softened, about 5 minutes over medium heat.",
            "scene_image_filename": "recipe_d458tidcd/scene_5_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tidcd-s.webp"
          },
          {
            "scene_number": 6,
            "duration": 5,
            "image_prompt": "Close-up shot of diced pancetta being added to the skillet with the sautéed onions and bay leaf.",
            "text": "Add Pancetta",
            "voice_over": "Add the diced pancetta and cook until golden brown and crispy, about 5-7 minutes.",
            "scene_image_filename": "recipe_d458tidcd/scene_6_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tidcd-s.webp"
          },
          {
            "scene_number": 7,
            "duration": 5,
            "image_prompt": "Cooled rice and lentils being added to the skillet with the pancetta and onion mixture.",
            "text": "Combine",
            "voice_over": "Add the cooled rice and lentils to the skillet. Sauté for 2-3 minutes, stirring to combine and heat through.",
            "scene_image_filename": "recipe_d458tidcd/scene_7_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tidcd-s.webp"
          },
          {
            "scene_number": 8,
            "duration": 5,
            "image_prompt": "Close-up shot of the finished lentil and rice salad being seasoned with salt and pepper.",
            "text": "Season",
            "voice_over": "Season with salt and pepper to taste.  Remove the bay leaf before serving.",
            "scene_image_filename": "recipe_d458tidcd/scene_8_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tidcd-s.webp"
          },
          {
            "scene_number": 9,
            "duration": 6,
            "image_prompt": "The finished lentil and rice salad is served in two bowls, garnished with fresh parsley. One bowl is in the foreground, and the other is slightly blurred in the background. A glass of white wine and a crusty piece of bread is placed next to the bowls.",
            "text": "Serve & Enjoy!",
            "voice_over": "Serve immediately. This salad is delicious on its own or as a side dish. A glass of crisp white wine pairs perfectly. Enjoy!",
            "scene_image_filename": "recipe_d458tidcd/scene_9_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tidcd-s.webp"
          }
        ]
      },
      "preparation_time_minutes": 15,
      "cooking_time_minutes": 30,
      "total_time_minutes": 45,
      "difficulty_level": "Easy",
      "meal_type": [
        "Lunch",
        "Dinner"
      ],
      "cuisine_type": "Spanish",
      "dietary_tags": [],
      "ingredient_tags": [
        "Rice",
        "Lentils",
        "Pancetta",
        "Onion"
      ],
      "occasion_tags": [
        "Everyday",
        "Potluck"
      ],
      "cooking_tips": [
        "For a vegetarian version, omit the pancetta and use vegetable broth instead of water for cooking the rice.",
        "Add chopped fresh parsley or cilantro before serving for extra flavor and color.",
        "If you don't have cooked lentils, you can use canned lentils, rinsed and drained."
      ],
      "image_url": "https://raw.githubusercontent.com/hicutequeen/recipe-images/main/images/rice/recipe_d458tidcd/d458tidcd_main_image.jpg"
    },
    {
      "id": "46efkuu3",
      "name": "Arroz con Leche (Spanish Rice Pudding)",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-leche/",
      "ingredients": [
        "1 liter whole milk",
        "240g Arborio rice",
        "135g granulated sugar",
        "60g unsalted butter, softened",
        "180ml heavy cream (35% fat)",
        "2 pinches ground cinnamon",
        "2 strips lemon zest",
        "1 strip orange zest",
        "1 cinnamon stick"
      ],
      "directions": [
        "Step 1: In a saucepan, combine the milk, heavy cream, lemon zest, orange zest, and cinnamon stick. Heat over medium heat and let it infuse for 5 minutes. Strain the mixture and set aside.",
        "Step 2: In a separate pot, combine half of the infused milk and cream mixture with the rice. Cook over low heat for 45 minutes, gradually adding the remaining milk and cream mixture as it absorbs, similar to making risotto.",
        "Step 3: After 10 minutes of cooking, add the sugar and stir well to prevent the rice from sticking to the bottom of the pot.",
        "Step 4: After 35 minutes, once the rice is cooked and creamy, stir in the softened butter until well combined.",
        "Step 5: Divide the arroz con leche into individual bowls and refrigerate until chilled.",
        "Step 6: Before serving, sprinkle ground cinnamon over each bowl to taste."
      ],
      "duration": "40 minutes ",
      "serves": "6",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/46efkuu3-m.webp",
      "nutrition": {
        "calories": "300 per serving",
        "protein": "5g per serving",
        "carbs": "50g per serving",
        "fat": "12g per serving",
        "fiber": "1g per serving",
        "sugar": "30g per serving",
        "sodium": "50mg per serving"
      },
      "ai_enhanced": true,
      "image_prompt": "Professional food photography of Arroz con Leche (Spanish Rice Pudding) on a white plate with garnish, high-resolution, studio lighting, shallow depth of field, soft natural lighting, rich colors and textures",
      "image_filepath": "recipe_46efkuu3/main_image",
      "video_script": {
        "title": "Creamy Arroz con Leche: Spanish Rice Pudding",
        "description": "Learn how to make this comforting and classic Spanish dessert, Arroz con Leche. This recipe is easy to follow and results in a creamy, flavorful rice pudding perfect for any occasion.",
        "scenes": [
          {
            "scene_number": 1,
            "duration": 5,
            "image_prompt": "Close-up shot of a beautifully styled bowl of Arroz con Leche, garnished with ground cinnamon. The pudding looks creamy and inviting. Focus on the texture and warm color.",
            "text": "Arroz con Leche",
            "voice_over": "Welcome! Today, we're making Arroz con Leche, a classic Spanish rice pudding. It's creamy, comforting, and incredibly delicious.",
            "scene_image_filename": "recipe_46efkuu3/scene_1_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/46efkuu3-s.webp"
          },
          {
            "scene_number": 2,
            "duration": 5,
            "image_prompt": "Overhead shot of all ingredients arranged neatly on a wooden table: milk, Arborio rice, sugar, butter, heavy cream, cinnamon, lemon zest, orange zest, and cinnamon stick.",
            "text": "Ingredients",
            "voice_over": "Here's what you'll need: Arborio rice, whole milk, heavy cream, sugar, butter, cinnamon, lemon zest, and orange zest. These simple ingredients combine to create a symphony of flavors.",
            "scene_image_filename": "recipe_46efkuu3/scene_2_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/46efkuu3-s.webp"
          },
          {
            "scene_number": 3,
            "duration": 5,
            "image_prompt": "Saucepan with milk, heavy cream, lemon zest, orange zest, and cinnamon stick simmering over medium heat.",
            "text": "Infuse Milk & Cream",
            "voice_over": "In a saucepan, combine the milk, heavy cream, lemon zest, orange zest, and cinnamon stick. Heat over medium heat for 5 minutes to infuse the flavors. Then, strain the mixture and set it aside.",
            "scene_image_filename": "recipe_46efkuu3/scene_3_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/46efkuu3-s.webp"
          },
          {
            "scene_number": 4,
            "duration": 5,
            "image_prompt": "Pot with rice and infused milk mixture cooking over low heat. Show a close up of the rice absorbing the milk.",
            "text": "Cook the Rice",
            "voice_over": "Combine half of the infused milk mixture with the rice in a separate pot. Cook over low heat for 45 minutes, gradually adding the remaining milk as it's absorbed, just like making risotto.",
            "scene_image_filename": "recipe_46efkuu3/scene_4_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/46efkuu3-s.webp"
          },
          {
            "scene_number": 5,
            "duration": 4,
            "image_prompt": "Stirring sugar into the rice mixture after 10 minutes of cooking.",
            "text": "Add Sugar",
            "voice_over": "After 10 minutes, add the sugar and stir well. This prevents the rice from sticking and ensures even sweetness.",
            "scene_image_filename": "recipe_46efkuu3/scene_5_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/46efkuu3-s.webp"
          },
          {
            "scene_number": 6,
            "duration": 4,
            "image_prompt": "Stirring softened butter into the creamy rice pudding after 35 minutes of cooking.",
            "text": "Incorporate Butter",
            "voice_over": "After 35 minutes, the rice should be cooked and creamy. Stir in the softened butter until it's fully melted and combined.",
            "scene_image_filename": "recipe_46efkuu3/scene_6_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/46efkuu3-s.webp"
          },
          {
            "scene_number": 7,
            "duration": 5,
            "image_prompt": "Arroz con Leche being divided into individual serving bowls.",
            "text": "Chill & Serve",
            "voice_over": "Divide the arroz con leche into bowls and refrigerate until chilled. This allows the flavors to meld and the pudding to thicken.",
            "scene_image_filename": "recipe_46efkuu3/scene_7_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/46efkuu3-s.webp"
          },
          {
            "scene_number": 8,
            "duration": 5,
            "image_prompt": "Close-up of a bowl of chilled Arroz con Leche being sprinkled with ground cinnamon.",
            "text": "Garnish & Enjoy",
            "voice_over": "Just before serving, sprinkle with ground cinnamon.  Each serving is approximately 300 calories, with 5g of protein, 50g of carbs, and 12g of fat. Enjoy your delicious homemade Arroz con Leche!",
            "scene_image_filename": "recipe_46efkuu3/scene_8_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/46efkuu3-s.webp"
          }
        ]
      },
      "preparation_time_minutes": 15,
      "cooking_time_minutes": 50,
      "total_time_minutes": 65,
      "difficulty_level": "Medium",
      "meal_type": [
        "Dessert",
        "Snack"
      ],
      "cuisine_type": "Spanish",
      "dietary_tags": [
        "Vegetarian"
      ],
      "ingredient_tags": [
        "Rice",
        "Milk",
        "Cinnamon",
        "Lemon",
        "Orange"
      ],
      "occasion_tags": [
        "Everyday",
        "Party",
        "Holiday"
      ],
      "cooking_tips": [
        "Use Arborio rice for a creamy texture.",
        "Infusing the milk with citrus zest and cinnamon adds depth of flavor.",
        "Gradually adding the milk mixture ensures even cooking and prevents sticking.",
        "Adjust the sugar to your preference.",
        "Serve chilled for the best experience."
      ],
      "image_url": "https://raw.githubusercontent.com/hicutequeen/recipe-images/main/images/rice/recipe_46efkuu3/46efkuu3_main_image.jpg"
    },
    {
      "id": "d458sc87i",
      "name": "Arroz con pollo al curry thai",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-pollo-al-curry-thai/",
      "ingredients": [
        "300g de arroz de grano largo (basmati ó jazmín...)",
        "300g de pechuga de pollo",
        "4 cucharadas de pasta de curry rojo tailandés",
        "700ml de leche de coco",
        "4-5 cucharadas de aceite de girasol",
        "Sal",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Empezamos poniendo el aceite (cucharadas generosas) a calentar en una sartén amplia. Cuando esté caliente, echamos la pasta de curry y removemos bien.",
        "Añadimos la leche de coco y removemos para que se integre. Rectificamos de sal.",
        "Con unas tijeras cortamos las pechugas en trozos no muy grandes, intentando no hacer unos mucho más grandes que otros.",
        "Añadimos la pechuga a la salsa para que cueza ya con el sabor del curry thai.",
        "Mientras ponemos a cocer el arroz en agua salada. Lo dejamos los 15-20 minutos y comprobamos la cocción.",
        "Una vez cocido, colamos el arroz, para retirar todo el exceso de agua y lo reservamos.",
        "Comprobamos la cocción del pollo (no conviene que quede crudo) y echamos el arroz que ya teníamos cocido.",
        "Revolvemos bien y servimos muy caliente.",
        "Nota de Gloria Vélez: cuando compremos la pasta de curry fijaos en el grado de picante, no vayáis a comprar algo que luego apenas se pueda comer!"
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458sc87i-m.webp",
      "nutrition": null
    },
    {
      "id": "d458sijl7",
      "name": "Arroz para sushi",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-para-sushi/",
      "ingredients": [
        "300g de arroz para sushi",
        "350ml de agua",
        "1 trozo de alga kombu (alga opcional)",
        "2 cucharadas de condimento para sushi  (sustituible por 2 cucharadas de vinagre de arroz con 1 cucharada de azúcar y 1⁄2 cucharadita  de sal)",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "¡Hacer sushi en casa es muy fácil!",
        "El primer paso es hacer el arroz para sushi, la base de cualquier tipo de sushi que queramos hacer, con esta receta logramos 600g de arroz perfecto.",
        "Primeramente lavamos el arroz con agua hasta que no salgan restos blancos de almidón, lo podemos poder en un bol dando vueltas al arroz hasta q veamos que el agua nueva sale clara.",
        "Lo ponemos en un cazo con el agua (en frío) y el alga (si la vamos a usar), lo tapamos y lo llevamos a ebullición.",
        "Entonces retiramos el alga, bajamos el fuego al mínimo y lo dejamos así 10 minutos.",
        "Pasados estos 10 minutos, apagamos el fuego y lo dejamos 15 minutos más.",
        "Es importantísimo no destapar el arroz una vez hayamos sacado el alga.",
        "Ahora ponemos el arroz caliente en un bol, y lo condimentamos con el preparado especial. Lo vamos mezclando con una espátula y con la otra mano lo abanicamos para que se vaya enfriando lo antes posible.",
        "Esto es para que el arroz ya esté a temperatura ambiente en el momento de usarlo.",
        "いただきます – “ita daki mesh” – (buen provecho)",
        "Gloria Vélez"
      ],
      "duration": "25 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458sijl7-m.webp",
      "nutrition": null
    },
    {
      "id": "d458tt1fc",
      "name": "Paella de marisco",
      "url": "http://www.recetasdiarias.com/recetas/arroz/paella-de-marisco/",
      "ingredients": [
        "400g de arroz bomba",
        "12 gambas langostineras",
        "16 mejillones",
        "12 almejas",
        "800ml de caldo de pescado",
        "1 cebolla",
        "1 pimiento verde",
        "½ pimiento rojo",
        "1 sepia o calamar grande",
        "1 bote pequeño de concentrado de tomate",
        "½ vaso de vino blanco",
        "2 ajos",
        "1 rama perejil",
        "1 hebra de azafrán",
        "Sal",
        "Aceite de oliva",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero en una paella echamos un poco de aceite, salteamos las gambas y las almejas, para que el aceite coja sabor, retiramos el marisco del fuego para reservarlo.",
        "En ese mismo aceite bien caliente, freímos la sepia o calamar cortada a dados, hasta que dore, retirarla.",
        "Añadimos la cebolla, los pimientos, la picada de ajo y perejil, que poche todo bien, entonces echamos el vino y dejamos reducir.",
        "Cuando haya evaporado, echamos la sepia y el tomate y la hebra de azafrán lo dejamos 2 minutos removiendo bien y entonces añadimos el arroz.",
        "Dejamos 2 minutos maás sin parar de remover, añadimos el caldo dejamos que arranque a hervir.",
        "Entonces colocamos las gambas, almejas y mejillones bien bonito todo, y metemos la paella al horno a 180º unos 15-20 minutos, dejamos reposar fuera 5 minutos más y listo.",
        "Consejo: podemos comprar la sepia sucia, limpiarla nosotros para reservar la melsa del animal, añadírselo al sofrito, nos potenciara mucho el sabor a pescado."
      ],
      "duration": "45 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458tt1fc-m.webp",
      "nutrition": null
    },
    {
      "id": "d458tf8a0",
      "name": "Risotto de champiñones",
      "url": "http://www.recetasdiarias.com/recetas/arroz/risotto-de-champinones/",
      "ingredients": [
        "300 g arroz",
        "200g de champiñones frescos",
        "1 cebolla",
        "1 ajo",
        "650ml caldo pollo",
        "4 cucharadas queso parmesano rallado",
        "2 cucharadas vino blanco",
        "Aceite",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero picamos la cebolla y el ajo muy fina y limpiamos bien los champiñones. Luego, en una sartén grande antiadherente con un chorrito de aceite, cocinamos durante unos 8 minutos los champiñones, la cebolla y cuando dore le añadimos el ajo y arroz, dejamos unos 4 minutos removiendo.",
        "Una vez el arroz tome un tono dorado, añadimos el caldo y el vino, llevando el conjunto a ebullición. Lo vamos añadiendo poco a poco para ver la cremosidad que va cogiendo el arroz.",
        "Cuando el arroz este echo y bien cremoso, añadimos el queso parmesano, removemos bien todo y dejamos reposar unos minutos antes de servir."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458tf8a0-m.webp",
      "nutrition": null
    },
    {
      "id": "1a0gse8rr",
      "name": "Arroz con champiñones y espárragos trigueros",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-champinones-y-esparragos-trigueros/",
      "ingredients": [
        "300 gramos de arroz",
        "300 gramos de espárragos trigueros",
        "300 gramos de champiñones",
        "3 ajos",
        "1/2 cebolla",
        "Aceite de oliva virgen extra",
        "Sal",
        "Pimienta negra.",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero ponemos abundante agua a calentar en una cazuela. En el momento que veamos que rompa a hervir añadimos el arroz y cocemos el arroz durante 15 minutos.",
        "Pasado este tiempo escurrimos y aclaramos con agua fría para así detener la cocción del arroz.",
        "Mientras se hace el arroz limpiamos la tierra que puedan llevar los champiñones. Cortamos los extremos del tallo de cada champiñón y fileteamos con mucho cuidado.",
        "A continuación eliminamos el extremo duro de los espárragos y así cortamos en trozos de 1 ó 2 centímetros de longitud.",
        "Seguidamente ponemos al fuego una sartén grande con un chorro de aceite de oliva en el fondo.",
        "En el momento que comience a calentar añadimos, la cebolla muy picada, sofreímos bien y seguidamente agregamos los espárragos trigueros troceados, los ajos picados finamente y bajamos un poco el fuego.",
        "Removemos un poco y pasados 5 minutos añadimos los champiñones a la sartén junto con los espárragos.",
        "Salpimentamos al gusto y cocinamos removiendo con frecuencia con una cuchara de madera todo hasta que esté tierno durante 15 minutos, para que se haga por todos los lados y evitar que se pegue a la sartén.",
        "Emplatamos el arroz ya escurrido, agregamos los champiñones y los espárragos por encima.",
        "Si lo prefieres puedes agregar el arroz a la sartén para que se mezclen los sabores durante unos 3 minutos hasta que el arroz esté caliente de nuevo."
      ],
      "duration": "25 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/1a0gse8rr-m.webp",
      "nutrition": null
    },
    {
      "id": "d458tp12r",
      "name": "Classic Risotto",
      "url": "http://www.recetasdiarias.com/recetas/arroz/risotto-clasico/",
      "ingredients": [
        "300 g Arborio rice",
        "600 ml hot Chicken or beef broth",
        "4 tablespoons unsalted butter",
        "50 g grated Parmesan cheese",
        "1 medium yellow onion, finely chopped",
        "1 pinch saffron threads",
        "Salt to taste"
      ],
      "directions": [
        "Step 1: In a large saucepan or pot, melt 2 tablespoons of butter over medium heat. Add the finely chopped onion and sauté until softened and translucent, about 5-7 minutes. Do not brown the onion.",
        "Step 2: Add the Arborio rice to the pot and stir constantly for 2-3 minutes, coating the grains with the butter and onion mixture. This process, called toasting, helps the rice release its starches and create a creamy risotto.",
        "Step 3: Add a ladleful of hot broth to the rice, stirring continuously until the liquid is absorbed. Continue adding the broth, one ladleful at a time, stirring constantly and allowing each ladleful to be absorbed before adding the next. This slow addition and constant stirring helps the rice release its starches, creating a creamy texture.",
        "Step 4: After about 20-25 minutes, the rice should be cooked al dente – tender but with a slight bite. The risotto should have a creamy consistency.  Add the saffron threads to the remaining broth and stir into the risotto.  The risotto should take on a pale yellow color.",
        "Step 5: Remove the risotto from the heat and stir in the remaining 2 tablespoons of butter and the grated Parmesan cheese. Season with salt to taste. Serve immediately."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458tp12r-m.webp",
      "nutrition": {
        "calories": "400 per serving",
        "protein": "12 grams per serving",
        "carbs": "75 grams per serving",
        "fat": "12 grams per serving",
        "fiber": "2 grams per serving",
        "sugar": "2 grams per serving",
        "sodium": "600 mg per serving"
      },
      "ai_enhanced": true,
      "image_prompt": "Professional food photography of Classic Risotto on a white plate with garnish, high-resolution, studio lighting, shallow depth of field, soft natural lighting, rich colors and textures",
      "image_filepath": "recipe_d458tp12r/main_image",
      "video_script": {
        "title": "Classic Creamy Risotto",
        "description": "Learn how to make classic risotto with this easy-to-follow recipe. This creamy and flavorful dish is perfect for a weeknight dinner or a special occasion.",
        "scenes": [
          {
            "scene_number": 1,
            "duration": 5,
            "image_prompt": "Close-up shot of a creamy, pale yellow risotto garnished with fresh parsley in a shallow bowl. Steam gently rises from the dish.",
            "text": "Classic Creamy Risotto",
            "voice_over": "Welcome! Today, we're making classic risotto, a dish known for its creamy texture and rich flavor.  Get ready for a culinary adventure!",
            "scene_image_filename": "recipe_d458tp12r/scene_1_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tp12r-s.webp"
          },
          {
            "scene_number": 2,
            "duration": 5,
            "image_prompt": "A rustic wooden table displaying Arborio rice in a small bowl, finely chopped yellow onion in another bowl, and a pinch of saffron threads on a small plate.",
            "text": "Ingredients",
            "voice_over": "Here's what you'll need: Arborio rice, the key to that perfect creamy texture, finely chopped yellow onion, and a pinch of saffron for that beautiful golden hue and unique flavor.",
            "scene_image_filename": "recipe_d458tp12r/scene_2_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tp12r-s.webp"
          },
          {
            "scene_number": 3,
            "duration": 5,
            "image_prompt": "A large saucepan on a stovetop with melted butter and sautéed onions. The onions are translucent but not browned.",
            "text": "Sauté Onion",
            "voice_over": "In a large saucepan, melt 2 tablespoons of butter over medium heat. Add the chopped onion and sauté for 5-7 minutes until softened and translucent. Don't let them brown.",
            "scene_image_filename": "recipe_d458tp12r/scene_3_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tp12r-s.webp"
          },
          {
            "scene_number": 4,
            "duration": 5,
            "image_prompt": "Arborio rice is being added to the saucepan with the sautéed onions and butter. A wooden spoon is stirring the rice.",
            "text": "Toast the Rice",
            "voice_over": "Add the Arborio rice and stir constantly for 2-3 minutes, coating each grain with the butter and onion mixture. This toasting process is crucial for releasing the rice's starches and achieving that signature creaminess.",
            "scene_image_filename": "recipe_d458tp12r/scene_4_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tp12r-s.webp"
          },
          {
            "scene_number": 5,
            "duration": 6,
            "image_prompt": "A ladle pouring hot broth into the rice mixture. The rice is being stirred continuously with a wooden spoon.",
            "text": "Add Broth Gradually",
            "voice_over": "Now, the heart of risotto-making: slowly add a ladle of hot broth, stirring continuously until absorbed. Repeat this process, adding broth one ladle at a time and ensuring each is absorbed before adding the next. This slow addition and constant stirring are key to a creamy risotto.",
            "scene_image_filename": "recipe_d458tp12r/scene_5_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tp12r-s.webp"
          },
          {
            "scene_number": 6,
            "duration": 5,
            "image_prompt": "The risotto is simmering in the saucepan. The rice looks creamy and has a pale yellow color from the saffron.",
            "text": "Simmer & Saffron",
            "voice_over": "After about 20-25 minutes, the rice should be cooked al dente—tender with a slight bite.  The risotto should be creamy. Now, infuse that gorgeous golden color and delicate flavor by stirring in the saffron threads.",
            "scene_image_filename": "recipe_d458tp12r/scene_6_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tp12r-s.webp"
          },
          {
            "scene_number": 7,
            "duration": 5,
            "image_prompt": "Butter and Parmesan cheese are being stirred into the finished risotto off the heat. The risotto looks rich and creamy.",
            "text": "Final Touches",
            "voice_over": "Remove the risotto from the heat and enrich it further by stirring in the remaining butter and Parmesan cheese. Season with salt to taste.",
            "scene_image_filename": "recipe_d458tp12r/scene_7_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tp12r-s.webp"
          },
          {
            "scene_number": 8,
            "duration": 7,
            "image_prompt": "A close-up shot of a serving of creamy risotto garnished with fresh parsley and a sprinkle of Parmesan cheese in a shallow bowl.",
            "text": "Serve & Enjoy!",
            "voice_over": "Serve immediately and enjoy your classic creamy risotto! It's a culinary masterpiece that's perfect as a main course or a side dish.  Buon appetito!",
            "scene_image_filename": "recipe_d458tp12r/scene_8_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458tp12r-s.webp"
          }
        ]
      },
      "preparation_time_minutes": 10,
      "cooking_time_minutes": 30,
      "total_time_minutes": 40,
      "difficulty_level": "Medium",
      "meal_type": [
        "Lunch",
        "Dinner"
      ],
      "cuisine_type": "Italian",
      "dietary_tags": [],
      "ingredient_tags": [
        "Rice",
        "Parmesan",
        "Onion",
        "Butter",
        "Saffron"
      ],
      "occasion_tags": [
        "Everyday",
        "Special Occasion"
      ],
      "cooking_tips": [
        "Use hot broth for the best results, as cold broth will interrupt the cooking process and make the risotto unevenly cooked.",
        "Stir the risotto frequently to release the starches and create a creamy texture.",
        "Taste the risotto before adding salt, as the Parmesan cheese is already salty.",
        "Do not rinse the Arborio rice before cooking, as this will remove the starches that are essential for the creamy texture.",
        "For a vegetarian version, use vegetable broth instead of chicken or beef broth."
      ],
      "image_url": "https://raw.githubusercontent.com/hicutequeen/recipe-images/main/images/rice/recipe_d458tp12r/d458tp12r_main_image.jpg"
    },
    {
      "id": "d458sju3t",
      "name": "Arroz con alcachofas y setas de cardo",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-alcachofas-y-setas-de-cardo/",
      "ingredients": [
        "350g de arroz de grano redondo",
        "10 alcachofas",
        "200g de setas de cardo frescas",
        "1 litro de caldo de verduras o de pollo (o 2 pastillas de caldo disueltas en un litro de agua hirviendo)",
        "1 cebolla mediana",
        "1 vaso de tomate triturado",
        "Un buen chorro de vino para cocinar",
        "Aceite de oliva virgen extra",
        "Zumo de limón",
        "Sal",
        "(opcional)",
        "1 cucharadita de picada de ajo y perejil",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Empezamos limpiando las alcachofas, para quedarnos sólo con los corazones, que partimos en medios cuartos.",
        "Ponemos agua a hervir en un cazo, y cuando hierva, añadimos los corazones de alcachofa con un chorro de zumo de limón (evitará que se pongan negros por la oxidación). Los cocemos un poco, pero luego continuarán la cocción junto con el arroz.",
        "Ponemos el caldo a calentar en un cazo, o en su defecto el agua para disolver las pastillas de caldo.",
        "Picamos la cebolla muy fina y la ponemos a pochar con el aceite de oliva y un poco de sal. Cuando esté transparente agregamos 1 cucharadita de picada de ajo y perejil, removemos y echamos el arroz con la cebolla y damos unas vueltas. Le tiramos el vino y que evapore, echamos también el tomate triturado.",
        "A partir de aquí vamos añadiendo cucharones de caldo, de uno en uno, y con cuidado de que no se pegue, dejamos que el arroz vaya absorbiendo el líquido y volvemos a echarle caldo.",
        "Juntamos los corazones de alcachofas con el arroz.",
        "Picamos en trozos no muy pequeños las setas de cardo.",
        "Controlamos la cocción del arroz, pero tiene que seguir estando cremoso, o un poco caldoso.",
        "Cuando esté ya casi hecho, añadimos las setas, rectificamos de sal y lo dejamos reposar 5 minutos tapado pero sin fuego.",
        "Lo servimos muy caliente.",
        "Receta enviada por Gloria Vélez, revisada por cocinero C. Rueda."
      ],
      "duration": "60 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458sju3t-m.webp",
      "nutrition": null
    },
    {
      "id": "d458tqjlm",
      "name": "Risotto al queso azul",
      "url": "http://www.recetasdiarias.com/recetas/arroz/risotto-al-queso-azul/",
      "ingredients": [
        "300 g arroz",
        "100 g queso azul",
        "100 g queso fresco",
        "200 cc nata líquida",
        "50 g mantequilla",
        "500ml caldo pollo",
        "1 vasito vino blanco",
        "100 g queso parmesano sin rallar",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Primero ponemos en una cazuela el arroz a rehogar con la mantequilla y el vino blanco. Damos unas vueltas hasta que el vino se evapore, y entonces cubrimos con la mitad del caldo de pollo, dejándolo cocer. Vamos añadiendo el resto del caldo a medida que avanza la cocción.",
        "En una cazuela aparte, deshacemos el queso azul junto a la nata. Mientras, cortamos el queso fresco en taquitos y lo vamos agregando.",
        "A mitad de la cocción del arroz aproximadamente, incorporamos la mezcla de quesos a la cazuela del arroz y removemos hasta que el arroz esté en su punto caldoso.",
        "Servimos muy caliente, con escamas finitas de queso parmesano por encima."
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458tqjlm-m.webp",
      "nutrition": null
    },
    {
      "id": "d458su90d",
      "name": "Spanish Rice Mold with Tuna and Salad",
      "url": "http://www.recetasdiarias.com/recetas/arroz/pastel-de-arroz/",
      "ingredients": [
        "1 cup (250g) long-grain rice",
        "2 cans (about 200g each) tuna in oil, drained and flaked",
        "1 1/2 cups (300g) tomato sauce",
        "1/2 cup (100g) mayonnaise",
        "200g mixed salad greens",
        "1 medium tomato, diced",
        "2 tablespoons olive oil",
        "2 tablespoons red wine vinegar",
        "Salt to taste"
      ],
      "directions": [
        "Step 1: Cook the rice according to package directions in salted water. Drain and let it cool completely.",
        "Step 2: In a bowl, combine the flaked tuna and tomato sauce.",
        "Step 3: Prepare the salad by combining the mixed greens and diced tomato. Dress with olive oil, red wine vinegar, and salt.",
        "Step 4: In a mold or bowl, press half of the cooked rice firmly into the bottom. Layer the tuna and tomato sauce mixture on top of the rice, followed by the remaining rice, pressing down gently.",
        "Step 5: Carefully invert the rice mold onto a serving platter. Spread the mayonnaise over the top of the molded rice and arrange the dressed salad around the base.",
        "Step 6: Serve immediately or chill slightly before serving."
      ],
      "duration": "30 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458su90d-m.webp",
      "nutrition": {
        "calories": "350 per serving",
        "protein": "20 grams per serving",
        "carbs": "35 grams per serving",
        "fat": "15 grams per serving",
        "fiber": "3 grams per serving",
        "sugar": "5 grams per serving",
        "sodium": "400mg per serving"
      },
      "ai_enhanced": true,
      "image_prompt": "Professional food photography of Spanish Rice Mold with Tuna and Salad on a white plate with garnish, high-resolution, studio lighting, shallow depth of field, soft natural lighting, rich colors and textures",
      "image_filepath": "recipe_d458su90d/main_image",
      "video_script": {
        "title": "Spanish Rice Mold with Tuna and Salad",
        "description": "A refreshing and easy-to-make Spanish rice mold with tuna and a vibrant salad. Perfect for a light lunch or a summer picnic!",
        "scenes": [
          {
            "scene_number": 1,
            "duration": 5,
            "image_prompt": "Close-up shot of the finished Spanish Rice Mold, garnished with fresh parsley, on a serving platter with the colorful salad arranged around it. Focus on the textures and vibrant colors of the dish.",
            "text": "Spanish Rice Mold",
            "voice_over": "Looking for a refreshing and flavorful meal? Try this Spanish Rice Mold with Tuna and Salad! It's easy to make and perfect for any occasion.",
            "scene_image_filename": "recipe_d458su90d/scene_1_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458su90d-s.webp"
          },
          {
            "scene_number": 2,
            "duration": 5,
            "image_prompt": "Overhead shot of all the ingredients neatly arranged on a table. Group related ingredients together: rice, canned tuna, tomato sauce; mayonnaise; mixed greens, tomato, olive oil, red wine vinegar.",
            "text": "Ingredients",
            "voice_over": "Here's what you'll need: long-grain rice, canned tuna in oil, tomato sauce, mayonnaise, mixed salad greens, a fresh tomato, olive oil, red wine vinegar, and salt.",
            "scene_image_filename": "recipe_d458su90d/scene_2_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458su90d-s.webp"
          },
          {
            "scene_number": 3,
            "duration": 5,
            "image_prompt": "Close-up of a pot of rice cooking on the stovetop. Steam rising from the pot.",
            "text": "Cook the Rice",
            "voice_over": "First, cook one cup of long-grain rice according to package directions in salted water. This usually takes about 15-20 minutes.  Once cooked, drain the rice and let it cool completely.",
            "scene_image_filename": "recipe_d458su90d/scene_3_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458su90d-s.webp"
          },
          {
            "scene_number": 4,
            "duration": 4,
            "image_prompt": "A bowl with flaked tuna and tomato sauce being mixed together.",
            "text": "Tuna Mixture",
            "voice_over": "While the rice is cooling, combine the drained and flaked tuna with one and a half cups of tomato sauce in a bowl. Mix well.",
            "scene_image_filename": "recipe_d458su90d/scene_4_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458su90d-s.webp"
          },
          {
            "scene_number": 5,
            "duration": 4,
            "image_prompt": "A bowl of mixed greens and diced tomatoes being tossed with olive oil, red wine vinegar and salt.",
            "text": "Prepare the Salad",
            "voice_over": "In a separate bowl, prepare the salad by combining the mixed greens and diced tomato. Dress it with olive oil, red wine vinegar, and salt to taste.",
            "scene_image_filename": "recipe_d458su90d/scene_5_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458su90d-s.webp"
          },
          {
            "scene_number": 6,
            "duration": 5,
            "image_prompt": "A mold being filled with half of the cooked rice, pressed down firmly, followed by the tuna mixture, and finally topped with the remaining rice.",
            "text": "Layer the Mold",
            "voice_over": "Now, in a mold or bowl, press half of the cooked rice firmly into the bottom. Layer the tuna and tomato sauce mixture on top of the rice, followed by the remaining rice, pressing down gently.",
            "scene_image_filename": "recipe_d458su90d/scene_6_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458su90d-s.webp"
          },
          {
            "scene_number": 7,
            "duration": 5,
            "image_prompt": "The rice mold being carefully inverted onto a serving platter.",
            "text": "Invert the Mold",
            "voice_over": "Carefully invert the rice mold onto a serving platter.",
            "scene_image_filename": "recipe_d458su90d/scene_7_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458su90d-s.webp"
          },
          {
            "scene_number": 8,
            "duration": 4,
            "image_prompt": "Mayonnaise being spread over the inverted rice mold and the dressed salad being arranged around the base.",
            "text": "Final Touches",
            "voice_over": "Spread half a cup of mayonnaise over the top of the molded rice. Arrange the dressed salad around the base of the mold.",
            "scene_image_filename": "recipe_d458su90d/scene_8_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458su90d-s.webp"
          },
          {
            "scene_number": 9,
            "duration": 6,
            "image_prompt": "The finished Spanish Rice Mold with Tuna and Salad on a serving platter, garnished with fresh parsley. A few serving utensils are placed next to the platter.",
            "text": "Serve and Enjoy!",
            "voice_over": "Your Spanish Rice Mold with Tuna and Salad is ready! Serve immediately or chill slightly before serving. This dish is approximately 350 calories per serving, with 20 grams of protein, 35 grams of carbs, and 15 grams of fat.",
            "scene_image_filename": "recipe_d458su90d/scene_9_placeholder",
            "original_image_url": "http://recipecdn.cookbookrecipes.in/d458su90d-s.webp"
          }
        ]
      },
      "preparation_time_minutes": 20,
      "cooking_time_minutes": 25,
      "total_time_minutes": 45,
      "difficulty_level": "Easy",
      "meal_type": [
        "Lunch",
        "Dinner"
      ],
      "cuisine_type": "Spanish",
      "dietary_tags": [],
      "ingredient_tags": [
        "Rice",
        "Tuna",
        "Tomato",
        "Mayonnaise",
        "Salad Greens"
      ],
      "occasion_tags": [
        "Everyday",
        "Potluck",
        "Picnic"
      ],
      "cooking_tips": [
        "If the rice sticks to the mold, lightly grease the inside of the mold with olive oil before adding the rice.",
        "For a richer flavor, use good quality tuna packed in olive oil."
      ],
      "image_url": "https://raw.githubusercontent.com/hicutequeen/recipe-images/main/images/rice/recipe_d458su90d/d458su90d_main_image.jpg"
    },
    {
      "id": "d458spjs1",
      "name": "Arroz con leche de soja y pasas",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-con-leche-de-soja-y-pasas/",
      "ingredients": [
        "200 gr de arroz",
        "1 varita de canela",
        "3 clavos",
        "3 cardamomos",
        "1 litro de leche de soja",
        "Canela para espolvorear",
        "Pasas sultanas",
        "50 gr d fructosa",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Ante todo ponemos las pasas a remojar en un poco de agua mientras preparamos la receta.",
        "Mientras tanto ponemos agua a cocer y cuando rompa hervir echamos el arroz así soltará todo el almidón antes de echarle en la leche, dejamos cociendo unos 10 minutos aproximadamente.",
        "Escurrimos y reservamos.",
        "Seguidamente ponemos la leche de soja al fuego junto con la ramita de canela, los clavos, los cardamomos y la fructosa. Cuando comience a hervir agregamos el arroz, bajamos el fuego y dejamos cociendo poco a poco lentamente durante otros 10-15 minutos más.",
        "Asegúrate que no se espese demasiado pues debe quedar más bien cremoso, seguidamente añadimos las pasas préviamente escurridas y finalmente mezclamos bien.",
        "Servimos en copas antes de que espese y como sugerencia de presentación espolvoreamos el arroz con canela y esperamos que bien frío antes de comer.",
        "Foto de La dieta mediterránea de nuestra familia"
      ],
      "duration": "40 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458spjs1-m.webp",
      "nutrition": null
    },
    {
      "id": "d458svj71",
      "name": "Arroz del campo",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-del-campo/",
      "ingredients": [
        "300g de arroz",
        "600ml de caldo de pollo",
        "1 pechuga de pollo cortada en cubos",
        "1 cebolla grande",
        "1 pimiento rojo",
        "2 dientes de ajo",
        "20 aceitunas",
        "Alcaparras al gusto",
        "50 gramos de uvas pasas",
        "1 zanahoria grande en cubitos",
        "100 gramos de guisantes congelados",
        "Azafrán al gusto",
        "Sal al gusto",
        "Aceite de oliva",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Cortar la cebolla, el pimentón y los dientes de ajo, sofreírlos en el aceite ya caliente, incorporar la pechuga de pollo, el azafrán y la sal y dorar hasta que agarre buen color.",
        "Agregar la zanahoria, las aceitunas, las pasas, los guisantes y las alcaparras y seguir sofriendo un rato para que los sabores se mezclen y se integren, luego colocaremos el arroz y tambien lo dejaremos sofreír un rato, posteriormente agregar caldo de pollo caliente que será el doble de la medida del arroz, dejar que hierva y en ese momento bajar el fuego y dejar cocer por 20 minutos o hasta que el arroz esté al dente.",
        "Una vez servido en el arroz podemos agregarle un chorrito de aceite de oliva."
      ],
      "duration": "35 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458svj71-m.webp",
      "nutrition": null
    },
    {
      "id": "d458sskp0",
      "name": "Bolitas de arroz con salmón",
      "url": "http://www.recetasdiarias.com/recetas/arroz/bolitas-de-arroz-con-salmon/",
      "ingredients": [
        "¼Kg. de arroz",
        "Agua para hacer el arroz",
        "2 Cucharaditas de semillas de sésamo negro",
        "2 Cucharaditas de semillas de sésamo blanco.",
        "50gr. de salmón ahumado picadito",
        "1 Cebolla",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Ésta podría ser considerada una receta japonesa, pero he cambiado el salmón crudo por ahumado y el jengibre encurtido por jengibre en polvo y de esta forma he conseguido que guste a toda la familia.",
        "Lavar el arroz hasta que el agua salga transparente. Pondremos el arroz a herbir, para ello ponemos el doble de agua que de arroz, cómo unos 20 minutos. Es mejor que el arroz nos quede “pasadito”. Lo dejamos enfriar.",
        "Ponemos las semillas de sésamo, el negro y el blanco, en una sartén, sin aceite, hasta que empiecen a chasquear.",
        "Para finalizar rebozaremos las bolitas con la mezcla de los dos sésamos.",
        "Para darle el toque oriental, una vez en la mesa, pondremos unos pequeños platitos con salsa de soja para ir mojando las bolitas.",
        "Para hacer las bolitas de arroz, nos humedeceremos las manos, cogeremos una pequeña cantidad (un poquito más que una nuez) y haremos la bolita a la que haremos un huequecito en el centro para poner  una pequeña cucharadita de salmón picado y la cebolla picada."
      ],
      "duration": "50 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458sskp0-m.webp",
      "nutrition": null
    },
    {
      "id": "d458sokmq",
      "name": "Paella extremeña",
      "url": "http://www.recetasdiarias.com/recetas/arroz/paella-extremena/",
      "ingredients": [
        "4 vasos de arroz",
        "300 g. de costillas de cerdo ibérico",
        "1 cebolla",
        "1 pimiento verde",
        "1 tomate maduro",
        "1 diente de ajo",
        "1/2 l. de vino blanco",
        "1 pastilla de caldo de verduras",
        "Una pizca de azafrán",
        "Una pizca de laurel molido",
        "1/2 cucharada de pimentón de la Vera",
        "Aceite de oliva",
        "Agua",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Fran del blog de cocina Qué Rico nos cuenta que teniendo en cuenta que Badajoz es el segundo productor de arroz de Europa, tan sólo superado por la Comunidad Valenciana, aprovecha para cedernos una genial receta de paella con productos de la tierra extremeña.",
        "Primeramente en una paella ponemos suficiente aceite de oliva para cubrir todo el fondo y ponemos a calentar a fuego medio.",
        "Seguidamente picamos el pimiento, la cebolla y el ajo muy finos. Pochamos el pimiento y cuando esté hecho añadimos la cebolla, el tomate rallado, el ajo, las costillas, el azafrán y el laurel.",
        "Rehogamos todo muy bien para que la carne se vaya haciendo y añadimos la pastilla de caldo y el vino. Dejamos hervir a fuego fuerte unos minutos y volvemos a bajar el fuego. Añadimos el arroz y lo rehogamos para que se mezcle con el resto de ingredientes.",
        "Añadimos la cantidad necesaria de agua caliente con el pimentón, yo le he puesto en proporción 1 y 1/2 de agua por 1 de arroz, aunque podéis ponerle un poco más. Es el momento de probar el caldo y rectificar de sal. Dejamos que se haga el arroz unos 20 minutos, hasta que veamos que ha absorbido todo el agua.",
        "Finalmente retiramos del fuego y lo tapamos dejándolo reposar unos minutos. Servir la paella extremeña preferiblemente recién hecha.",
        "Una sugerencia de Fran: Podemos sustituir las costillas de cerdo por costillas adobadas, en tal caso prescindiremos del pimentón y de la sal si queremos."
      ],
      "duration": "60 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458sokmq-m.webp",
      "nutrition": null
    },
    {
      "id": "d458sr5gf",
      "name": "Arroz a la cazuela con pollo",
      "url": "http://www.recetasdiarias.com/recetas/arroz/arroz-a-la-cazuela-con-pollo/",
      "ingredients": [
        "1 pollo cortado pequeño",
        "50 g de jamón en tiritas",
        "1 cebolla",
        "3 alcachofas",
        "100 g de guisantes",
        "2 tomates maduros",
        "½ pimiento verde",
        "1 taza de arroz por persona",
        "Caldo",
        "Ajo y perejil",
        "Sal y pimienta",
        "Aceite de oliva",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Poner a cocer en una cazuela con aceite el pollo y el jamón. Una vez cocidos, añadir la cebolla trinchada y el pimiento y, cuando la cebolla quede transparente, el tomate rallado y finalmente, las alcachofas y los guisantes. Salarlo todo. Una vez bien ahogado, añadir caldo agua (dos partes y medio de agua o caldo por cada una de arroz) y dejarlo que se reduzca un poco. Echar el arroz y, a media cocción, echar por encima una picada de ajo, perejil, y un poco de pimienta, y entonces rectificarlo de sal.",
        "El tiempo de cocción del arroz acostumbra a ser de unos 18 minutos a fuego vivo y después a fuego lento. Pero depende de la clase de arroz, del agua y también del fuego, para cosa hay que estar muy pendiente del proceso y sacudir la cazuela de tanto en tanto.",
        "SUGERENCIAS",
        "El arroz a la cazuela siempre es mejor recién hecho. Por eso hemos de calcular la hora exacta para comerlo. El arroz esta en su punto cuando queda mas bien seco que caldoso.",
        "En lugar de jamón podemos poner costilla de cerdo cortado pequeño, y si no tenemos alcachofas, pueden ponerse dados de calabacín o puntas de espárrago."
      ],
      "duration": "45 minutes ",
      "serves": "6",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d458sr5gf-m.webp",
      "nutrition": null
    }
  ]
}