{
  "recipes": [
    {
      "id": "fks1kribjha0s6r",
      "name": "Rasmalai ",
      "url": "https://www.vegrecipesofindia.com/rasmalai-recipe/",
      "ingredients": [
        "12 to 15 Rasgulla – homemade or store brought ones",
        "1 litre whole milk",
        "4 to 5 tablespoons sugar or add as required",
        "10 to 12 almonds unsalted – blanched",
        "10 to 12 pistachios unsalted – blanched",
        "½ cup water for blanching the almonds and pistachios",
        "½ teaspoon green cardamom powder",
        "1 to 2 teaspoons rose water or kewra water (pandanus water)",
        "8 to 10 saffron strands",
        "Few saffron strands – for garnish",
        "{\"cal\":\"148\",\"fat\":\"10\",\"carb\":\"10\",\"prot\":\"5\"}"
      ],
      "directions": [
        "To make rasmalai you will need 12 to 15 rasgulla. Either you can buy them from stores or make them at home. ",
        "Boil ½ cup water. Then add almonds and pistachios. Cover and keep aside for 30 to 40 minutes.",
        "Later peel the almonds, pistachios and slice them finely. Set aside.",
        "When the almonds are blanching, take milk in a thick bottomed pan or kadai.",
        "Bring the milk to a boil on medium heat stirring at intervals.",
        "Whilst the milk is coming to a boil, take 2 tablespoons of milk from the pan in a small bowl.",
        "Let this milk become warm. Add crushed saffron strands. Stir and keep aside.",
        "Once the milk has come to a boil, then lower the heat and simmer the milk. Collect the floating clotted cream (malai) on the sides. Continue to cook this way till the milk is reduced to half.",
        "Keep on collecting the cream which floats on the top and move it to the sides. Also keep on stirring the milk at intervals so that the milk does not get scorched at the bottom.",
        "Add sugar and stir well so that the sugar dissolves.",
        "Then add cardamom powder.",
        "Add the blanched and sliced almonds and pistachios. Reserve a few almonds and pistachios for garnishing.",
        "Also add the saffron infused milk.",
        "Stir again. Keep simmering the reduced milk at a low heat.",
        "Take each rasgulla and with a spatula and apply pressure, so the excess sugar syrup is removed from it.",
        "You can also press and squeeze each rasgulla in your palms. Be gentle and don't apply too much of pressure. As then the rasgullas will break. Repeat with all the rasgulla balls.",
        "Now place the rasgulla in the simmering milk and simmer for 2 to 3 minutes on a low heat.",
        "Switch off the heat and then add rose water or kewra water (pandanus water).",
        "Stir gently. Cover and let the rasmalai come to room temperature. Then chill in a covered container or bowl.",
        "Serve garnished with blanched, sliced almonds or pistachios that were kept aside and a few saffron strands.",
        "You can also serve rasmalai warm or at room temperature.",
        ""
      ],
      "duration": "50 m ",
      "serves": "6",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fks1kribjha0s6r-m.webp",
      "nutrition": null
    },
    {
      "id": "fksd3521s8h6",
      "name": "Rasmalai Recipe",
      "url": "http://www.sharmispassions.com/2011/01/rasmalai-with-homemade-rasgullas.html",
      "ingredients": [
        "Rasgullas - 12 to 15",
        "Milk - 3 cups",
        "Condensed milk - 3 tbsp",
        "Ghee - 1 tsp",
        "Sugar - 1/2 cup",
        "Chopped Nuts(pista,cashews and badam) - 3 tbsp",
        "Saffron - 3 to 4 strands",
        "Cardamom powder - 1/2 tsp (optional)",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Take a wide heavy bottomed vessel, grease it with little ghee and add condensed milk + milk. Bring to a boil and reduce to medium flame. Keep stirring till the milk starts thickening and reduced to half.Meanwhile take 2 tbsp of warm milk, add saffron strands and crush it well, keep aside.",
        "Now add the saffron milk to the boiling and keep stirring. Then add the sugar  and keep stirring. The mixture is called rabri and it tastes divine by itself :)",
        "Keep in sim and stir it till it reduces in volume.Fry the nuts in ghee and add it to the rabri and mix well. Add cardamom powder and give a quick mix.",
        "Now finally add the rasgullas and let it cook in low flame for 5mins till the rasgullas absorb the milk.Switch off , cool completely and then chill it. Rasmalai is ready now. Serve chilled!"
      ],
      "duration": "20 minutes ",
      "serves": "2",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fksd3521s8h6-m.webp",
      "nutrition": null
    },
    {
      "id": "fksd3521nuve",
      "name": "Bread Rasmalai ",
      "url": "http://www.sharmispassions.com/2012/11/bread-rasmalai-easy-diwali-recipes.html",
      "ingredients": [
        "Bread - 4 slices",
        "Milk - 2 cups",
        "Ghee - 1 tsp",
        "Condensed milk - 2 tbsp",
        "Sugar - 1/4 cup",
        "Mixed Nuts(pista,cashews and badam)-2 tbsp chopped",
        "Saffron - 4 strands",
        "Cardamom powder - 1/4 tsp (optional)",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Take a wide heavy bottomed vessel, grease it with little ghee and add condensed milk + milk. Bring to a boil and reduce to medium flame. Keep stirring till the milk starts thickening and reduced to half.Meanwhile take 2 tbsp of warm milk, add saffron strands and crush it well, keep aside.",
        "Now add the saffron milk to the boiling and keep stirring. Then add the sugar  and keep stirring. The mixture is called rabri and it tastes divine by itself :)",
        "Keep in sim and stir it till it reduces in volume.Fry the nuts in ghee and add it to the rabri and mix well. Add cardamom powder and give a quick mix.",
        "Once the rabri is thick switch it off and refrigerate it. Meanwhile take bread slices, trim the corners. Take a small lid and press it gently on the bread slices into small circles. At the time of serving take a bowl add the rabri and drop the bread rounds."
      ],
      "duration": "30 minutes ",
      "serves": "2",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fksd3521nuve-m.webp",
      "nutrition": null
    },
    {
      "id": "d3685toih",
      "name": "Candied Kumquat in Kumquat Syrup",
      "url": "http://chefdehome.com/Recipes/141/candied-kumquat-in-kumquat-syrup",
      "ingredients": [
        "200  Grams  Kumquat  (about a handful)",
        "1/2  Cup  Sugar  ",
        "1/4  tsp  Salt  ",
        "1  tbsp  Lemon  (juice)",
        "1  Cup  Water  ",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "1. Slice each Kumquat into 3 round disc slices.",
        "2. In a heavy bottom stainless steel pan, add kumquat slices, water, bring to boil, reduce heat to simmer. Now add sugar, lemon juice, salt. Let it cook till kumquats are tender, syrup is thick and has nice orange color (about 20). Remove the syrup in a glass container and let it cool down. Serve it chilled or at room temperature over a slice of cheese cake or my favorite Rasmalai.Additional Notes  I usually do not remove seeds, but if you like you can remove seeds."
      ],
      "duration": "30 minutes ",
      "serves": 1,
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d3685toih-m.webp",
      "nutrition": null
    }
  ]
}