{
  "recipes": [
    {
      "id": "fks12nolf0hl0v9",
      "name": "Rasgulla ",
      "url": "https://www.vegrecipesofindia.com/rasgulla-recipe-how-to-make-rasgullas/",
      "ingredients": [
        "1 litre whole milk",
        "2 to 3 tablespoons lemon juice or add as required",
        "2 cups sugar or raw sugar",
        "1 litre water",
        "1 tablespoon milk – optional",
        "1 teaspoon sooji (rava or cream of wheat) or all purpose flour or cornstarch",
        "1 to 2 tablespoon rose water or kewra water or ½ teaspoon cardamom powder",
        "{\"cal\":\"91\",\"fat\":\"1\",\"carb\":\"23\",\"prot\":\"1\"}"
      ],
      "directions": [
        "Take milk in a pan and keep it to boil on a low to medium heat. ",
        "I used organic cow milk which does not have much fat. If you use buffalo milk, it has too much of fat and makes a thick layer of malai/cream floating on top. You have to remove the thick layer of malai, before you proceed with the making of chenna.",
        "So when the milk is heating up, line a strainer or bowl with a cheese cloth or muslin.",
        "Keep on stirring the milk at intervals so that the froth is not formed on top and the base does not get browned or the milk solids get stuck to the bottom.",
        "When the milk comes to a boil, then reduce the heat to its lowest. Add 1 to 3 tablespoons lemon juice. First add 1 tablespoon lemon juice and stir. If the milk has not curdled completely, then add 1 tablespoon more. Keep the lemon juice handy with you.",
        "Depending on the quality of milk, you may need to add 1 to 3 tablespoons of lemon juice. Stir after adding the lemon juice. Sometimes I have added 1 tablespoon lemon juice and the milk has curdled and sometimes I needed to add 3 tablespoons too. Vinegar also can be added instead of lemon juice. ",
        "Another option is curd/yogurt. Add 4 to 5 tablespoons of yogurt or more if required. With yogurt you don't need to rinse the chenna in water later.",
        "As soon as the milk curdles, switch off the heat. The milk should curdle completely with the green watery whey. If the milk does not curdle, then add ½ to 1 tablespoon of lemon juice more.",
        "Now pour the curdled milk in the cheese cloth/muslin lined strainer or bowl.",
        "Gather the muslin from the sides and rinse the chenna or coagulated milk very well in running water. This brings down the temperature of chenna as well as removes the lemony flavor and tangy taste from the chenna.",
        "Now squeeze the muslin with your hands very well, so that excess water is drained from the chenna. Remember there should not be excess water or moisture in the chenna as then the rasgulla will break when cooking.",
        "Place a heavy weight on the chenna for 7 to 8 minutes. You can also hang the chenna for about 30 minutes.",
        "After 7 to 8 minutes, remove the cheesecloth from the chenna. Note that the chenna should not have too much moisture nor be too dry.",
        "Add 1 teaspoon sooji or rava or semolina. You can also add all purpose flour (maida). Adding either of them helps to bind the mixture. For a gluten-free option, add cornstarch instead of semolina or all purpose flour.",
        "First mix the sooji with chenna and then begin to knead.",
        "With the heels of your palms mash the chenna and knead. Keep on collecting the chenna from the sides and continue to mash and knead. ",
        "This kneading process is very important and also decides the texture of chenna. When you feel your palms becoming a bit greasy, its time to stop. Just a bit of greasiness is required.",
        "Avoid kneading to an extent where the whole chenna becomes greasy. I kneaded for about 10 minutes as I have very light hands. So depending on the quality of chenna and the pressure you apply while kneading, you can take more or less time. Note that the chenna should just begin to get greasy.",
        "Knead to a smooth ball of chenna.",
        "Now pinch small portions from the chenna and roll them between your palms to a smooth round ball.",
        "Prepare all small balls this way. Cover all the chenna balls with a moist muslin or kitchen towel and keep aside.",
        "In a large pan, take 2 cups sugar and 4 cups water.",
        "You have to use a large pot or pan so that there is enough space for the rasgulla to cook and increase in size. You can also use a pressure cooker. I used a pot measuring 8.5 inches in diameter and 4.5 in height – a 3.4 litre stainless steel pot.",
        "Keep this pan on stovetop and heat the sugar solution. Stir so that the sugar dissolves. I cooked kneaded the chenna and cooked the sugar syrup simultaneously. You can also do this way.",
        "Add 1 tbsp milk and stir. Adding milk helps in removing impurities. If there are no impurities then you don’t need to add milk and directly proceed to step 6",
        "Once the sugar solution becomes hot, the impurities begin to float on the top. You can either remove it with a spoon. Or strain the impurities in a cheese cloth/muslin lined strainer.",
        "Now from the purified sugar solution, reserve ½ cup in a cup or mug. This ½ cup of sugar solution we will be adding to the cooking rasgulla.",
        "Reserve another 1 cup of the sugar solution in a serving bowl.",
        "The rest of the 2.5 cups of sugar solution you add it back to the same large pot and bring it to a boil on a medium high heat.",
        "Slid the rasgulla gently into the sugar solution.",
        "Once all the rasgulla have been added to the sugar solution, shake the pot. Don't stir the rasgulla with a spoon. Just gently shake the pot.",
        "Cover immediately with a lid and let them cook. Keep the heat to a medium or medium high.",
        "After 4 minutes, open the lid and add ¼ cup of the reserved sugar solution. Shake the pan. Adding this reserved sugar solution ensures that the temperature and consistency of the sugar solution is maintained and the sugar does not cook to its thread consistencies.",
        "Cover again and continue to cook.",
        "After 4 minutes, again add ¼ cup of the reserved sugar solution. Cover and again cook for 2 minutes. I cooked for 10 minutes. The timing will vary depending on the thickness & quality of pan, the depth of the pan and heat intensity.",
        "There are two ways. First place the rasgulla in a bowl or cup of water. If the rasgulla sinks to the bottom its cooked. ",
        "Second method is to press a small portion of the rasgulla with your finger. If the pressed portion bounces back to its original shape, its cooked",
        "Once they are cooked, switch off the heat and keep the pan down on the countertop.",
        "Now take each rasgulla with a spoon and place it in the bowl containing the 1 cup of sugar solution. Cover and keep aside.",
        "Let the sugar solution in which the rasgulla were cooked, become warm. Then add this to the serving bowl containing the rasgulla.",
        "Once the whole mixture has cooled down, add 1 to 2 tablelsoons rose water. ",
        "If you don't have rose water you can also kewra water (pandanus extract) or ½ tsp cardamom powder. Stir gently and allow them to be soaked in the sugar syrup for 30 minutes.",
        "You can serve the rasgulla now or refrigerate them and serve later cold or chilled.",
        "When serving place the required amount of rasgulla in each serving bowl. Pour a few tablespoons of the sugar syrup in each serving bowl. If you prefer garnish rasgulla with some slivered almonds or pistachios.",
        "Keep them covered with the sugar syrup in an air-tight container. They keeps well for about a week in the refrigerator. Do not store them at room temperature.",
        ""
      ],
      "duration": "30 m ",
      "serves": "18",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fks12nolf0hl0v9-m.webp",
      "nutrition": null
    },
    {
      "id": "fks20lin1ccq9s8",
      "name": "Rasgullas",
      "url": "https://www.allrecipes.com/recipe/210639/rasgullas/",
      "ingredients": [
        " 6 cups milk ",
        " 3 tablespoons fresh lime juice ",
        " 2 ½ cups white sugar ",
        " 6 cups water ",
        " 1 teaspoon ground cardamom ",
        "{\"cal\":\"134\",\"fat\":\"2\",\"carb\":\"29\",\"prot\":\"2\"}"
      ],
      "directions": [
        "Bring the milk to a boil in a heavy-bottomed pan till it starts foaming immediately add the lime juice and stir. It will curdle right away. You should see the milk solids (chenna) separate from the whey. Pour into a colander lined with cheesecloth rinse the chenna with cold water to get rid of the lime juice. Allow the water to drain completely.",
        "Gather the muslin cloth edges like a parcel and express as much water as possible what you now have is soft paneer. Turn the paneer onto a rolling mat or other smooth surface. Knead the paneer well to make a smooth paste. Roll into a ball and divide into 20 equal portions.",
        "Bring the water to a boil in a pressure cooker stir the sugar into the boiling water until dissolved.",
        "Roll each portion of paneer into a smooth ball between your palms, making sure there are no cracks gently drop the balls into the hot syrup. Secure the lid onto the pressure cooker and bring to pressure. Reduce heat to medium-low and pressure cook for 6 minutes.",
        "Release the pressure from the cooker while running under water remove the lid. The rasgullas should be floating on the syrup and have expanded 2 or 3 times in size. Pour the rasgullas and syrup into a bowl. Gently stir the cardamom into the mixture. Refrigerate to chill completely before serving cold.\r\n"
      ],
      "duration": "1 h 50 m",
      "serves": "20",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fks20lin1ccq9s8-m.webp",
      "nutrition": null
    },
    {
      "id": "fks1cgcu416d8eo",
      "name": "Classic Rasgulla",
      "url": "https://www.thespruceeats.com/rasgulla-indian-dessert-1957839",
      "ingredients": [
        "8 1/2 cups whole milk",
        "2 to 3 tablespoons lime juice",
        "5 teaspoons flour",
        "2 cups sugar",
        "4 cups water",
        "2 to 3 tablespoons rose water",
        "{\"cal\":\"242\",\"fat\":\"6\",\"carb\":\"43\",\"prot\":\"6\"}"
      ],
      "directions": [
        "Gather the ingredients.",
        "Bring the milk to a boil over a medium flame. Stir it occasionally to ensure the milk does not burn.",
        "When the milk begins to boil, add the lime juice and mix well.",
        "When the curds begin to separate from the milk, turn off the heat and leave the milk aside for 10 minutes to let the curdling process finish.",
        "Strain the cheese and wash it well under running water. This will remove all the lime juice from it.",
        "Now put the cheese in a cheesecloth and hang it for 1 hour over a bowl to completely drain all the liquid from it.",
        "Put the drained cheese into a mixing bowl and begin to knead it.",
        "Continue until all of the lumps are removed and the cheese is absolutely smooth. When this happens the cheese will begin to release its fat and your hands will feel greasy. ",
        "The success of your rasgulla-making effort depends on how smoothly you knead the cheese, so give it your best shot!",
        "Now sprinkle the flour over the surface of the cheese and work it into the cheese to mix thoroughly.",
        "Mix the sugar and water in a pressure cooker and bring the mixture to a boil. Make sure the cooker is large enough to accommodate the finished rasgullas, as they will expand to double their size while cooking in the syrup.",
        "While the sugar syrup boils, divide the dough into small marble-sized balls and roll them between your palms till smooth.",
        "Gently add the balls to the sugar syrup.",
        "Cover the pressure cooker, add the cooker's weight, and wait for the first whistle. Once the first whistle blows, wait another 8 to 10 minutes and then turn off.",
        "Release the steam from the pressure cooker and allow the Rasgullas to cool completely before touching them. They will have expanded to almost double their original size and will be delicate when hot.",
        "When they are cool, pour the rose water on the rasgullas.",
        "Chill for a few hours before serving.\r\n"
      ],
      "duration": "1 hr 15 m",
      "serves": "12",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fks1cgcu416d8eo-m.webp",
      "nutrition": null
    },
    {
      "id": "fksd3521udlq",
      "name": "Rasgulla Recipe",
      "url": "http://www.sharmispassions.com/2011/01/rasgulla-mini-rasgulla-step-by-step.html",
      "ingredients": [
        "Milk - 1/2 litre",
        "Lemon Juice - 1.5 tbsp (or) Curd - 2 tbsp",
        "Water - 1 and 3/4 cups",
        "Icecubes - 4 to 5",
        "Sugar - 3/4 cup",
        "Cardamom powder- a generous pinch",
        "Pistachios - 3 to 4 chopped finely for garnishing",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Heat milk, bring it to boil and simmer it. Take 1.5 tbsp lime juice from a lemon and keep it ready.",
        "When milk starts boiling, add the lemon juice to the boiling milk and stir properly. Stir continuosly till the whey water clears and the milk curdles completely. Before adding icecubes you can take some whey water which can be reserved for future use which is what I did. Now switch off the stove, add ice cubes and allow it to melt completely.",
        "Take a muslin cloth and pour the curdled milk,filtering the whey water completely.Wash it well in running cold water to remove the lemon smell. Squeeze the excess water and hang it aside for 30mins without disturbing it.",
        "After 30mins, the paneer would be crumbly in texture. Now knead it well for 10mins. Once everything comes together to a smooth pilable dough, form them into smooth mini/normal lemon sized balls and keep aside. I made around 13-15 mini balls.",
        "Heat water in a wide bottomed vessel, then add sugar, cardamom powder and keep stirring till sugar dissolves completely. When the sugar syrup boils and starts bubbling, add the balls slowly one by one and simmer it for 3mins.The balls will go to the corner, move them to the middle. Keep in medium flame and close with a lid. Cook for 10mins opening the lid every 3-4 mins this is to ensure the vapour passes out not allowing the sugar syrup to ooze out. After 10 mins, the balls would be closely doubled in size."
      ],
      "duration": "25 minutes ",
      "serves": "12",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fksd3521udlq-m.webp",
      "nutrition": null
    },
    {
      "id": "fks1kribjha0s6r",
      "name": "Rasmalai ",
      "url": "https://www.vegrecipesofindia.com/rasmalai-recipe/",
      "ingredients": [
        "12 to 15 Rasgulla – homemade or store brought ones",
        "1 litre whole milk",
        "4 to 5 tablespoons sugar or add as required",
        "10 to 12 almonds unsalted – blanched",
        "10 to 12 pistachios unsalted – blanched",
        "½ cup water for blanching the almonds and pistachios",
        "½ teaspoon green cardamom powder",
        "1 to 2 teaspoons rose water or kewra water (pandanus water)",
        "8 to 10 saffron strands",
        "Few saffron strands – for garnish",
        "{\"cal\":\"148\",\"fat\":\"10\",\"carb\":\"10\",\"prot\":\"5\"}"
      ],
      "directions": [
        "To make rasmalai you will need 12 to 15 rasgulla. Either you can buy them from stores or make them at home. ",
        "Boil ½ cup water. Then add almonds and pistachios. Cover and keep aside for 30 to 40 minutes.",
        "Later peel the almonds, pistachios and slice them finely. Set aside.",
        "When the almonds are blanching, take milk in a thick bottomed pan or kadai.",
        "Bring the milk to a boil on medium heat stirring at intervals.",
        "Whilst the milk is coming to a boil, take 2 tablespoons of milk from the pan in a small bowl.",
        "Let this milk become warm. Add crushed saffron strands. Stir and keep aside.",
        "Once the milk has come to a boil, then lower the heat and simmer the milk. Collect the floating clotted cream (malai) on the sides. Continue to cook this way till the milk is reduced to half.",
        "Keep on collecting the cream which floats on the top and move it to the sides. Also keep on stirring the milk at intervals so that the milk does not get scorched at the bottom.",
        "Add sugar and stir well so that the sugar dissolves.",
        "Then add cardamom powder.",
        "Add the blanched and sliced almonds and pistachios. Reserve a few almonds and pistachios for garnishing.",
        "Also add the saffron infused milk.",
        "Stir again. Keep simmering the reduced milk at a low heat.",
        "Take each rasgulla and with a spatula and apply pressure, so the excess sugar syrup is removed from it.",
        "You can also press and squeeze each rasgulla in your palms. Be gentle and don't apply too much of pressure. As then the rasgullas will break. Repeat with all the rasgulla balls.",
        "Now place the rasgulla in the simmering milk and simmer for 2 to 3 minutes on a low heat.",
        "Switch off the heat and then add rose water or kewra water (pandanus water).",
        "Stir gently. Cover and let the rasmalai come to room temperature. Then chill in a covered container or bowl.",
        "Serve garnished with blanched, sliced almonds or pistachios that were kept aside and a few saffron strands.",
        "You can also serve rasmalai warm or at room temperature.",
        ""
      ],
      "duration": "50 m ",
      "serves": "6",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fks1kribjha0s6r-m.webp",
      "nutrition": null
    },
    {
      "id": "fksd3521s8h6",
      "name": "Rasmalai Recipe",
      "url": "http://www.sharmispassions.com/2011/01/rasmalai-with-homemade-rasgullas.html",
      "ingredients": [
        "Rasgullas - 12 to 15",
        "Milk - 3 cups",
        "Condensed milk - 3 tbsp",
        "Ghee - 1 tsp",
        "Sugar - 1/2 cup",
        "Chopped Nuts(pista,cashews and badam) - 3 tbsp",
        "Saffron - 3 to 4 strands",
        "Cardamom powder - 1/2 tsp (optional)",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Take a wide heavy bottomed vessel, grease it with little ghee and add condensed milk + milk. Bring to a boil and reduce to medium flame. Keep stirring till the milk starts thickening and reduced to half.Meanwhile take 2 tbsp of warm milk, add saffron strands and crush it well, keep aside.",
        "Now add the saffron milk to the boiling and keep stirring. Then add the sugar  and keep stirring. The mixture is called rabri and it tastes divine by itself :)",
        "Keep in sim and stir it till it reduces in volume.Fry the nuts in ghee and add it to the rabri and mix well. Add cardamom powder and give a quick mix.",
        "Now finally add the rasgullas and let it cook in low flame for 5mins till the rasgullas absorb the milk.Switch off , cool completely and then chill it. Rasmalai is ready now. Serve chilled!"
      ],
      "duration": "20 minutes ",
      "serves": "2",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fksd3521s8h6-m.webp",
      "nutrition": null
    }
  ]
}