{
  "recipes": [
    {
      "id": "fksd359v4l2g",
      "name": "Rajma Chawal",
      "url": "http://www.sharmispassions.com/2013/11/rajma-chawal-easy-rajma-recipe.html",
      "ingredients": [
        "Steamed Rice - 1 cup",
        "Rajma - 1/2 cup",
        "Big Onion - 1 small",
        "Tomato - 2 medium",
        "Ginger - 1 tsp finely chopped",
        "Red Chilli powder - 1 tsp",
        "Coriander powder - 3/4 tsp",
        "Amchur powder(Dried Mango powder) - 1/2 tsp",
        "Coriander Leaves - 3 tsp finely chopped",
        "Salt - to taste",
        "Oil - 3 tsp",
        "Jeera - 1/2 tsp",
        "Cinnamon - 1/4 inch piece",
        "Cloves - 2",
        "Green Chilli - 1 finely chopped",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Soak rajma in water overnight or atleast for 8 hrs. Drain and discard the water. Pressure cook with enough water for 4-5 whistles,dont drain water...Set aside.Puree the tomatoes without adding water.",
        "Keep the tomato paste aside.Heat a pressure cooker with oil - add the items listed under 'to temper' let it splutter then add ginger saute for for a second then add onions and fry till translucent.",
        "Then add tomato puree along with the spice powders and required salt.Let it boil till raw smell leaves.It will start thickening after few mins, simmer and cook.",
        "Add rajma along with cooked water and pressure cook on medium high flame for just 1 whistle.Once pressure releases,give a quick stir then garnish with coriander leaves and switch off.Add cooked rice and give a quick stir."
      ],
      "duration": "20 minutes ",
      "serves": "2",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fksd359v4l2g-m.webp",
      "nutrition": null
    },
    {
      "id": "fks2mp91tnnoum3",
      "name": "Rajma Masala ",
      "url": "https://www.vegrecipesofindia.com/rajma-masala-recipe-restaurant-style/",
      "ingredients": [
        "1 cup rajma – 200 grams (dried kidney beans), any variety",
        "3.5 to 4 cups water for pressure cooking",
        "Enough water for soaking rajma",
        "3 to 4 garlic cloves – medium-sized",
        "1 inch ginger",
        "1 to 2 green chillies or 1 to 2 Serrano peppers",
        "2 tablespoons Butter + 1 tablespoon oil or 3 tablespoons butter",
        "½ teaspoon cumin seeds",
        "¾ to 1 cup finely chopped onions or 150 grams onions or 1 large onion",
        "1 cup finely chopped tomatoes or 250 grams tomatoes or 3 medium or 2 large tomatoes",
        "1 teaspoon Coriander Powder (ground coriander)",
        "¼ to ½ teaspoon red chili powder or cayenne pepper or hot paprika",
        "¼ teaspoon turmeric powder (ground turmeric)",
        "1 pinch asafoetida (hing) – optional",
        "¼ to ½ teaspoon Garam Masala",
        "1.5 to 2 cups rajma stock (the water which was used to cook the beans) or fresh water",
        "Salt as required",
        "1 teaspoon crushed kasuri methi (dried fenugreek leaves) – optional",
        "2 to 3 tablespoons low fat cream or half and half or 1 tablespoon heavy whipping cream – optional",
        "1 to 2 tablespoons chopped coriander leaves – for garnish, optional",
        "{\"cal\":\"210\",\"fat\":\"7\",\"carb\":\"28\",\"prot\":\"9\"}"
      ],
      "directions": [
        "Rinse and soak the rajma (kidney beans) in enough water overnight or for 8 to 9 hours.",
        "Next day, discard the water and rinse the beans again in fresh water for a couple of times.",
        "Drain all the water.",
        "In a 3 litre pressure cooker, take both the soaked rajma and water.",
        "Pressure cook on a medium to high flame for 15 to 20 minutes.",
        "When the rajma is cooking, you can chop the onions, tomatoes etc.",
        "Crush the ginger, garlic and green chillies in a mortar-pestle to a fine or semi-fine texture. Set aside",
        "When the pressure settles down on its own, open the lid.",
        "Check if the rajma beans are cooked or not by taking a bite or pressing a few beans.",
        "If the beans are cooked well set aside or drain the beans.",
        "If the rajma are not cooked completely, then pressure cook again adding some water if required for some minutes.",
        "Heat oil + butter in another pot or pan on a low heat. Add cumin first and let them crackle & get browned.",
        "Then add onions and sauté them till they caramelized or golden browned on a medium-low to medium heat.",
        "Take care not to burn them as this will give bitter tones in the curry.",
        "Light browning the onions is also alright.",
        "Keep on stirring the onions while sauteing them, for uniform cooking and also so that they don't get burnt.",
        "Lower the heat and add the crushed ginger-garlic-chili paste. Stir and sauté for 5 to 10 seconds on a low flame until the raw aroma of the ginger and garlic goes away.",
        "Add the tomatoes. Sauté for 2 to 3 minutes on medium-low to medium heat until the tomatoes become soft.",
        "Add all the spice powders one by one – turmeric powder, red chili powder, coriander powder, asafoetida (hing) and garam masala powder.",
        "On a medium-low heat or medium heat stirring often sauté the whole masala mixture until the fat starts leaving the sides of the masala base. This masala paste will become glossy, thicken and leave the sides of the pan.",
        "Using a slotted spoon or a strainer remove the beans and add them to the masala.",
        "Stir and sauté for a minute.",
        "Add 2 cups of water. If you prefer you can also add the cooked rajma stock instead of fresh water.",
        "Add salt as required and stir the whole curry mixture.",
        "On a low heat to medium-low heat simmer without a lid for 10 to 12 minutes or more time until the curry thickens slightly. It should not be watery.",
        "Mash a few rajma beans with the spoon. This helps to thicken the curry.",
        "When the rajma masala has thickened and comes to the right consistency which is neither too thick nor thin, then add the crushed dried fenugreek leaves (kasuri methi) and cream. You can skip the cream if you prefer.",
        "Stir and simmer for 30 seconds to 1 minute. Switch off the heat.",
        "Serve rajma masala with steamed basmati rice, jeera rice or naan or roti or paratha. You can garnish with some coriander leaves when serving.",
        "The rajma chawal combo makes for a filling, heathy and a comforting meal.",
        ""
      ],
      "duration": "9 hr 45 m",
      "serves": "5",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fks2mp91tnnoum3-m.webp",
      "nutrition": null
    },
    {
      "id": "fksd352qasma",
      "name": "Rajma Paratha ",
      "url": "http://www.sharmispassions.com/2012/06/rajma-paratha-recipe.html",
      "ingredients": [
        "Wheat Flour - 1.5 cups",
        "Salt - to taste",
        "Oil - toast",
        "Rajma(Kidney Bean) - 1/2 cup",
        "Cloves - 1 (optional)",
        "Jeera - 1 tsp",
        "Onion - 1",
        "Ginger Garlic paste - 1/2 tsp",
        "Turmeric powder - a generous pinch",
        "Red chilli powder - 1/2 tsp",
        "Garam masala powder - 1/2 tsp",
        "Coriander leaves - 1/2 tbsp finely chopped",
        "Oil - 1 tsp",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "In a wide bowl add wheat flour salt and required water , mix well and knead it form a soft dough as chapathi dough.",
        "Soak rajma overnight(atleast for 6-8 hrs), rinse it well. Pressure cook rajma with enough water and cloves for 5-6 whistles or until soft.Drain water and reserve it as we will be adding it later. Smash it up and set aside.In a pan heat oil - add jeera , allow it to crackle.",
        "Then add onion, ginger garlic paste and fry till it is slightly browned. Then add the smashed up rajma.Add red chilli, garam masala, turmeric powders and required salt.Add the reserved boiled rajma water.",
        "Bring it to a pasty consistency for all the masalas to get blended well, allow for a boil then cook till it forms a whole mass. Add coriander leaves and switch it off.",
        "The stuffing should be semi thick and not dry, set aside. Flour the surface and roll the chappathi dough slightly thicker. Then add rajma stuffing at the center and gather the dough from all sides like shown below.",
        "Seal it finely. Now again flatten it slightly with your palms and then start rolling gently. Roll it without the filling oozing out. Dust flour so that it doesnt stick. Heat a dosa tawa , transfer the rajma parathas, drizzle little oil and cook on both sides until born spots appear."
      ],
      "duration": "52 minutes ",
      "serves": "6",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fksd352qasma-m.webp",
      "nutrition": null
    },
    {
      "id": "d36q5l6km",
      "name": "Kidney Beans Curry-Rajma Masala",
      "url": "http://www.easy-indian-cooking.com/recipe/kidney-beans-curry-rajma-masala/",
      "ingredients": [
        "Kidney Beans (Rajma) –  1 ½ cups",
        "Onion – 2 (chopped)",
        "Tomatoes -2",
        "Garlic -4 flakes",
        "Ginger - 1tsp.",
        "Curry leaves -10",
        "Red chilli powder -1/2 tsp",
        "Asafoetida - 1 pinch",
        "Coriander powder -1 tsp",
        "Garam masala-1tsp",
        "Chicken masala -1/”tsp",
        "Mustard seeds -1/2 tsp",
        "Salt - as per taste",
        "Coconut milk / Cream  - 2 tsp",
        "Oil-1 tsp.",
        "Coriander Leaves - few",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Step 1  - Raw Red Kidney Beans (Rajma):  Take raw red kidney beans in a bow and soak in water for overnight or 5 hours. So that it takes less time to cook.",
        "Step 2: Kidney beans / Rajma preparation:  Cook the soaked rajma in a pressure cooker with salt. Switch off the pressure cooker after 3 whistles. Allow it to cool down to room temperature.  When it is cooled down to room temperature, filter the rajma. (Do not throw the rajma water. We need the rajma water in step 7).  If you are using cooked rajma from tin (readymade cooked Kidney Beans),  Pour the cooked rajma in a bowl. Wash the cooked rajma with more water and keep it for further use.",
        "Step 3 – Tempering and Frying:Grind the Ginger and garlic flakes in to coarse paste. Now heat 1 tsp. of oil on a nonstick pan, add mustard seeds. When it splutters, add curry leaves, cumin seeds, ginger garlic paste and hing. Fry until the raw flavor of ginger and garlic disappears.",
        "Step 4 – Frying Onions:  Add finely chopped/grated onions to the pan, add little salt . Fry it until onions turns golden brown color.  If you are using white onion, it takes little more time compare to red onions.",
        "Step 5 – Onion Tomato sauce preparation:  When onions are fried, add chopped tomatoes (you can also use canned tomatoes or tomato puree), fry until tomatoes mashed with gravy. At this stage oil separates from the gravy.",
        "Step 6 – Masala powders mixing.  Now add coriander powder, red chili powder, garam masala, chicken masala powder to onion tomato sauce. Mix well until the nice aroma comes out from the mixture.",
        "Step 7 – Mixing Kidney Beans with gravy:  Now add cooked rajma/ kidney beans and mix gently. Cover the lid for two mins. So that spices gets mixed up with the cooked rajma. After 2 mins add drained rajma water from step 2 mix well using ladle. The reason why I am using drained rajma water is, in this way you will not lose any nutrients from beans and it also enhances flavor of the curry. Cook it for next 10 minutes.",
        "Step 8 – Garnishing the curry:  Garnish the curry with coriander leaves. Now the rajma curry is ready to serve!",
        "Step 9 - Garnishing - Final Touch:  Now add finely chopped coriander leaves to the hot Rajma (Red Kidney Beans) Curry."
      ],
      "duration": "",
      "serves": 1,
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/d36q5l6km-m.webp",
      "nutrition": null
    },
    {
      "id": "fks2buh771tlvn9",
      "name": "Sama Chawal Khichdi",
      "url": "https://www.vegrecipesofindia.com/samvat-rice-khichdi-recipe-sama-chawal-khichdi/",
      "ingredients": [
        "1 cup sama ke chawal (barnyard millet or samvat rice)",
        "½ cup cubed potatoes (aloo)",
        "1 teaspoon cumin seeds (jeera)",
        "½ teaspoon black pepper (kuti hui kalimirch) – crushed in a mortar-pestle",
        "1 to 1.5 teaspoon ginger-green chili paste (adrak aur hari mirch ka paste) or ½ inch ginger and 1-2 green chilies – crushed in a mortar-pestle",
        "3 cups water",
        "2 tablespoon Ghee or peanut oil (moonghphali ka tel)",
        "2 tablespoon chopped coriander leaves (dhania patta)",
        "Rock salt (edible and food grade) (sendha namak) as required",
        "{\"cal\":\"341\",\"fat\":\"10\",\"carb\":\"56\",\"prot\":\"5\"}"
      ],
      "directions": [
        "In a bowl, soak the sama chawal for an hour. Drain and then keep aside.",
        "In a thick bottomed pan heat 2 tbsp ghee or peanut oil. Add 1 tsp cumin seeds.",
        "Fry the cumin seeds till they change color.",
        "Now add 1 to 1.5 tsp ginger+green chili paste and 1/2 tsp crushed black pepper. Saute till the raw aroma of both the green chilies and ginger goes away.",
        "Then add 1/2 cup potato cubes. Stir and saute for two to three minutes.",
        "Then add the drained sama chawal. Stir and saute for a minute.",
        "Add 3 cups water. Stir again. 3 cups water makes the khichdi mushy, which we prefer. If you want separate grains then just add 1.5 to 2 cups water.",
        "Season with rock salt/sendha namak and stir well.",
        "Cover the pan with a lid and on a low flame allow the grains to simmer and get cooked.",
        "Do check and stir at intervals.",
        "Once the grains have softened and cooked well, switch off the flame. You can add about 2 tbsp chopped coriander leaves here and mix. Also if you prefer, you can add some lemon juice. Since I was serving the khichdi with vrat ki kadhi which is also sour, I did not add lemon juice.",
        ""
      ],
      "duration": "1 hr 35 m",
      "serves": "3",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fks2buh771tlvn9-m.webp",
      "nutrition": null
    },
    {
      "id": "sd6fntpu8eai",
      "name": "Punjabi Rajma (Kidney Beans)",
      "url": "http://www.food.com/recipe/punjabi-rajma-kidney-beans-334391",
      "ingredients": [
        "1 (14 ounce) can cooked red kidney beans",
        "1 -3 tablespoon oil",
        "1/2 teaspoon cumin seed",
        "1 teaspoon chopped fresh ginger",
        "1 chopped red bird's eye chili",
        "1 (14 ounce) can diced tomatoes, no salt added",
        "1/2 teaspoon chili powder",
        "1/2 teaspoon coriander powder",
        "1 teaspoon salt",
        "1 teaspoon garam masala",
        "1 teaspoon hing",
        "1 cup water",
        "1/4 cup chopped fresh cilantro",
        "Chopped cilantro leaf (to garnish)",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Rinse and drain kidney beans.Heat the oil on medium to medium high.Add cumin seeds, ginger, and chilies",
        "Sautee until cumin seeds darken, about one minute, or how you like.Add tomatoes with the water from the can",
        "Simmer uncovered until the liquid has reduced quite a bit, again to your preference",
        "The longer you simmer, the tastier it will be!Add the rest of the spices and mix well.Add the kidney beans and mix well.Add the water",
        "Simmer uncovered until the liquid has evaporated to the consistency you like",
        "Feel free to add more water, or add less to begin with.About 15 minutes before you expect it to finished, add the chopped cilantro and stir.Garnish with the rest of the cilantro when you are ready to eat it!"
      ],
      "duration": "1 hrs 5 mins",
      "serves": "2",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/sd6fntpu8eai-m.webp",
      "nutrition": null
    },
    {
      "id": "772sn00a5ud49",
      "name": "Crock Pot Curry (Aloo Rajma)",
      "url": "http://low-cholesterol.food.com/recipe/crock-pot-curry-aloo-rajma-206165",
      "ingredients": [
        "4 small potatoes, diced or 4 small potatoes, chunked",
        "2 (14 ounce) cans Rotel tomatoes & chilies",
        "2 (15 1/2 ounce) cans kidney beans or 2 (15 1/2 ounce) cans chickpeas",
        "2 white onions, chopped",
        "2 tablespoons olive oil",
        "1 tablespoon good quality curry powder",
        "1 teaspoon cayenne (optional)",
        "1/2 teaspoon cardamom (optional)",
        "1/2 teaspoon ginger (optional)",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Heat olive oil in a saucepan or skillet",
        "Add spices, saute for 1 minute or so.Add onions and saute for 2 - 5 minutes.Add both cans of Rotel.Pour mixture into crockpot",
        "Add potatoes and canned beans to crockpot.Allow to crock on low for 6 - 9 hours or on high for 3 - 5 hours, depending on your crockpot.Serve over rice or with makki di roti (indian cornbread)."
      ],
      "duration": "4 hrs 10 mins",
      "serves": "1",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/772sn00a5ud49-m.webp",
      "nutrition": null
    },
    {
      "id": "6l97135jolhi5",
      "name": "Kidney Bean Chili, Indian Style (Rajma in Masala)",
      "url": "http://www.food.com/recipe/kidney-bean-chili-indian-style-rajma-in-masala-47936",
      "ingredients": [
        "2 1/2 cups uncooked kidney beans",
        "1 medium onion, peeled,quartered and",
        "2 medium onions, peeled,finely chopped",
        "1/2 inch ginger, peeled,chopped",
        "1 tablespoon coriander seed",
        "1 green chili pepper",
        "4 red chili peppers",
        "1/2 teaspoon cumin seed",
        "1/4 inch turmeric or 1/8 teaspoon turmeric powder",
        "10 black peppercorns or 10 black pepper, to taste",
        "2 cinnamon sticks or 1/8 teaspoon ground cinnamon",
        "2 tablespoons ghee or 2 tablespoons clarified butter",
        "1 teaspoon dried mango powder",
        "2 teaspoons salt",
        "3 cups water",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Wash the kidney beans well and soak in water overnight.Next morning, steam them until tender; or cook in a large pot of water for about an hour or until tender.Remove 1/2 cup of cooked beans, crush coarsely and keep aside.Grind 1 onion, ginger, coriander seeds, chili peppers, cumin, turmeric, peppercorns, and cinnamon to a very fine paste.Heat ghee in a large saucepan over medium-high heat.Add the chopped onions and saute until golden brown.Add the ground paste and saute, sprinkling water occasionally, until the ghee starts separating from the paste.Add the cooked beans (not the crushed beans), stir for a while and add salt and dried mango powder.Pour 3 cups of water and add the crushed beans.Mix well and bring to a boil, twice.Serve hot over steamed rice, chappatis, or whole-wheat tortillas.",
        "Next morning, steam them until tender; or cook in a large pot of water for about an hour or until tender.",
        "Remove 1/2 cup of cooked beans, crush coarsely and keep aside.",
        "Grind 1 onion, ginger, coriander seeds, chili peppers, cumin, turmeric, peppercorns, and cinnamon to a very fine paste.",
        "Heat ghee in a large saucepan over medium-high heat.",
        "Add the chopped onions and saute until golden brown.",
        "Add the ground paste and saute, sprinkling water occasionally, until the ghee starts separating from the paste.",
        "Add the cooked beans (not the crushed beans), stir for a while and add salt and dried mango powder.",
        "Pour 3 cups of water and add the crushed beans.",
        "Mix well and bring to a boil, twice.",
        "Serve hot over steamed rice, chappatis, or whole-wheat tortillas.",
        ""
      ],
      "duration": "1 hrs 40 mins",
      "serves": "5",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/6l97135jolhi5-m.webp",
      "nutrition": null
    },
    {
      "id": "fksu14b5776tvn",
      "name": "Dal Makhani",
      "url": "https://www.vegrecipesofindia.com/dal-makhani-restaurant-style-recipe/",
      "ingredients": [
        "¾ cup whole urad dal , 140 grams (whole black gram)",
        "¼ cup rajma , 40 grams (kidney beans)",
        "3 cups water for pressure cooking , 750 ml water",
        "½ cup finely chopped onions , 50 grams onion or 1 medium sized onion",
        "1 teaspoon chopped green chilies or serrano peppers or 1 to 2 green chillies",
        "2 teaspoons Ginger Garlic Paste or 6 to 7 small to medium-sized garlic + 1 inch ginger – crushed to a paste in mortar-pestle",
        "2 large tomatoes , 200 grams tomatoes – pureed or 1 cup tomato puree",
        "½ teaspoon cumin seeds",
        "2 to 3 cloves",
        "2 to 3 green cardamoms",
        "1 black cardamom",
        "1 inch cinnamon",
        "1 small to medium tej patta (Indian bay leaf)",
        "½ teaspoon red chili powder or cayenne pepper or smoked paprika",
        "2 to 3 pinches grated nutmeg or ground nutmeg powder",
        "1 cup water or add as required",
        "¼ to ⅓ cup low fat cream or half and half or 2 tablespoons heavy cream or",
        "¼ teaspoon crushed kasuri methi (dry fenugreek leaves) – optional",
        "3 tablespoon Butter – salted or unsalted",
        "Salt as required",
        "1 small piece of charcoal",
        "½ to ⅔ teaspoon oil – any neutral tasting oil",
        "1 to 2 tablespoons chopped coriander leaves (cilantro)",
        "½ tablespoon low fat cream or half and half for garnish – optional",
        "1 inch ginger julienne – optional",
        "{\"cal\":\"308\",\"fat\":\"13\",\"carb\":\"35\",\"prot\":\"13\"}"
      ],
      "directions": [
        "Soak both the whole urad dal and rajma overnight in enough water for 8 to 9 hours or overnight. Later drain them well.",
        "Rinse both the lentils a couple of times in water.",
        "Drain again and then add them in a 3 litre pressure cooker. Add water and stir well.",
        "Pressure cook for 18 to 20 whistles on a high flame, till both the urad dal and rajma have cooked thoroughly and softened. If they are not cooked, then add about ½ cup water again and pressure cook for 4 to 5 whistles more.",
        "The urad dal should melt in the mouth and should not give any bite or resistance when eaten. You can also just mash the urad dal with a spoon or with your fingers to check the doneness. The same rule applies for rajma too. Keep the cooked beans aside.",
        "In a blender or mixer jar, take chopped tomatoes and blend to a smooth puree. Set aside.",
        "You can also add ready 1 cup tomato puree instead of blending the tomatoes. No need to blanch the tomatoes while pureeing.",
        "In a pan, now heat butter. You can use salted butter or unsalted butter.",
        "Add the whole spices – cumin seeds, cloves, green cardamoms, black cardamom, 1 inch cinnamon, 1 small to medium tej patta.",
        "Fry for some seconds till the spices sputter and become aromatic.",
        "Add finely chopped onions.",
        "Stir and sauté the onions on a low or medium-low heat often till they become light golden.",
        "Add the ginger garlic paste. Stir again and sauté for some seconds till the raw aroma of ginger-garlic goes away.",
        "Add the chopped green chilies and sauté for a minute.",
        "Add the prepared tomato puree and mix well.",
        "Add red chili powder and 2 to 3 pinches of grated nutmeg or nutmeg powder.",
        "Stir very well and sauté this mixture on a low to medium flame, till you see fat releasing from the sides.",
        "Then add the cooked urad dal and rajma beans along with the stock. Also add 1 cup water or as required.",
        "Stir very well and simmer the dal makhani uncovered on a low flame.",
        "Keep on stirring often, so that the lentils don’t stuck to the bottom of the pan.",
        "Once it has begun to thicken, add salt as required.",
        "Stir very well and continue to simmer on a low flame. Keep on stirring when the lentils are simmered on low heat.",
        "When simmering you can add more water if the gravy looks thick or dry. The longer you keep dal makhani to simmer, the better it tastes.",
        "I kept it for about an overall 25 minutes on a low flame. Do keep on stirring at intervals.",
        "When the gravy has thickened enough, then add cream. Dal makhani is not too thick or too thin. It has a medium consistency.",
        "Mix the cream very well. Then switch off the heat.",
        "Add crushed kasuri methi (dried fenugreek leaves). Mix again.",
        "Cover and set dal makhani aside, if you are proceeding to the dhungar method. Or else you can serve dal makhni straight away.",
        "Heat a small piece of charcoal on flame till it becomes red hot. With the help of tongs, keep on turning the charcoal piece so that it evenly burns.",
        "Keep the red hot charcoal in a small bowl.",
        "Pour ½ teaspoon oil on the hot charcoal.",
        "Immediately keep this bowl on top of the dal makhani.",
        "Cover for a minute and allow the charcoal to infuse its smoke in the dal makhni. Remove the bowl. Stir again.",
        "Serve punjabi dal makhani garnished with chopped coriander leaves (cilantro) and a few teaspoons of cream with naan, roti, paratha or steamed rice.",
        ""
      ],
      "duration": "9 hr",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fksu14b5776tvn-m.webp",
      "nutrition": null
    },
    {
      "id": "fks26sfpfpf9kvs",
      "name": "Dal Makhani",
      "url": "http://foodviva.com/punjabi-recipes/dal-makhani/",
      "ingredients": [
        "1/2 cup Whole Black Urad Dal (black lentils), soaked in water for 6-8 hours",
        "3 tablespoons Rajma (red kidney beans), soaked in water for 6-8 hours",
        "2 tablespoons Chana Dal (Bengal gram), soaked in water for 6-8 hours",
        "1/2 teaspoon Cumin Seeds",
        "1 large Onion, finely chopped",
        "1 teaspoon grated Ginger",
        "3-4 cloves of Garlic, crushed",
        "2 Green Chillies, finely chopped",
        "1/4 teaspoon Turmeric Powder",
        "1/2 teaspoon Coriander Powder",
        "1 medium Tomato, finely chopped",
        "2 tablespoons Butter (makkhan)",
        "3 tablespoons Malai (fresh cream)",
        "2 tablespoons finely chopped Coriander Leaves",
        "Salt",
        "1 tablespoon Oil",
        "2 cups + 1 cup Water",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Drain excess water from soaked dals and rajma. Add soaked black urad dal, chana dal and rajma, 2-cups water and salt in 4-5 liter capacity aluminum or steel pressure cooker. Close the lid and pressure cook them over medium flame until 1-whistle, then reduce flame to low and cook for 4-5 whistles.",
        "Turn off flame and let it sit idle and pressure release naturally, approx. 6-8 minutes. The dals and rajma should have turned softer now, open the lid and lightly mash dals with a large spoon. Do not mash completely, there should be some whole dals and rajma present after mashing, it will give the right texture.",
        "Heat oil in a pan over medium flame. Add cumin seeds and allow them to sizzle. Add chopped onion and sauté until it turns translucent. Add grated ginger, crushed garlic and chopped green chilli, sauté until garlic paste turns light brown, about half minute.",
        "Add and mix turmeric powder and coriander powder.",
        "Add chopped tomato and cook until they turn soft, about 2-minutes.",
        "Add cooked dal, salt (only if required, because we have already added it in dal while pressure cooking) and 1-cup water. Let it cook over medium flame for 4-5 minutes or until you get the desired consistency.",
        "Add butter, mix well and cook for 2-minutes.",
        "Add fresh cream.",
        "Mix well and cook for a minute.",
        "Do not cook for long time after adding cream otherwise it may curdle. Remove pan from flame.",
        "Transfer prepared dal to serving bowl. Garnish with chopped coriander leaves or milk cream and serve hot."
      ],
      "duration": "35 minutes ",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fks26sfpfpf9kvs-m.webp",
      "nutrition": null
    },
    {
      "id": "fks1ad8d20mb",
      "name": "Adai , Diabetic Adai Recipe",
      "url": "http://www.tarladalal.com/Adai--Diabetic-Adai-Recipe-22270r",
      "ingredients": [
        "2 tbsp  rice (chawal)",
        "3 tbsp  masoor dal (split red lentil)",
        "3 tbsp  green moong dal (split  green gram)",
        "1 tbsp  urad dal (split black lentils)",
        "1 tsp  fenugreek (methi) seeds",
        "A pinch of asafoetida (hing)",
        "2  green chillies  , finely chopped",
        "1/2 tsp  grated ginger (adrak)",
        "2 tbsp  finely chopped coriander (dhania)",
        "2 tsp  oil",
        "Salt  to taste",
        "4 tbsp  garlic tomato chutney",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Wash and soak the rice, dals and fenugreek seeds in water in separate vessels for 2 hours. Drain and keep aside.",
        "Combine the rice, dals, fenugreek seeds and asafoetida along with enough water and blend in a mixer to a smooth paste.",
        "Add the green chillies, ginger, coriander, salt and a little water if required and mix well.",
        "Heat a non-stick pan and grease it lightly with oil.",
        "Spread 2 tablespoons of the batter to form an adai of 100 mm (4\") diameter.",
        "Cook on both sides till golden brown using a little oil.",
        "Repeat with the remaining batter to make 7 more adais.",
        "Serve hot with garlic tomato chutney."
      ],
      "duration": "20 minutes ",
      "serves": "8",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fks1ad8d20mb-m.webp",
      "nutrition": null
    },
    {
      "id": "fksd7qsbafhl",
      "name": "Mirch Pakora",
      "url": "http://www.flavorsofmumbai.com/mirch-pakora/",
      "ingredients": [
        "2 -3 cups of oil for deep frying",
        "250 gm bhavnagri chilies / mild spiced long chilies / pepper",
        "1 cup gram flour (besan)",
        "2 tbsp rice flour (chawal atta)",
        "1 tsp Kashmiri red chili powder (lal mirch powder)",
        "1 tbsp amchur powder (dry mango powder) or lime juice",
        "1 tsp ajwain seed (carom seed)",
        "Water as required",
        "1 tsp chat masala",
        "A pinch of cooking soda",
        "Black salt or salt as required (namak)",
        "1 cup boiled mashed potatoes (ubale aloo)",
        "1 tsp kashmiri red chili powder (lal mirch powder)",
        "1 tsp roasted cumin powder (bhuna jeera",
        "A pinch of turmeric powder (haldi)",
        "1 tsp coriander seed powder (dhaniya)",
        "1 tbsp amchur powder (dry mango powder)",
        "Black salt as required (namak)",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Rinse the chilies, wipe them with a cloth, slit lengthwise towards the center vertically but don't slit completely as we have to stuff.",
        "Boil the potatoes and place aside.",
        "Sprinkle all the spice powder and salt.",
        "With the help of masher mash or use your finger.",
        "The mixture should be soft and smooth. But don't over mix them.",
        "Take another mixing bowl add sifted gram flour and rice flour. Also add carom seed, all spice powder cooking soda and salt.",
        "Add water and give a nice whisk until they appear smooth. The batter has to be of dropping consistency but towards the thicker side. So add water accordingly.",
        "Fill the slit chilies with the stuffing gently with your hand or spoon.",
        "Ensure its stuffed properly.",
        "Stuff all chilies and place aside.",
        "Heat a kadai or deep vessel with oil.",
        "Dip the stuffed chilies in the batter. Cover or coat them from all sides.",
        "Gently slide in the hot oil. Fry few at a time and don't cluster with too many. Fry them at medium heat until they are crunchy and appear golden brown in color.",
        "Remove them with a slotted spoon.",
        "Place the fried pakoras on absorbent napkin.",
        "Repeat the same with the rest of chilies. If your batter remain not to worry just add some thin potato slices or bread slices and fry them.",
        "Serve your bharwan mirch pakora with bread, tangy tomato sauce and fried chilies."
      ],
      "duration": "40 minutes ",
      "serves": "34",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fksd7qsbafhl-m.webp",
      "nutrition": null
    },
    {
      "id": "fksd7qsc1t7p",
      "name": "Moong Dal Chilla",
      "url": "http://www.flavorsofmumbai.com/moong-dal-chilla-recipe/",
      "ingredients": [
        "250 gms split green skinless mung dal (dhuli mung dal)",
        "2 tbsp oil for frying chillas",
        "1 small onion chopped finely (pyaz)",
        "2 green chilies chopped finely (hari mirch)",
        "½ inch ginger chopped finely (adrak)",
        "1 tsp roasted cumin powder (jeera powder)",
        "2 tbsp rice flour (chawal atta)",
        "½ tsp turmeric powder (haldi)",
        "2 tbsp coriander leaves chopped finely (hara dhaniya)",
        "¼th cup crumbled or grated fresh cottage cheese (paneer) optional",
        "2 tbsp green chutney (optional)",
        "Salt as required",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Firstly soak the split mung lentils enough water covering them over-night or for 4-5 hrs.",
        "Discard the water, grind them with very little water until smooth and soft mixture is formed.",
        "Add rice flour give a nice whisk until they blend well. The batter has to be nor too thick nor too thin it should be of medium consistency. So add water accordingly. Allow the mixture to rest for 15-20 mins.",
        "Add green chili, ginger, onion, coriander leaves if using, cumin powder, turmeric and salt. Combine all nicely.",
        "Heat a non stick pan. Once it's warm pour a scoop of batter towards the center and then spreading towards the exterior giving a round or oval shape. You could use a spatula or a small metal bowl to give a thin shape to your chillas. It's upto you to make your chillas thick or thin. If you make thick it wouldn't be crisp so make accordingly. I prefer crisp and thin dosas but I know people who also love their dosas soft and spongy.",
        "Drizzle some oil towards the edges and fry them until crisp and golden brown from both sides. Spread some green chutney over one side of the dosa.",
        "Also spread some crumbled or grated cottage cheese. Then flip the dosa over other side giving a semi circle or moon shape. I gave my dosas a triangular shape. Also I didn't put paneer as didn't have one at home. So it's optional you could just make the crepes or stuff with paneer it's optional.",
        "Serve your moong dal chillas warm with green chutney and tomato sauce."
      ],
      "duration": "5 hours 20 minutes ",
      "serves": "34",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fksd7qsc1t7p-m.webp",
      "nutrition": null
    },
    {
      "id": "fksd7qsc5k3m",
      "name": "Kand Pakoda Recipe",
      "url": "http://www.flavorsofmumbai.com/kand-pakoda-recipe/",
      "ingredients": [
        "250 gms - 300 gms kand (purple yam)",
        "3 cups oil for deep frying",
        "1.5 cup gram flour (besan)",
        "2 tbsp rice flour (chawal atta)",
        "½ tsp turmeric powder (haldi)",
        "½ tsp carom seed (ajwain)",
        "1 tsp dry mango powder (amcur)",
        "1 tbsp kashmiri chili powder",
        "1 tbsp fennel seed (saunf)",
        "1 tsp cooking soda (optional)",
        "Salt as per taste",
        "Water as required",
        "{\"cal\":\"\",\"fat\":\"\",\"carb\":\"\",\"prot\":\"\"}"
      ],
      "directions": [
        "Rinse the kand, peel the skin and chop them into thin round slices.",
        "Combine gram flour, rice flour, salt, spices powder, fennel seed, carom seed, cooking soda if using and water.",
        "Give a nice whisk until batter is smooth and lump free.",
        "The batter has to be of thick consistency so add water accordingly.",
        "Lastly add 1 tbsp oil to the batter which would give a nice glaze to your batter. This process also helps in absorption of lesser oil.",
        "Heat a deep vessel with oil. Once oil is hot or you could check by adding some drops of batter. If they float up that means your oil is ready.",
        "Just dip each yam slices, coat all over with the batter. remove excess batter if any.",
        "Gently slide them into the heated oil. Fry few at a time don't cluster with too many else they won't fry evenly.",
        "Fry until golden brown from both sides. Place them on absorbent napkin. Repeat the same with the rest of kand slices and batter.",
        "Serve you kand pakoda with chutney, sauce or dip of your choice."
      ],
      "duration": "32 minutes ",
      "serves": "45",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fksd7qsc5k3m-m.webp",
      "nutrition": null
    },
    {
      "id": "fks1kg6cjqsdhin",
      "name": "Makhani Daal",
      "url": "https://www.allrecipes.com/recipe/247107/makhani-daal-buttery-lentils/",
      "ingredients": [
        " 1 cup black lentils (kaali daal) ",
        " ¼ cup split chickpeas (channa daal) ",
        " ¼ cup red kidney beans (rajma) ",
        " 2 teaspoons vegetable oil ",
        " 1  onion, finely chopped ",
        " 1 (2 inch) piece ginger, minced ",
        " 2 cloves garlic, minced ",
        " 1 teaspoon cumin seeds ",
        " 2  tomatoes, finely chopped ",
        " 2 teaspoons ground coriander ",
        " 1 teaspoon garam masala ",
        " ½ teaspoon red chile powder ",
        " ½ teaspoon ground turmeric ",
        "   salt to taste ",
        " 2 teaspoons butter ",
        " 2 teaspoons yogurt ",
        " 3 sprigs cilantro leaves ",
        "{\"cal\":\"332\",\"fat\":\"6\",\"carb\":\"52\",\"prot\":\"19\"}"
      ],
      "directions": [
        "Place black lentils, chickpeas, and red kidney beans in a large container and cover with several inches of cool water let soak, for 6 hours overnight.",
        "Pour the lentil mixture and soaking liquid into a pressure cooker. Bring to high pressure according to manufacturer's instructions and cook until soft, about 20 minutes. Remove from heat and release pressure through the natural release method according to the manufacturer's instructions.",
        "Heat oil in a large skillet over medium heat. Add onion, ginger, garlic, and cumin seeds cook and stir until golden brown, about 3 minutes. Add tomatoes cook and stir until softened, about 2 minutes. Stir in the ground coriander, garam masala, red chile powder, turmeric, and salt.",
        "Fold onion mixture into cooked lentil mixture. Add butter, yogurt, and cilantro leaves and stir to incorporate.\r\n"
      ],
      "duration": "50 m",
      "serves": "4",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fks1kg6cjqsdhin-m.webp",
      "nutrition": null
    },
    {
      "id": "fks144hoan7qcs",
      "name": "Lachha Paratha",
      "url": "https://www.vegrecipesofindia.com/lachedar-paratha-recipe-lachedar-paratha/",
      "ingredients": [
        "2 cups whole wheat flour",
        "1 to 2 tsp Ghee (clarified butter) or oil",
        "Salt as required",
        "Water as required for kneading",
        "Ghee or oil as required for applying on the dough as well as roasting",
        "{\"cal\":\"167\",\"fat\":\"7\",\"carb\":\"19\",\"prot\":\"7\"}"
      ],
      "directions": [
        "In a bowl or vessel take 2 cups whole wheat flour along with salt as per taste.",
        "Add 1 to 2 teaspoons of ghee or oil. Next add water as required in parts.",
        "Knead the whole wheat flour with water to a smooth dough. Cover the bowl with a lid and keep aside to rest for 20 to 30 minutes.",
        "Later make medium sized balls from the dough. Cover the bowl or the pan with a napkin or lid.",
        "Take a dough ball. Roll it into 8 to 8.5 inches diameter thin disc on a dusted rolling board.",
        "Apply ghee or oil liberally on the paratha disc. Sprinkle some flour on the top.",
        "From the edges start to fold and pleat the paratha till the end.",
        "Roll the pleated edges tightly. Join the edges.",
        "Lightly dust with flour and now roll into round parathas of about 7 inches in diameter.",
        "Heat the tava or griddle or frying pan. The tava should be hot. Place the paratha on the tava. Keep the flame to medium-high or high.",
        "Turn the paratha when one side is partly cooked. Apply ghee on this side. Cook for a minute.",
        "Now turn again and apply ghee on the other side.",
        "Flip again for a couple of times, till the parathas are browned evenly and well cooked. Press the sides with the spatula while frying the parathas. As sometimes the edges are not cooked well. So I always press the edges of paratha with a spatula.",
        "Alternatively, you could also add some ghee on the tava and then pan fry the paratha.",
        "Serve the lachha paratha hot with any Indian dal or a vegetable curry of your choice.",
        "Some recipes that will taste very good with these parathas are dal makhani, chana masala, rajma masala, palak paneer, veg kurma, veg kadai, matar paneer, aloo matar etc.",
        "For best taste have these parathas hot. They can also be had with a cup of hot tea or can be had with mango pickle or lemon pickle.",
        ""
      ],
      "duration": "30 m",
      "serves": "8",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fks144hoan7qcs-m.webp",
      "nutrition": null
    },
    {
      "id": "fks1ac5rledsbh3",
      "name": "No Yeast Naan",
      "url": "https://www.vegrecipesofindia.com/naan-recipe-without-yeast/",
      "ingredients": [
        "¼ cup curd or yogurt – can use cashew or almond yogurt",
        "1 tsp sugar or organic unrefined cane sugar",
        "1 tsp baking powder",
        "1 pinch baking soda",
        "2 cups all-purpose flour (maida)",
        "1 tsp salt or add as required",
        "2 tbsp oil – butter can also be added",
        "¼ to ⅓ cup water or add as required",
        "1 tbsp onion seeds (kalonji) or melon seeds or sesame seeds",
        "Butter or ghee or oil – as required for spreading on naan (optional)",
        "{\"cal\":\"135\",\"fat\":\"4\",\"carb\":\"22\",\"prot\":\"3\"}"
      ],
      "directions": [
        "In a mixing bowl take ¼ cup fresh curd or yogurt. For a vegan naan, use almond or cashew yogurt.",
        "Add 1 teaspoon sugar, 1 teaspoon baking powder and 1 pinch baking soda.",
        "Mix all the ingredients very well till the sugar dissolves.",
        "Now add 2 cups all-purpose flour (maida), 1 teaspoon salt or add as required.",
        "Mix again with a spoon so that the salt is evenly distributed in the flour.",
        "Make a well in the center and add 2 tablespoons oil. Note that you can even add butter instead of oil.",
        "Add ¼ to ⅓ cup water or add as required.",
        "First mix and then begin to knead.",
        "Knead to a smooth and soft dough. If the curd is thick, then you may need to add some more water. In case the dough looks dry, then add some more water and knead. If it becomes sticky, then sprinkle some flour and knead again. You should get a soft stretchy dough.",
        "Flatten the dough and spread some oil all over the dough. Place in the same bowl.",
        "Place a moist kitchen towel or napkin completely covering on the dough. Cover the bowl with a lid and let the dough leaven for 2 hours.",
        "Make medium-sized balls from the dough.",
        "Flatten slightly and sprinkle some flour on the dough as well as on the rolling board.",
        "Sprinkle some onion seeds or sesame seeds (black or white) or melon seeds on the rolled dough.",
        "Roll into a 6 to 7 inches elongated circle.",
        "Roll the top side to get a tapering edge. You can even gently pull the dough with your hands to get this pointed edge. The naan will have a tear-shaped form.",
        "Heat a skillet or tawa or griddle and keep it on medium-high to high flame. Place the naan bread ready on the hot tawa or skillet or griddle.",
        "Keep the flame to medium-high or high and begin to cook the naan bread.",
        "Let one side get partly cooked. You will see some air pockets on the naan.",
        "When you start seeing the air-pockets, then flip.",
        "Now cook the second side on medium-high to high flame.",
        "Again you will see air-pockets appearing on the second side.",
        "Flip when you see many air-pockets on the naan and place naan directly on the stovetop flame.",
        "Grill the first side on the flame till you see some charred spots and blisters.",
        "Also, roast the edges.",
        "Turn over and roast the second side too till you see some charred spots.",
        "Place it on a plate or tray. Spread or brush with some softened butter or melted butter. You can even use ghee (clarified butter or oil for a vegan version. You can even skip using butter or oil entirely.",
        "Heat the griddle or skillet on a high flame. Place the naan on the hot griddle or tawa.",
        "You will see some air pockets on the naan.",
        "Flip the naan bread.",
        "Cook the second side more than the first side. Please note that on a high flame they will get cooked faster.",
        "Press the edges with a spatula so that they are also roasted and cooked properly.",
        "Flip again.",
        "You can flip again and press the edges for even cooking. Remove and spread some butter or oil. Serve hot. This way make naan with any of the methods. You can even stack cooked naans in a casserole box or roti basket and serve later.",
        "Serve the naan bread hot or warm with your favorite curry dish – malai kofta or palak paneer or matar paneer or lentils like dal tadka or dal makhani or chole masala or rajma masala or dal bukhara.",
        ""
      ],
      "duration": "30 m",
      "serves": "9",
      "calorie": null,
      "img": "http://recipecdn.cookbookrecipes.in/fks1ac5rledsbh3-m.webp",
      "nutrition": null
    }
  ]
}